zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/**
 * \brief Component description for PIC32CZ/CA70 GMAC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_GMAC_COMPONENT_H_
#define _PIC32CZ_CA70_GMAC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_GMAC Gigabit Ethernet MAC
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR GMAC */
/* ========================================================================== */

/* -------- GMAC_SAB : (GMAC Offset: 0x00) (R/W 32) Specific Address 1 Bottom Register -------- */

typedef union
{
  struct
  {
    uint32_t ADDR:32;                   /**< bit:  0..31  Specific Address 1                            */
  };
  uint32_t w;
} __GMAC_SAB_bits_t;

#define GMAC_SAB_ADDR_Pos                     (0)                                            /**< (GMAC_SAB) Specific Address 1 Position */
#define GMAC_SAB_ADDR_Msk                     (0xFFFFFFFFU << GMAC_SAB_ADDR_Pos)             /**< (GMAC_SAB) Specific Address 1 Mask */
#define GMAC_SAB_ADDR(value)                  (GMAC_SAB_ADDR_Msk & ((value) << GMAC_SAB_ADDR_Pos))
#define GMAC_SAB_Msk                          (0xFFFFFFFFUL)                                 /**< (GMAC_SAB) Register Mask  */

/* -------- GMAC_SAT : (GMAC Offset: 0x04) (R/W 32) Specific Address 1 Top Register -------- */

typedef union
{
  struct
  {
    uint32_t ADDR:16;                   /**< bit:  0..15  Specific Address 1                            */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_SAT_bits_t;

#define GMAC_SAT_ADDR_Pos                     (0)                                            /**< (GMAC_SAT) Specific Address 1 Position */
#define GMAC_SAT_ADDR_Msk                     (0xFFFFU << GMAC_SAT_ADDR_Pos)                 /**< (GMAC_SAT) Specific Address 1 Mask */
#define GMAC_SAT_ADDR(value)                  (GMAC_SAT_ADDR_Msk & ((value) << GMAC_SAT_ADDR_Pos))
#define GMAC_SAT_Msk                          (0x0000FFFFUL)                                 /**< (GMAC_SAT) Register Mask  */

/* -------- GMAC_NCR : (GMAC Offset: 0x00) (R/W 32) Network Control Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t LBL:1;                     /**< bit:      1  Loop Back Local                               */
    uint32_t RXEN:1;                    /**< bit:      2  Receive Enable                                */
    uint32_t TXEN:1;                    /**< bit:      3  Transmit Enable                               */
    uint32_t MPE:1;                     /**< bit:      4  Management Port Enable                        */
    uint32_t CLRSTAT:1;                 /**< bit:      5  Clear Statistics Registers                    */
    uint32_t INCSTAT:1;                 /**< bit:      6  Increment Statistics Registers                */
    uint32_t WESTAT:1;                  /**< bit:      7  Write Enable for Statistics Registers         */
    uint32_t BP:1;                      /**< bit:      8  Back pressure                                 */
    uint32_t TSTART:1;                  /**< bit:      9  Start Transmission                            */
    uint32_t THALT:1;                   /**< bit:     10  Transmit Halt                                 */
    uint32_t TXPF:1;                    /**< bit:     11  Transmit Pause Frame                          */
    uint32_t TXZQPF:1;                  /**< bit:     12  Transmit Zero Quantum Pause Frame             */
    uint32_t :2;                        /**< bit: 13..14  Reserved                                      */
    uint32_t SRTSM:1;                   /**< bit:     15  Store Receive Time Stamp to Memory            */
    uint32_t ENPBPR:1;                  /**< bit:     16  Enable PFC Priority-based Pause Reception     */
    uint32_t TXPBPF:1;                  /**< bit:     17  Transmit PFC Priority-based Pause Frame       */
    uint32_t FNP:1;                     /**< bit:     18  Flush Next Packet                             */
    uint32_t TXLPIEN:1;                 /**< bit:     19  Enable LPI Transmission                       */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_NCR_bits_t;

#define GMAC_NCR_LBL_Pos                      (1)                                            /**< (GMAC_NCR) Loop Back Local Position */
#define GMAC_NCR_LBL_Msk                      (0x1U << GMAC_NCR_LBL_Pos)                     /**< (GMAC_NCR) Loop Back Local Mask */
#define GMAC_NCR_RXEN_Pos                     (2)                                            /**< (GMAC_NCR) Receive Enable Position */
#define GMAC_NCR_RXEN_Msk                     (0x1U << GMAC_NCR_RXEN_Pos)                    /**< (GMAC_NCR) Receive Enable Mask */
#define GMAC_NCR_TXEN_Pos                     (3)                                            /**< (GMAC_NCR) Transmit Enable Position */
#define GMAC_NCR_TXEN_Msk                     (0x1U << GMAC_NCR_TXEN_Pos)                    /**< (GMAC_NCR) Transmit Enable Mask */
#define GMAC_NCR_MPE_Pos                      (4)                                            /**< (GMAC_NCR) Management Port Enable Position */
#define GMAC_NCR_MPE_Msk                      (0x1U << GMAC_NCR_MPE_Pos)                     /**< (GMAC_NCR) Management Port Enable Mask */
#define GMAC_NCR_CLRSTAT_Pos                  (5)                                            /**< (GMAC_NCR) Clear Statistics Registers Position */
#define GMAC_NCR_CLRSTAT_Msk                  (0x1U << GMAC_NCR_CLRSTAT_Pos)                 /**< (GMAC_NCR) Clear Statistics Registers Mask */
#define GMAC_NCR_INCSTAT_Pos                  (6)                                            /**< (GMAC_NCR) Increment Statistics Registers Position */
#define GMAC_NCR_INCSTAT_Msk                  (0x1U << GMAC_NCR_INCSTAT_Pos)                 /**< (GMAC_NCR) Increment Statistics Registers Mask */
#define GMAC_NCR_WESTAT_Pos                   (7)                                            /**< (GMAC_NCR) Write Enable for Statistics Registers Position */
#define GMAC_NCR_WESTAT_Msk                   (0x1U << GMAC_NCR_WESTAT_Pos)                  /**< (GMAC_NCR) Write Enable for Statistics Registers Mask */
#define GMAC_NCR_BP_Pos                       (8)                                            /**< (GMAC_NCR) Back pressure Position */
#define GMAC_NCR_BP_Msk                       (0x1U << GMAC_NCR_BP_Pos)                      /**< (GMAC_NCR) Back pressure Mask */
#define GMAC_NCR_TSTART_Pos                   (9)                                            /**< (GMAC_NCR) Start Transmission Position */
#define GMAC_NCR_TSTART_Msk                   (0x1U << GMAC_NCR_TSTART_Pos)                  /**< (GMAC_NCR) Start Transmission Mask */
#define GMAC_NCR_THALT_Pos                    (10)                                           /**< (GMAC_NCR) Transmit Halt Position */
#define GMAC_NCR_THALT_Msk                    (0x1U << GMAC_NCR_THALT_Pos)                   /**< (GMAC_NCR) Transmit Halt Mask */
#define GMAC_NCR_TXPF_Pos                     (11)                                           /**< (GMAC_NCR) Transmit Pause Frame Position */
#define GMAC_NCR_TXPF_Msk                     (0x1U << GMAC_NCR_TXPF_Pos)                    /**< (GMAC_NCR) Transmit Pause Frame Mask */
#define GMAC_NCR_TXZQPF_Pos                   (12)                                           /**< (GMAC_NCR) Transmit Zero Quantum Pause Frame Position */
#define GMAC_NCR_TXZQPF_Msk                   (0x1U << GMAC_NCR_TXZQPF_Pos)                  /**< (GMAC_NCR) Transmit Zero Quantum Pause Frame Mask */
#define GMAC_NCR_SRTSM_Pos                    (15)                                           /**< (GMAC_NCR) Store Receive Time Stamp to Memory Position */
#define GMAC_NCR_SRTSM_Msk                    (0x1U << GMAC_NCR_SRTSM_Pos)                   /**< (GMAC_NCR) Store Receive Time Stamp to Memory Mask */
#define GMAC_NCR_ENPBPR_Pos                   (16)                                           /**< (GMAC_NCR) Enable PFC Priority-based Pause Reception Position */
#define GMAC_NCR_ENPBPR_Msk                   (0x1U << GMAC_NCR_ENPBPR_Pos)                  /**< (GMAC_NCR) Enable PFC Priority-based Pause Reception Mask */
#define GMAC_NCR_TXPBPF_Pos                   (17)                                           /**< (GMAC_NCR) Transmit PFC Priority-based Pause Frame Position */
#define GMAC_NCR_TXPBPF_Msk                   (0x1U << GMAC_NCR_TXPBPF_Pos)                  /**< (GMAC_NCR) Transmit PFC Priority-based Pause Frame Mask */
#define GMAC_NCR_FNP_Pos                      (18)                                           /**< (GMAC_NCR) Flush Next Packet Position */
#define GMAC_NCR_FNP_Msk                      (0x1U << GMAC_NCR_FNP_Pos)                     /**< (GMAC_NCR) Flush Next Packet Mask */
#define GMAC_NCR_TXLPIEN_Pos                  (19)                                           /**< (GMAC_NCR) Enable LPI Transmission Position */
#define GMAC_NCR_TXLPIEN_Msk                  (0x1U << GMAC_NCR_TXLPIEN_Pos)                 /**< (GMAC_NCR) Enable LPI Transmission Mask */
#define GMAC_NCR_Msk                          (0x000F9FFEUL)                                 /**< (GMAC_NCR) Register Mask  */

