zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_NCFGR : (GMAC Offset: 0x04) (R/W 32) Network Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t SPD:1;                     /**< bit:      0  Speed                                         */
    uint32_t FD:1;                      /**< bit:      1  Full Duplex                                   */
    uint32_t DNVLAN:1;                  /**< bit:      2  Discard Non-VLAN FRAMES                       */
    uint32_t JFRAME:1;                  /**< bit:      3  Jumbo Frame Size                              */
    uint32_t CAF:1;                     /**< bit:      4  Copy All Frames                               */
    uint32_t NBC:1;                     /**< bit:      5  No Broadcast                                  */
    uint32_t MTIHEN:1;                  /**< bit:      6  Multicast Hash Enable                         */
    uint32_t UNIHEN:1;                  /**< bit:      7  Unicast Hash Enable                           */
    uint32_t MAXFS:1;                   /**< bit:      8  1536 Maximum Frame Size                       */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t RTY:1;                     /**< bit:     12  Retry Test                                    */
    uint32_t PEN:1;                     /**< bit:     13  Pause Enable                                  */
    uint32_t RXBUFO:2;                  /**< bit: 14..15  Receive Buffer Offset                         */
    uint32_t LFERD:1;                   /**< bit:     16  Length Field Error Frame Discard              */
    uint32_t RFCS:1;                    /**< bit:     17  Remove FCS                                    */
    uint32_t CLK:3;                     /**< bit: 18..20  MDC CLock Division                            */
    uint32_t DBW:2;                     /**< bit: 21..22  Data Bus Width                                */
    uint32_t DCPF:1;                    /**< bit:     23  Disable Copy of Pause Frames                  */
    uint32_t RXCOEN:1;                  /**< bit:     24  Receive Checksum Offload Enable               */
    uint32_t EFRHD:1;                   /**< bit:     25  Enable Frames Received in Half Duplex         */
    uint32_t IRXFCS:1;                  /**< bit:     26  Ignore RX FCS                                 */
    uint32_t :1;                        /**< bit:     27  Reserved                                      */
    uint32_t IPGSEN:1;                  /**< bit:     28  IP Stretch Enable                             */
    uint32_t RXBP:1;                    /**< bit:     29  Receive Bad Preamble                          */
    uint32_t IRXER:1;                   /**< bit:     30  Ignore IPG GRXER                              */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_NCFGR_bits_t;

#define GMAC_NCFGR_SPD_Pos                    (0)                                            /**< (GMAC_NCFGR) Speed Position */
#define GMAC_NCFGR_SPD_Msk                    (0x1U << GMAC_NCFGR_SPD_Pos)                   /**< (GMAC_NCFGR) Speed Mask */
#define GMAC_NCFGR_FD_Pos                     (1)                                            /**< (GMAC_NCFGR) Full Duplex Position */
#define GMAC_NCFGR_FD_Msk                     (0x1U << GMAC_NCFGR_FD_Pos)                    /**< (GMAC_NCFGR) Full Duplex Mask */
#define GMAC_NCFGR_DNVLAN_Pos                 (2)                                            /**< (GMAC_NCFGR) Discard Non-VLAN FRAMES Position */
#define GMAC_NCFGR_DNVLAN_Msk                 (0x1U << GMAC_NCFGR_DNVLAN_Pos)                /**< (GMAC_NCFGR) Discard Non-VLAN FRAMES Mask */
#define GMAC_NCFGR_JFRAME_Pos                 (3)                                            /**< (GMAC_NCFGR) Jumbo Frame Size Position */
#define GMAC_NCFGR_JFRAME_Msk                 (0x1U << GMAC_NCFGR_JFRAME_Pos)                /**< (GMAC_NCFGR) Jumbo Frame Size Mask */
#define GMAC_NCFGR_CAF_Pos                    (4)                                            /**< (GMAC_NCFGR) Copy All Frames Position */
#define GMAC_NCFGR_CAF_Msk                    (0x1U << GMAC_NCFGR_CAF_Pos)                   /**< (GMAC_NCFGR) Copy All Frames Mask */
#define GMAC_NCFGR_NBC_Pos                    (5)                                            /**< (GMAC_NCFGR) No Broadcast Position */
#define GMAC_NCFGR_NBC_Msk                    (0x1U << GMAC_NCFGR_NBC_Pos)                   /**< (GMAC_NCFGR) No Broadcast Mask */
#define GMAC_NCFGR_MTIHEN_Pos                 (6)                                            /**< (GMAC_NCFGR) Multicast Hash Enable Position */
#define GMAC_NCFGR_MTIHEN_Msk                 (0x1U << GMAC_NCFGR_MTIHEN_Pos)                /**< (GMAC_NCFGR) Multicast Hash Enable Mask */
#define GMAC_NCFGR_UNIHEN_Pos                 (7)                                            /**< (GMAC_NCFGR) Unicast Hash Enable Position */
#define GMAC_NCFGR_UNIHEN_Msk                 (0x1U << GMAC_NCFGR_UNIHEN_Pos)                /**< (GMAC_NCFGR) Unicast Hash Enable Mask */
#define GMAC_NCFGR_MAXFS_Pos                  (8)                                            /**< (GMAC_NCFGR) 1536 Maximum Frame Size Position */
#define GMAC_NCFGR_MAXFS_Msk                  (0x1U << GMAC_NCFGR_MAXFS_Pos)                 /**< (GMAC_NCFGR) 1536 Maximum Frame Size Mask */
#define GMAC_NCFGR_RTY_Pos                    (12)                                           /**< (GMAC_NCFGR) Retry Test Position */
#define GMAC_NCFGR_RTY_Msk                    (0x1U << GMAC_NCFGR_RTY_Pos)                   /**< (GMAC_NCFGR) Retry Test Mask */
#define GMAC_NCFGR_PEN_Pos                    (13)                                           /**< (GMAC_NCFGR) Pause Enable Position */
#define GMAC_NCFGR_PEN_Msk                    (0x1U << GMAC_NCFGR_PEN_Pos)                   /**< (GMAC_NCFGR) Pause Enable Mask */
#define GMAC_NCFGR_RXBUFO_Pos                 (14)                                           /**< (GMAC_NCFGR) Receive Buffer Offset Position */
#define GMAC_NCFGR_RXBUFO_Msk                 (0x3U << GMAC_NCFGR_RXBUFO_Pos)                /**< (GMAC_NCFGR) Receive Buffer Offset Mask */
#define GMAC_NCFGR_RXBUFO(value)              (GMAC_NCFGR_RXBUFO_Msk & ((value) << GMAC_NCFGR_RXBUFO_Pos))
#define GMAC_NCFGR_LFERD_Pos                  (16)                                           /**< (GMAC_NCFGR) Length Field Error Frame Discard Position */
#define GMAC_NCFGR_LFERD_Msk                  (0x1U << GMAC_NCFGR_LFERD_Pos)                 /**< (GMAC_NCFGR) Length Field Error Frame Discard Mask */
#define GMAC_NCFGR_RFCS_Pos                   (17)                                           /**< (GMAC_NCFGR) Remove FCS Position */
#define GMAC_NCFGR_RFCS_Msk                   (0x1U << GMAC_NCFGR_RFCS_Pos)                  /**< (GMAC_NCFGR) Remove FCS Mask */
#define GMAC_NCFGR_CLK_Pos                    (18)                                           /**< (GMAC_NCFGR) MDC CLock Division Position */
#define GMAC_NCFGR_CLK_Msk                    (0x7U << GMAC_NCFGR_CLK_Pos)                   /**< (GMAC_NCFGR) MDC CLock Division Mask */
#define GMAC_NCFGR_CLK(value)                 (GMAC_NCFGR_CLK_Msk & ((value) << GMAC_NCFGR_CLK_Pos))
#define   GMAC_NCFGR_CLK_MCK_8_Val            (0x0U)                                         /**< (GMAC_NCFGR) MCK divided by 8 (MCK up to 20 MHz)  */
#define   GMAC_NCFGR_CLK_MCK_16_Val           (0x1U)                                         /**< (GMAC_NCFGR) MCK divided by 16 (MCK up to 40 MHz)  */
#define   GMAC_NCFGR_CLK_MCK_32_Val           (0x2U)                                         /**< (GMAC_NCFGR) MCK divided by 32 (MCK up to 80 MHz)  */
#define   GMAC_NCFGR_CLK_MCK_48_Val           (0x3U)                                         /**< (GMAC_NCFGR) MCK divided by 48 (MCK up to 120 MHz)  */
#define   GMAC_NCFGR_CLK_MCK_64_Val           (0x4U)                                         /**< (GMAC_NCFGR) MCK divided by 64 (MCK up to 160 MHz)  */
#define   GMAC_NCFGR_CLK_MCK_96_Val           (0x5U)                                         /**< (GMAC_NCFGR) MCK divided by 96 (MCK up to 240 MHz)  */
#define GMAC_NCFGR_CLK_MCK_8                  (GMAC_NCFGR_CLK_MCK_8_Val << GMAC_NCFGR_CLK_Pos)  /**< (GMAC_NCFGR) MCK divided by 8 (MCK up to 20 MHz) Position  */
#define GMAC_NCFGR_CLK_MCK_16                 (GMAC_NCFGR_CLK_MCK_16_Val << GMAC_NCFGR_CLK_Pos)  /**< (GMAC_NCFGR) MCK divided by 16 (MCK up to 40 MHz) Position  */
#define GMAC_NCFGR_CLK_MCK_32                 (GMAC_NCFGR_CLK_MCK_32_Val << GMAC_NCFGR_CLK_Pos)  /**< (GMAC_NCFGR) MCK divided by 32 (MCK up to 80 MHz) Position  */
#define GMAC_NCFGR_CLK_MCK_48                 (GMAC_NCFGR_CLK_MCK_48_Val << GMAC_NCFGR_CLK_Pos)  /**< (GMAC_NCFGR) MCK divided by 48 (MCK up to 120 MHz) Position  */
#define GMAC_NCFGR_CLK_MCK_64                 (GMAC_NCFGR_CLK_MCK_64_Val << GMAC_NCFGR_CLK_Pos)  /**< (GMAC_NCFGR) MCK divided by 64 (MCK up to 160 MHz) Position  */
#define GMAC_NCFGR_CLK_MCK_96                 (GMAC_NCFGR_CLK_MCK_96_Val << GMAC_NCFGR_CLK_Pos)  /**< (GMAC_NCFGR) MCK divided by 96 (MCK up to 240 MHz) Position  */
#define GMAC_NCFGR_DBW_Pos                    (21)                                           /**< (GMAC_NCFGR) Data Bus Width Position */
#define GMAC_NCFGR_DBW_Msk                    (0x3U << GMAC_NCFGR_DBW_Pos)                   /**< (GMAC_NCFGR) Data Bus Width Mask */
#define GMAC_NCFGR_DBW(value)                 (GMAC_NCFGR_DBW_Msk & ((value) << GMAC_NCFGR_DBW_Pos))
#define GMAC_NCFGR_DCPF_Pos                   (23)                                           /**< (GMAC_NCFGR) Disable Copy of Pause Frames Position */
#define GMAC_NCFGR_DCPF_Msk                   (0x1U << GMAC_NCFGR_DCPF_Pos)                  /**< (GMAC_NCFGR) Disable Copy of Pause Frames Mask */
#define GMAC_NCFGR_RXCOEN_Pos                 (24)                                           /**< (GMAC_NCFGR) Receive Checksum Offload Enable Position */
#define GMAC_NCFGR_RXCOEN_Msk                 (0x1U << GMAC_NCFGR_RXCOEN_Pos)                /**< (GMAC_NCFGR) Receive Checksum Offload Enable Mask */
#define GMAC_NCFGR_EFRHD_Pos                  (25)                                           /**< (GMAC_NCFGR) Enable Frames Received in Half Duplex Position */
#define GMAC_NCFGR_EFRHD_Msk                  (0x1U << GMAC_NCFGR_EFRHD_Pos)                 /**< (GMAC_NCFGR) Enable Frames Received in Half Duplex Mask */
#define GMAC_NCFGR_IRXFCS_Pos                 (26)                                           /**< (GMAC_NCFGR) Ignore RX FCS Position */
#define GMAC_NCFGR_IRXFCS_Msk                 (0x1U << GMAC_NCFGR_IRXFCS_Pos)                /**< (GMAC_NCFGR) Ignore RX FCS Mask */
#define GMAC_NCFGR_IPGSEN_Pos                 (28)                                           /**< (GMAC_NCFGR) IP Stretch Enable Position */
#define GMAC_NCFGR_IPGSEN_Msk                 (0x1U << GMAC_NCFGR_IPGSEN_Pos)                /**< (GMAC_NCFGR) IP Stretch Enable Mask */
#define GMAC_NCFGR_RXBP_Pos                   (29)                                           /**< (GMAC_NCFGR) Receive Bad Preamble Position */
#define GMAC_NCFGR_RXBP_Msk                   (0x1U << GMAC_NCFGR_RXBP_Pos)                  /**< (GMAC_NCFGR) Receive Bad Preamble Mask */
#define GMAC_NCFGR_IRXER_Pos                  (30)                                           /**< (GMAC_NCFGR) Ignore IPG GRXER Position */
#define GMAC_NCFGR_IRXER_Msk                  (0x1U << GMAC_NCFGR_IRXER_Pos)                 /**< (GMAC_NCFGR) Ignore IPG GRXER Mask */
#define GMAC_NCFGR_Msk                        (0x77FFF1FFUL)                                 /**< (GMAC_NCFGR) Register Mask  */

/* -------- GMAC_NSR : (GMAC Offset: 0x08) (R/ 32) Network Status Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t MDIO:1;                    /**< bit:      1  MDIO Input Status                             */
    uint32_t IDLE:1;                    /**< bit:      2  PHY Management Logic Idle                     */
    uint32_t :4;                        /**< bit:   3..6  Reserved                                      */
    uint32_t RXLPIS:1;                  /**< bit:      7  LPI Indication                                */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_NSR_bits_t;

#define GMAC_NSR_MDIO_Pos                     (1)                                            /**< (GMAC_NSR) MDIO Input Status Position */
#define GMAC_NSR_MDIO_Msk                     (0x1U << GMAC_NSR_MDIO_Pos)                    /**< (GMAC_NSR) MDIO Input Status Mask */
#define GMAC_NSR_IDLE_Pos                     (2)                                            /**< (GMAC_NSR) PHY Management Logic Idle Position */
#define GMAC_NSR_IDLE_Msk                     (0x1U << GMAC_NSR_IDLE_Pos)                    /**< (GMAC_NSR) PHY Management Logic Idle Mask */
#define GMAC_NSR_RXLPIS_Pos                   (7)                                            /**< (GMAC_NSR) LPI Indication Position */
#define GMAC_NSR_RXLPIS_Msk                   (0x1U << GMAC_NSR_RXLPIS_Pos)                  /**< (GMAC_NSR) LPI Indication Mask */
#define GMAC_NSR_Msk                          (0x00000086UL)                                 /**< (GMAC_NSR) Register Mask  */

/* -------- GMAC_UR : (GMAC Offset: 0x0c) (R/W 32) User Register -------- */

typedef union
{
  struct
  {
    uint32_t RMII:1;                    /**< bit:      0  Reduced MII Mode                              */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_UR_bits_t;

#define GMAC_UR_RMII_Pos                      (0)                                            /**< (GMAC_UR) Reduced MII Mode Position */
#define GMAC_UR_RMII_Msk                      (0x1U << GMAC_UR_RMII_Pos)                     /**< (GMAC_UR) Reduced MII Mode Mask */
#define GMAC_UR_Msk                           (0x00000001UL)                                 /**< (GMAC_UR) Register Mask  */

/* -------- GMAC_DCFGR : (GMAC Offset: 0x10) (R/W 32) DMA Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t FBLDO:5;                   /**< bit:   0..4  Fixed Burst Length for DMA Data Operations:   */
    uint32_t :1;                        /**< bit:      5  Reserved                                      */
    uint32_t ESMA:1;                    /**< bit:      6  Endian Swap Mode Enable for Management Descriptor Accesses */
    uint32_t ESPA:1;                    /**< bit:      7  Endian Swap Mode Enable for Packet Data Accesses */
    uint32_t RXBMS:2;                   /**< bit:   8..9  Receiver Packet Buffer Memory Size Select     */
    uint32_t TXPBMS:1;                  /**< bit:     10  Transmitter Packet Buffer Memory Size Select  */
    uint32_t TXCOEN:1;                  /**< bit:     11  Transmitter Checksum Generation Offload Enable */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t DRBS:8;                    /**< bit: 16..23  DMA Receive Buffer Size                       */
    uint32_t DDRP:1;                    /**< bit:     24  DMA Discard Receive Packets                   */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_DCFGR_bits_t;

#define GMAC_DCFGR_FBLDO_Pos                  (0)                                            /**< (GMAC_DCFGR) Fixed Burst Length for DMA Data Operations: Position */
#define GMAC_DCFGR_FBLDO_Msk                  (0x1FU << GMAC_DCFGR_FBLDO_Pos)                /**< (GMAC_DCFGR) Fixed Burst Length for DMA Data Operations: Mask */
#define GMAC_DCFGR_FBLDO(value)               (GMAC_DCFGR_FBLDO_Msk & ((value) << GMAC_DCFGR_FBLDO_Pos))
#define   GMAC_DCFGR_FBLDO_SINGLE_Val         (0x1U)                                         /**< (GMAC_DCFGR) 00001: Always use SINGLE AHB bursts  */
#define   GMAC_DCFGR_FBLDO_INCR4_Val          (0x4U)                                         /**< (GMAC_DCFGR) 001xx: Attempt to use INCR4 AHB bursts (Default)  */
#define   GMAC_DCFGR_FBLDO_INCR8_Val          (0x8U)                                         /**< (GMAC_DCFGR) 01xxx: Attempt to use INCR8 AHB bursts  */
#define   GMAC_DCFGR_FBLDO_INCR16_Val         (0x10U)                                        /**< (GMAC_DCFGR) 1xxxx: Attempt to use INCR16 AHB bursts  */
#define GMAC_DCFGR_FBLDO_SINGLE               (GMAC_DCFGR_FBLDO_SINGLE_Val << GMAC_DCFGR_FBLDO_Pos)  /**< (GMAC_DCFGR) 00001: Always use SINGLE AHB bursts Position  */
#define GMAC_DCFGR_FBLDO_INCR4                (GMAC_DCFGR_FBLDO_INCR4_Val << GMAC_DCFGR_FBLDO_Pos)  /**< (GMAC_DCFGR) 001xx: Attempt to use INCR4 AHB bursts (Default) Position  */
#define GMAC_DCFGR_FBLDO_INCR8                (GMAC_DCFGR_FBLDO_INCR8_Val << GMAC_DCFGR_FBLDO_Pos)  /**< (GMAC_DCFGR) 01xxx: Attempt to use INCR8 AHB bursts Position  */
#define GMAC_DCFGR_FBLDO_INCR16               (GMAC_DCFGR_FBLDO_INCR16_Val << GMAC_DCFGR_FBLDO_Pos)  /**< (GMAC_DCFGR) 1xxxx: Attempt to use INCR16 AHB bursts Position  */
#define GMAC_DCFGR_ESMA_Pos                   (6)                                            /**< (GMAC_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Position */
#define GMAC_DCFGR_ESMA_Msk                   (0x1U << GMAC_DCFGR_ESMA_Pos)                  /**< (GMAC_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Mask */
#define GMAC_DCFGR_ESPA_Pos                   (7)                                            /**< (GMAC_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Position */
#define GMAC_DCFGR_ESPA_Msk                   (0x1U << GMAC_DCFGR_ESPA_Pos)                  /**< (GMAC_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Mask */
#define GMAC_DCFGR_RXBMS_Pos                  (8)                                            /**< (GMAC_DCFGR) Receiver Packet Buffer Memory Size Select Position */
#define GMAC_DCFGR_RXBMS_Msk                  (0x3U << GMAC_DCFGR_RXBMS_Pos)                 /**< (GMAC_DCFGR) Receiver Packet Buffer Memory Size Select Mask */
#define GMAC_DCFGR_RXBMS(value)               (GMAC_DCFGR_RXBMS_Msk & ((value) << GMAC_DCFGR_RXBMS_Pos))
#define   GMAC_DCFGR_RXBMS_EIGHTH_Val         (0x0U)                                         /**< (GMAC_DCFGR) 4/8 Kbyte Memory Size  */
#define   GMAC_DCFGR_RXBMS_QUARTER_Val        (0x1U)                                         /**< (GMAC_DCFGR) 4/4 Kbytes Memory Size  */
#define   GMAC_DCFGR_RXBMS_HALF_Val           (0x2U)                                         /**< (GMAC_DCFGR) 4/2 Kbytes Memory Size  */
#define   GMAC_DCFGR_RXBMS_FULL_Val           (0x3U)                                         /**< (GMAC_DCFGR) 4 Kbytes Memory Size  */
#define GMAC_DCFGR_RXBMS_EIGHTH               (GMAC_DCFGR_RXBMS_EIGHTH_Val << GMAC_DCFGR_RXBMS_Pos)  /**< (GMAC_DCFGR) 4/8 Kbyte Memory Size Position  */
#define GMAC_DCFGR_RXBMS_QUARTER              (GMAC_DCFGR_RXBMS_QUARTER_Val << GMAC_DCFGR_RXBMS_Pos)  /**< (GMAC_DCFGR) 4/4 Kbytes Memory Size Position  */
#define GMAC_DCFGR_RXBMS_HALF                 (GMAC_DCFGR_RXBMS_HALF_Val << GMAC_DCFGR_RXBMS_Pos)  /**< (GMAC_DCFGR) 4/2 Kbytes Memory Size Position  */
#define GMAC_DCFGR_RXBMS_FULL                 (GMAC_DCFGR_RXBMS_FULL_Val << GMAC_DCFGR_RXBMS_Pos)  /**< (GMAC_DCFGR) 4 Kbytes Memory Size Position  */
#define GMAC_DCFGR_TXPBMS_Pos                 (10)                                           /**< (GMAC_DCFGR) Transmitter Packet Buffer Memory Size Select Position */
#define GMAC_DCFGR_TXPBMS_Msk                 (0x1U << GMAC_DCFGR_TXPBMS_Pos)                /**< (GMAC_DCFGR) Transmitter Packet Buffer Memory Size Select Mask */
#define GMAC_DCFGR_TXCOEN_Pos                 (11)                                           /**< (GMAC_DCFGR) Transmitter Checksum Generation Offload Enable Position */
#define GMAC_DCFGR_TXCOEN_Msk                 (0x1U << GMAC_DCFGR_TXCOEN_Pos)                /**< (GMAC_DCFGR) Transmitter Checksum Generation Offload Enable Mask */
#define GMAC_DCFGR_DRBS_Pos                   (16)                                           /**< (GMAC_DCFGR) DMA Receive Buffer Size Position */
#define GMAC_DCFGR_DRBS_Msk                   (0xFFU << GMAC_DCFGR_DRBS_Pos)                 /**< (GMAC_DCFGR) DMA Receive Buffer Size Mask */
#define GMAC_DCFGR_DRBS(value)                (GMAC_DCFGR_DRBS_Msk & ((value) << GMAC_DCFGR_DRBS_Pos))
#define GMAC_DCFGR_DDRP_Pos                   (24)                                           /**< (GMAC_DCFGR) DMA Discard Receive Packets Position */
#define GMAC_DCFGR_DDRP_Msk                   (0x1U << GMAC_DCFGR_DDRP_Pos)                  /**< (GMAC_DCFGR) DMA Discard Receive Packets Mask */
#define GMAC_DCFGR_Msk                        (0x01FF0FDFUL)                                 /**< (GMAC_DCFGR) Register Mask  */

