zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_TSR : (GMAC Offset: 0x14) (R/W 32) Transmit Status Register -------- */

typedef union
{
  struct
  {
    uint32_t UBR:1;                     /**< bit:      0  Used Bit Read                                 */
    uint32_t COL:1;                     /**< bit:      1  Collision Occurred                            */
    uint32_t RLE:1;                     /**< bit:      2  Retry Limit Exceeded                          */
    uint32_t TXGO:1;                    /**< bit:      3  Transmit Go                                   */
    uint32_t TFC:1;                     /**< bit:      4  Transmit Frame Corruption Due to AHB Error    */
    uint32_t TXCOMP:1;                  /**< bit:      5  Transmit Complete                             */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t HRESP:1;                   /**< bit:      8  HRESP Not OK                                  */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TSR_bits_t;

#define GMAC_TSR_UBR_Pos                      (0)                                            /**< (GMAC_TSR) Used Bit Read Position */
#define GMAC_TSR_UBR_Msk                      (0x1U << GMAC_TSR_UBR_Pos)                     /**< (GMAC_TSR) Used Bit Read Mask */
#define GMAC_TSR_COL_Pos                      (1)                                            /**< (GMAC_TSR) Collision Occurred Position */
#define GMAC_TSR_COL_Msk                      (0x1U << GMAC_TSR_COL_Pos)                     /**< (GMAC_TSR) Collision Occurred Mask */
#define GMAC_TSR_RLE_Pos                      (2)                                            /**< (GMAC_TSR) Retry Limit Exceeded Position */
#define GMAC_TSR_RLE_Msk                      (0x1U << GMAC_TSR_RLE_Pos)                     /**< (GMAC_TSR) Retry Limit Exceeded Mask */
#define GMAC_TSR_TXGO_Pos                     (3)                                            /**< (GMAC_TSR) Transmit Go Position */
#define GMAC_TSR_TXGO_Msk                     (0x1U << GMAC_TSR_TXGO_Pos)                    /**< (GMAC_TSR) Transmit Go Mask */
#define GMAC_TSR_TFC_Pos                      (4)                                            /**< (GMAC_TSR) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_TSR_TFC_Msk                      (0x1U << GMAC_TSR_TFC_Pos)                     /**< (GMAC_TSR) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_TSR_TXCOMP_Pos                   (5)                                            /**< (GMAC_TSR) Transmit Complete Position */
#define GMAC_TSR_TXCOMP_Msk                   (0x1U << GMAC_TSR_TXCOMP_Pos)                  /**< (GMAC_TSR) Transmit Complete Mask */
#define GMAC_TSR_HRESP_Pos                    (8)                                            /**< (GMAC_TSR) HRESP Not OK Position */
#define GMAC_TSR_HRESP_Msk                    (0x1U << GMAC_TSR_HRESP_Pos)                   /**< (GMAC_TSR) HRESP Not OK Mask */
#define GMAC_TSR_Msk                          (0x0000013FUL)                                 /**< (GMAC_TSR) Register Mask  */

/* -------- GMAC_RBQB : (GMAC Offset: 0x18) (R/W 32) Receive Buffer Queue Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t ADDR:30;                   /**< bit:  2..31  Receive Buffer Queue Base Address             */
  };
  uint32_t w;
} __GMAC_RBQB_bits_t;

#define GMAC_RBQB_ADDR_Pos                    (2)                                            /**< (GMAC_RBQB) Receive Buffer Queue Base Address Position */
#define GMAC_RBQB_ADDR_Msk                    (0x3FFFFFFFU << GMAC_RBQB_ADDR_Pos)            /**< (GMAC_RBQB) Receive Buffer Queue Base Address Mask */
#define GMAC_RBQB_ADDR(value)                 (GMAC_RBQB_ADDR_Msk & ((value) << GMAC_RBQB_ADDR_Pos))
#define GMAC_RBQB_Msk                         (0xFFFFFFFCUL)                                 /**< (GMAC_RBQB) Register Mask  */

/* -------- GMAC_TBQB : (GMAC Offset: 0x1c) (R/W 32) Transmit Buffer Queue Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t ADDR:30;                   /**< bit:  2..31  Transmit Buffer Queue Base Address            */
  };
  uint32_t w;
} __GMAC_TBQB_bits_t;

#define GMAC_TBQB_ADDR_Pos                    (2)                                            /**< (GMAC_TBQB) Transmit Buffer Queue Base Address Position */
#define GMAC_TBQB_ADDR_Msk                    (0x3FFFFFFFU << GMAC_TBQB_ADDR_Pos)            /**< (GMAC_TBQB) Transmit Buffer Queue Base Address Mask */
#define GMAC_TBQB_ADDR(value)                 (GMAC_TBQB_ADDR_Msk & ((value) << GMAC_TBQB_ADDR_Pos))
#define GMAC_TBQB_Msk                         (0xFFFFFFFCUL)                                 /**< (GMAC_TBQB) Register Mask  */

/* -------- GMAC_RSR : (GMAC Offset: 0x20) (R/W 32) Receive Status Register -------- */

typedef union
{
  struct
  {
    uint32_t BNA:1;                     /**< bit:      0  Buffer Not Available                          */
    uint32_t REC:1;                     /**< bit:      1  Frame Received                                */
    uint32_t RXOVR:1;                   /**< bit:      2  Receive Overrun                               */
    uint32_t HNO:1;                     /**< bit:      3  HRESP Not OK                                  */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_RSR_bits_t;

#define GMAC_RSR_BNA_Pos                      (0)                                            /**< (GMAC_RSR) Buffer Not Available Position */
#define GMAC_RSR_BNA_Msk                      (0x1U << GMAC_RSR_BNA_Pos)                     /**< (GMAC_RSR) Buffer Not Available Mask */
#define GMAC_RSR_REC_Pos                      (1)                                            /**< (GMAC_RSR) Frame Received Position */
#define GMAC_RSR_REC_Msk                      (0x1U << GMAC_RSR_REC_Pos)                     /**< (GMAC_RSR) Frame Received Mask */
#define GMAC_RSR_RXOVR_Pos                    (2)                                            /**< (GMAC_RSR) Receive Overrun Position */
#define GMAC_RSR_RXOVR_Msk                    (0x1U << GMAC_RSR_RXOVR_Pos)                   /**< (GMAC_RSR) Receive Overrun Mask */
#define GMAC_RSR_HNO_Pos                      (3)                                            /**< (GMAC_RSR) HRESP Not OK Position */
#define GMAC_RSR_HNO_Msk                      (0x1U << GMAC_RSR_HNO_Pos)                     /**< (GMAC_RSR) HRESP Not OK Mask */
#define GMAC_RSR_Msk                          (0x0000000FUL)                                 /**< (GMAC_RSR) Register Mask  */

/* -------- GMAC_ISR : (GMAC Offset: 0x24) (R/ 32) Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t MFS:1;                     /**< bit:      0  Management Frame Sent                         */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                              */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                              */
    uint32_t TXUBR:1;                   /**< bit:      3  TX Used Bit Read                              */
    uint32_t TUR:1;                     /**< bit:      4  Transmit Underrun                             */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded                          */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error    */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                             */
    uint32_t :2;                        /**< bit:   8..9  Reserved                                      */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                               */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                                  */
    uint32_t PFNZ:1;                    /**< bit:     12  Pause Frame with Non-zero Pause Quantum Received */
    uint32_t PTZ:1;                     /**< bit:     13  Pause Time Zero                               */
    uint32_t PFTR:1;                    /**< bit:     14  Pause Frame Transmitted                       */
    uint32_t :3;                        /**< bit: 15..17  Reserved                                      */
    uint32_t DRQFR:1;                   /**< bit:     18  PTP Delay Request Frame Received              */
    uint32_t SFR:1;                     /**< bit:     19  PTP Sync Frame Received                       */
    uint32_t DRQFT:1;                   /**< bit:     20  PTP Delay Request Frame Transmitted           */
    uint32_t SFT:1;                     /**< bit:     21  PTP Sync Frame Transmitted                    */
    uint32_t PDRQFR:1;                  /**< bit:     22  PDelay Request Frame Received                 */
    uint32_t PDRSFR:1;                  /**< bit:     23  PDelay Response Frame Received                */
    uint32_t PDRQFT:1;                  /**< bit:     24  PDelay Request Frame Transmitted              */
    uint32_t PDRSFT:1;                  /**< bit:     25  PDelay Response Frame Transmitted             */
    uint32_t SRI:1;                     /**< bit:     26  TSU Seconds Register Increment                */
    uint32_t RXLPISBC:1;                /**< bit:     27  Receive LPI indication Status Bit Change      */
    uint32_t WOL:1;                     /**< bit:     28  Wake On LAN                                   */
    uint32_t TSUTIMCOMP:1;              /**< bit:     29  TSU Timer Comparison                          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_ISR_bits_t;

#define GMAC_ISR_MFS_Pos                      (0)                                            /**< (GMAC_ISR) Management Frame Sent Position */
#define GMAC_ISR_MFS_Msk                      (0x1U << GMAC_ISR_MFS_Pos)                     /**< (GMAC_ISR) Management Frame Sent Mask */
#define GMAC_ISR_RCOMP_Pos                    (1)                                            /**< (GMAC_ISR) Receive Complete Position */
#define GMAC_ISR_RCOMP_Msk                    (0x1U << GMAC_ISR_RCOMP_Pos)                   /**< (GMAC_ISR) Receive Complete Mask */
#define GMAC_ISR_RXUBR_Pos                    (2)                                            /**< (GMAC_ISR) RX Used Bit Read Position */
#define GMAC_ISR_RXUBR_Msk                    (0x1U << GMAC_ISR_RXUBR_Pos)                   /**< (GMAC_ISR) RX Used Bit Read Mask */
#define GMAC_ISR_TXUBR_Pos                    (3)                                            /**< (GMAC_ISR) TX Used Bit Read Position */
#define GMAC_ISR_TXUBR_Msk                    (0x1U << GMAC_ISR_TXUBR_Pos)                   /**< (GMAC_ISR) TX Used Bit Read Mask */
#define GMAC_ISR_TUR_Pos                      (4)                                            /**< (GMAC_ISR) Transmit Underrun Position */
#define GMAC_ISR_TUR_Msk                      (0x1U << GMAC_ISR_TUR_Pos)                     /**< (GMAC_ISR) Transmit Underrun Mask */
#define GMAC_ISR_RLEX_Pos                     (5)                                            /**< (GMAC_ISR) Retry Limit Exceeded Position */
#define GMAC_ISR_RLEX_Msk                     (0x1U << GMAC_ISR_RLEX_Pos)                    /**< (GMAC_ISR) Retry Limit Exceeded Mask */
#define GMAC_ISR_TFC_Pos                      (6)                                            /**< (GMAC_ISR) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_ISR_TFC_Msk                      (0x1U << GMAC_ISR_TFC_Pos)                     /**< (GMAC_ISR) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_ISR_TCOMP_Pos                    (7)                                            /**< (GMAC_ISR) Transmit Complete Position */
#define GMAC_ISR_TCOMP_Msk                    (0x1U << GMAC_ISR_TCOMP_Pos)                   /**< (GMAC_ISR) Transmit Complete Mask */
#define GMAC_ISR_ROVR_Pos                     (10)                                           /**< (GMAC_ISR) Receive Overrun Position */
#define GMAC_ISR_ROVR_Msk                     (0x1U << GMAC_ISR_ROVR_Pos)                    /**< (GMAC_ISR) Receive Overrun Mask */
#define GMAC_ISR_HRESP_Pos                    (11)                                           /**< (GMAC_ISR) HRESP Not OK Position */
#define GMAC_ISR_HRESP_Msk                    (0x1U << GMAC_ISR_HRESP_Pos)                   /**< (GMAC_ISR) HRESP Not OK Mask */
#define GMAC_ISR_PFNZ_Pos                     (12)                                           /**< (GMAC_ISR) Pause Frame with Non-zero Pause Quantum Received Position */
#define GMAC_ISR_PFNZ_Msk                     (0x1U << GMAC_ISR_PFNZ_Pos)                    /**< (GMAC_ISR) Pause Frame with Non-zero Pause Quantum Received Mask */
#define GMAC_ISR_PTZ_Pos                      (13)                                           /**< (GMAC_ISR) Pause Time Zero Position */
#define GMAC_ISR_PTZ_Msk                      (0x1U << GMAC_ISR_PTZ_Pos)                     /**< (GMAC_ISR) Pause Time Zero Mask */
#define GMAC_ISR_PFTR_Pos                     (14)                                           /**< (GMAC_ISR) Pause Frame Transmitted Position */
#define GMAC_ISR_PFTR_Msk                     (0x1U << GMAC_ISR_PFTR_Pos)                    /**< (GMAC_ISR) Pause Frame Transmitted Mask */
#define GMAC_ISR_DRQFR_Pos                    (18)                                           /**< (GMAC_ISR) PTP Delay Request Frame Received Position */
#define GMAC_ISR_DRQFR_Msk                    (0x1U << GMAC_ISR_DRQFR_Pos)                   /**< (GMAC_ISR) PTP Delay Request Frame Received Mask */
#define GMAC_ISR_SFR_Pos                      (19)                                           /**< (GMAC_ISR) PTP Sync Frame Received Position */
#define GMAC_ISR_SFR_Msk                      (0x1U << GMAC_ISR_SFR_Pos)                     /**< (GMAC_ISR) PTP Sync Frame Received Mask */
#define GMAC_ISR_DRQFT_Pos                    (20)                                           /**< (GMAC_ISR) PTP Delay Request Frame Transmitted Position */
#define GMAC_ISR_DRQFT_Msk                    (0x1U << GMAC_ISR_DRQFT_Pos)                   /**< (GMAC_ISR) PTP Delay Request Frame Transmitted Mask */
#define GMAC_ISR_SFT_Pos                      (21)                                           /**< (GMAC_ISR) PTP Sync Frame Transmitted Position */
#define GMAC_ISR_SFT_Msk                      (0x1U << GMAC_ISR_SFT_Pos)                     /**< (GMAC_ISR) PTP Sync Frame Transmitted Mask */
#define GMAC_ISR_PDRQFR_Pos                   (22)                                           /**< (GMAC_ISR) PDelay Request Frame Received Position */
#define GMAC_ISR_PDRQFR_Msk                   (0x1U << GMAC_ISR_PDRQFR_Pos)                  /**< (GMAC_ISR) PDelay Request Frame Received Mask */
#define GMAC_ISR_PDRSFR_Pos                   (23)                                           /**< (GMAC_ISR) PDelay Response Frame Received Position */
#define GMAC_ISR_PDRSFR_Msk                   (0x1U << GMAC_ISR_PDRSFR_Pos)                  /**< (GMAC_ISR) PDelay Response Frame Received Mask */
#define GMAC_ISR_PDRQFT_Pos                   (24)                                           /**< (GMAC_ISR) PDelay Request Frame Transmitted Position */
#define GMAC_ISR_PDRQFT_Msk                   (0x1U << GMAC_ISR_PDRQFT_Pos)                  /**< (GMAC_ISR) PDelay Request Frame Transmitted Mask */
#define GMAC_ISR_PDRSFT_Pos                   (25)                                           /**< (GMAC_ISR) PDelay Response Frame Transmitted Position */
#define GMAC_ISR_PDRSFT_Msk                   (0x1U << GMAC_ISR_PDRSFT_Pos)                  /**< (GMAC_ISR) PDelay Response Frame Transmitted Mask */
#define GMAC_ISR_SRI_Pos                      (26)                                           /**< (GMAC_ISR) TSU Seconds Register Increment Position */
#define GMAC_ISR_SRI_Msk                      (0x1U << GMAC_ISR_SRI_Pos)                     /**< (GMAC_ISR) TSU Seconds Register Increment Mask */
#define GMAC_ISR_RXLPISBC_Pos                 (27)                                           /**< (GMAC_ISR) Receive LPI indication Status Bit Change Position */
#define GMAC_ISR_RXLPISBC_Msk                 (0x1U << GMAC_ISR_RXLPISBC_Pos)                /**< (GMAC_ISR) Receive LPI indication Status Bit Change Mask */
#define GMAC_ISR_WOL_Pos                      (28)                                           /**< (GMAC_ISR) Wake On LAN Position */
#define GMAC_ISR_WOL_Msk                      (0x1U << GMAC_ISR_WOL_Pos)                     /**< (GMAC_ISR) Wake On LAN Mask */
#define GMAC_ISR_TSUTIMCOMP_Pos               (29)                                           /**< (GMAC_ISR) TSU Timer Comparison Position */
#define GMAC_ISR_TSUTIMCOMP_Msk               (0x1U << GMAC_ISR_TSUTIMCOMP_Pos)              /**< (GMAC_ISR) TSU Timer Comparison Mask */
#define GMAC_ISR_Msk                          (0x3FFC7CFFUL)                                 /**< (GMAC_ISR) Register Mask  */

/* -------- GMAC_IER : (GMAC Offset: 0x28) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t MFS:1;                     /**< bit:      0  Management Frame Sent                         */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                              */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                              */
    uint32_t TXUBR:1;                   /**< bit:      3  TX Used Bit Read                              */
    uint32_t TUR:1;                     /**< bit:      4  Transmit Underrun                             */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded or Late Collision        */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error    */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                             */
    uint32_t :2;                        /**< bit:   8..9  Reserved                                      */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                               */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                                  */
    uint32_t PFNZ:1;                    /**< bit:     12  Pause Frame with Non-zero Pause Quantum Received */
    uint32_t PTZ:1;                     /**< bit:     13  Pause Time Zero                               */
    uint32_t PFTR:1;                    /**< bit:     14  Pause Frame Transmitted                       */
    uint32_t EXINT:1;                   /**< bit:     15  External Interrupt                            */
    uint32_t :2;                        /**< bit: 16..17  Reserved                                      */
    uint32_t DRQFR:1;                   /**< bit:     18  PTP Delay Request Frame Received              */
    uint32_t SFR:1;                     /**< bit:     19  PTP Sync Frame Received                       */
    uint32_t DRQFT:1;                   /**< bit:     20  PTP Delay Request Frame Transmitted           */
    uint32_t SFT:1;                     /**< bit:     21  PTP Sync Frame Transmitted                    */
    uint32_t PDRQFR:1;                  /**< bit:     22  PDelay Request Frame Received                 */
    uint32_t PDRSFR:1;                  /**< bit:     23  PDelay Response Frame Received                */
    uint32_t PDRQFT:1;                  /**< bit:     24  PDelay Request Frame Transmitted              */
    uint32_t PDRSFT:1;                  /**< bit:     25  PDelay Response Frame Transmitted             */
    uint32_t SRI:1;                     /**< bit:     26  TSU Seconds Register Increment                */
    uint32_t RXLPISBC:1;                /**< bit:     27  Enable RX LPI Indication                      */
    uint32_t WOL:1;                     /**< bit:     28  Wake On LAN                                   */
    uint32_t TSUTIMCOMP:1;              /**< bit:     29  TSU Timer Comparison                          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_IER_bits_t;

