zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_IER_MFS_Pos                      (0)                                            /**< (GMAC_IER) Management Frame Sent Position */
#define GMAC_IER_MFS_Msk                      (0x1U << GMAC_IER_MFS_Pos)                     /**< (GMAC_IER) Management Frame Sent Mask */
#define GMAC_IER_RCOMP_Pos                    (1)                                            /**< (GMAC_IER) Receive Complete Position */
#define GMAC_IER_RCOMP_Msk                    (0x1U << GMAC_IER_RCOMP_Pos)                   /**< (GMAC_IER) Receive Complete Mask */
#define GMAC_IER_RXUBR_Pos                    (2)                                            /**< (GMAC_IER) RX Used Bit Read Position */
#define GMAC_IER_RXUBR_Msk                    (0x1U << GMAC_IER_RXUBR_Pos)                   /**< (GMAC_IER) RX Used Bit Read Mask */
#define GMAC_IER_TXUBR_Pos                    (3)                                            /**< (GMAC_IER) TX Used Bit Read Position */
#define GMAC_IER_TXUBR_Msk                    (0x1U << GMAC_IER_TXUBR_Pos)                   /**< (GMAC_IER) TX Used Bit Read Mask */
#define GMAC_IER_TUR_Pos                      (4)                                            /**< (GMAC_IER) Transmit Underrun Position */
#define GMAC_IER_TUR_Msk                      (0x1U << GMAC_IER_TUR_Pos)                     /**< (GMAC_IER) Transmit Underrun Mask */
#define GMAC_IER_RLEX_Pos                     (5)                                            /**< (GMAC_IER) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IER_RLEX_Msk                     (0x1U << GMAC_IER_RLEX_Pos)                    /**< (GMAC_IER) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IER_TFC_Pos                      (6)                                            /**< (GMAC_IER) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_IER_TFC_Msk                      (0x1U << GMAC_IER_TFC_Pos)                     /**< (GMAC_IER) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_IER_TCOMP_Pos                    (7)                                            /**< (GMAC_IER) Transmit Complete Position */
#define GMAC_IER_TCOMP_Msk                    (0x1U << GMAC_IER_TCOMP_Pos)                   /**< (GMAC_IER) Transmit Complete Mask */
#define GMAC_IER_ROVR_Pos                     (10)                                           /**< (GMAC_IER) Receive Overrun Position */
#define GMAC_IER_ROVR_Msk                     (0x1U << GMAC_IER_ROVR_Pos)                    /**< (GMAC_IER) Receive Overrun Mask */
#define GMAC_IER_HRESP_Pos                    (11)                                           /**< (GMAC_IER) HRESP Not OK Position */
#define GMAC_IER_HRESP_Msk                    (0x1U << GMAC_IER_HRESP_Pos)                   /**< (GMAC_IER) HRESP Not OK Mask */
#define GMAC_IER_PFNZ_Pos                     (12)                                           /**< (GMAC_IER) Pause Frame with Non-zero Pause Quantum Received Position */
#define GMAC_IER_PFNZ_Msk                     (0x1U << GMAC_IER_PFNZ_Pos)                    /**< (GMAC_IER) Pause Frame with Non-zero Pause Quantum Received Mask */
#define GMAC_IER_PTZ_Pos                      (13)                                           /**< (GMAC_IER) Pause Time Zero Position */
#define GMAC_IER_PTZ_Msk                      (0x1U << GMAC_IER_PTZ_Pos)                     /**< (GMAC_IER) Pause Time Zero Mask */
#define GMAC_IER_PFTR_Pos                     (14)                                           /**< (GMAC_IER) Pause Frame Transmitted Position */
#define GMAC_IER_PFTR_Msk                     (0x1U << GMAC_IER_PFTR_Pos)                    /**< (GMAC_IER) Pause Frame Transmitted Mask */
#define GMAC_IER_EXINT_Pos                    (15)                                           /**< (GMAC_IER) External Interrupt Position */
#define GMAC_IER_EXINT_Msk                    (0x1U << GMAC_IER_EXINT_Pos)                   /**< (GMAC_IER) External Interrupt Mask */
#define GMAC_IER_DRQFR_Pos                    (18)                                           /**< (GMAC_IER) PTP Delay Request Frame Received Position */
#define GMAC_IER_DRQFR_Msk                    (0x1U << GMAC_IER_DRQFR_Pos)                   /**< (GMAC_IER) PTP Delay Request Frame Received Mask */
#define GMAC_IER_SFR_Pos                      (19)                                           /**< (GMAC_IER) PTP Sync Frame Received Position */
#define GMAC_IER_SFR_Msk                      (0x1U << GMAC_IER_SFR_Pos)                     /**< (GMAC_IER) PTP Sync Frame Received Mask */
#define GMAC_IER_DRQFT_Pos                    (20)                                           /**< (GMAC_IER) PTP Delay Request Frame Transmitted Position */
#define GMAC_IER_DRQFT_Msk                    (0x1U << GMAC_IER_DRQFT_Pos)                   /**< (GMAC_IER) PTP Delay Request Frame Transmitted Mask */
#define GMAC_IER_SFT_Pos                      (21)                                           /**< (GMAC_IER) PTP Sync Frame Transmitted Position */
#define GMAC_IER_SFT_Msk                      (0x1U << GMAC_IER_SFT_Pos)                     /**< (GMAC_IER) PTP Sync Frame Transmitted Mask */
#define GMAC_IER_PDRQFR_Pos                   (22)                                           /**< (GMAC_IER) PDelay Request Frame Received Position */
#define GMAC_IER_PDRQFR_Msk                   (0x1U << GMAC_IER_PDRQFR_Pos)                  /**< (GMAC_IER) PDelay Request Frame Received Mask */
#define GMAC_IER_PDRSFR_Pos                   (23)                                           /**< (GMAC_IER) PDelay Response Frame Received Position */
#define GMAC_IER_PDRSFR_Msk                   (0x1U << GMAC_IER_PDRSFR_Pos)                  /**< (GMAC_IER) PDelay Response Frame Received Mask */
#define GMAC_IER_PDRQFT_Pos                   (24)                                           /**< (GMAC_IER) PDelay Request Frame Transmitted Position */
#define GMAC_IER_PDRQFT_Msk                   (0x1U << GMAC_IER_PDRQFT_Pos)                  /**< (GMAC_IER) PDelay Request Frame Transmitted Mask */
#define GMAC_IER_PDRSFT_Pos                   (25)                                           /**< (GMAC_IER) PDelay Response Frame Transmitted Position */
#define GMAC_IER_PDRSFT_Msk                   (0x1U << GMAC_IER_PDRSFT_Pos)                  /**< (GMAC_IER) PDelay Response Frame Transmitted Mask */
#define GMAC_IER_SRI_Pos                      (26)                                           /**< (GMAC_IER) TSU Seconds Register Increment Position */
#define GMAC_IER_SRI_Msk                      (0x1U << GMAC_IER_SRI_Pos)                     /**< (GMAC_IER) TSU Seconds Register Increment Mask */
#define GMAC_IER_RXLPISBC_Pos                 (27)                                           /**< (GMAC_IER) Enable RX LPI Indication Position */
#define GMAC_IER_RXLPISBC_Msk                 (0x1U << GMAC_IER_RXLPISBC_Pos)                /**< (GMAC_IER) Enable RX LPI Indication Mask */
#define GMAC_IER_WOL_Pos                      (28)                                           /**< (GMAC_IER) Wake On LAN Position */
#define GMAC_IER_WOL_Msk                      (0x1U << GMAC_IER_WOL_Pos)                     /**< (GMAC_IER) Wake On LAN Mask */
#define GMAC_IER_TSUTIMCOMP_Pos               (29)                                           /**< (GMAC_IER) TSU Timer Comparison Position */
#define GMAC_IER_TSUTIMCOMP_Msk               (0x1U << GMAC_IER_TSUTIMCOMP_Pos)              /**< (GMAC_IER) TSU Timer Comparison Mask */
#define GMAC_IER_Msk                          (0x3FFCFCFFUL)                                 /**< (GMAC_IER) Register Mask  */

