zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_IDR : (GMAC Offset: 0x2c) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t MFS:1;                     /**< bit:      0  Management Frame Sent                         */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                              */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                              */
    uint32_t TXUBR:1;                   /**< bit:      3  TX Used Bit Read                              */
    uint32_t TUR:1;                     /**< bit:      4  Transmit Underrun                             */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded or Late Collision        */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error    */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                             */
    uint32_t :2;                        /**< bit:   8..9  Reserved                                      */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                               */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                                  */
    uint32_t PFNZ:1;                    /**< bit:     12  Pause Frame with Non-zero Pause Quantum Received */
    uint32_t PTZ:1;                     /**< bit:     13  Pause Time Zero                               */
    uint32_t PFTR:1;                    /**< bit:     14  Pause Frame Transmitted                       */
    uint32_t EXINT:1;                   /**< bit:     15  External Interrupt                            */
    uint32_t :2;                        /**< bit: 16..17  Reserved                                      */
    uint32_t DRQFR:1;                   /**< bit:     18  PTP Delay Request Frame Received              */
    uint32_t SFR:1;                     /**< bit:     19  PTP Sync Frame Received                       */
    uint32_t DRQFT:1;                   /**< bit:     20  PTP Delay Request Frame Transmitted           */
    uint32_t SFT:1;                     /**< bit:     21  PTP Sync Frame Transmitted                    */
    uint32_t PDRQFR:1;                  /**< bit:     22  PDelay Request Frame Received                 */
    uint32_t PDRSFR:1;                  /**< bit:     23  PDelay Response Frame Received                */
    uint32_t PDRQFT:1;                  /**< bit:     24  PDelay Request Frame Transmitted              */
    uint32_t PDRSFT:1;                  /**< bit:     25  PDelay Response Frame Transmitted             */
    uint32_t SRI:1;                     /**< bit:     26  TSU Seconds Register Increment                */
    uint32_t RXLPISBC:1;                /**< bit:     27  Enable RX LPI Indication                      */
    uint32_t WOL:1;                     /**< bit:     28  Wake On LAN                                   */
    uint32_t TSUTIMCOMP:1;              /**< bit:     29  TSU Timer Comparison                          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_IDR_bits_t;

#define GMAC_IDR_MFS_Pos                      (0)                                            /**< (GMAC_IDR) Management Frame Sent Position */
#define GMAC_IDR_MFS_Msk                      (0x1U << GMAC_IDR_MFS_Pos)                     /**< (GMAC_IDR) Management Frame Sent Mask */
#define GMAC_IDR_RCOMP_Pos                    (1)                                            /**< (GMAC_IDR) Receive Complete Position */
#define GMAC_IDR_RCOMP_Msk                    (0x1U << GMAC_IDR_RCOMP_Pos)                   /**< (GMAC_IDR) Receive Complete Mask */
#define GMAC_IDR_RXUBR_Pos                    (2)                                            /**< (GMAC_IDR) RX Used Bit Read Position */
#define GMAC_IDR_RXUBR_Msk                    (0x1U << GMAC_IDR_RXUBR_Pos)                   /**< (GMAC_IDR) RX Used Bit Read Mask */
#define GMAC_IDR_TXUBR_Pos                    (3)                                            /**< (GMAC_IDR) TX Used Bit Read Position */
#define GMAC_IDR_TXUBR_Msk                    (0x1U << GMAC_IDR_TXUBR_Pos)                   /**< (GMAC_IDR) TX Used Bit Read Mask */
#define GMAC_IDR_TUR_Pos                      (4)                                            /**< (GMAC_IDR) Transmit Underrun Position */
#define GMAC_IDR_TUR_Msk                      (0x1U << GMAC_IDR_TUR_Pos)                     /**< (GMAC_IDR) Transmit Underrun Mask */
#define GMAC_IDR_RLEX_Pos                     (5)                                            /**< (GMAC_IDR) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IDR_RLEX_Msk                     (0x1U << GMAC_IDR_RLEX_Pos)                    /**< (GMAC_IDR) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IDR_TFC_Pos                      (6)                                            /**< (GMAC_IDR) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_IDR_TFC_Msk                      (0x1U << GMAC_IDR_TFC_Pos)                     /**< (GMAC_IDR) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_IDR_TCOMP_Pos                    (7)                                            /**< (GMAC_IDR) Transmit Complete Position */
#define GMAC_IDR_TCOMP_Msk                    (0x1U << GMAC_IDR_TCOMP_Pos)                   /**< (GMAC_IDR) Transmit Complete Mask */
#define GMAC_IDR_ROVR_Pos                     (10)                                           /**< (GMAC_IDR) Receive Overrun Position */
#define GMAC_IDR_ROVR_Msk                     (0x1U << GMAC_IDR_ROVR_Pos)                    /**< (GMAC_IDR) Receive Overrun Mask */
#define GMAC_IDR_HRESP_Pos                    (11)                                           /**< (GMAC_IDR) HRESP Not OK Position */
#define GMAC_IDR_HRESP_Msk                    (0x1U << GMAC_IDR_HRESP_Pos)                   /**< (GMAC_IDR) HRESP Not OK Mask */
#define GMAC_IDR_PFNZ_Pos                     (12)                                           /**< (GMAC_IDR) Pause Frame with Non-zero Pause Quantum Received Position */
#define GMAC_IDR_PFNZ_Msk                     (0x1U << GMAC_IDR_PFNZ_Pos)                    /**< (GMAC_IDR) Pause Frame with Non-zero Pause Quantum Received Mask */
#define GMAC_IDR_PTZ_Pos                      (13)                                           /**< (GMAC_IDR) Pause Time Zero Position */
#define GMAC_IDR_PTZ_Msk                      (0x1U << GMAC_IDR_PTZ_Pos)                     /**< (GMAC_IDR) Pause Time Zero Mask */
#define GMAC_IDR_PFTR_Pos                     (14)                                           /**< (GMAC_IDR) Pause Frame Transmitted Position */
#define GMAC_IDR_PFTR_Msk                     (0x1U << GMAC_IDR_PFTR_Pos)                    /**< (GMAC_IDR) Pause Frame Transmitted Mask */
#define GMAC_IDR_EXINT_Pos                    (15)                                           /**< (GMAC_IDR) External Interrupt Position */
#define GMAC_IDR_EXINT_Msk                    (0x1U << GMAC_IDR_EXINT_Pos)                   /**< (GMAC_IDR) External Interrupt Mask */
#define GMAC_IDR_DRQFR_Pos                    (18)                                           /**< (GMAC_IDR) PTP Delay Request Frame Received Position */
#define GMAC_IDR_DRQFR_Msk                    (0x1U << GMAC_IDR_DRQFR_Pos)                   /**< (GMAC_IDR) PTP Delay Request Frame Received Mask */
#define GMAC_IDR_SFR_Pos                      (19)                                           /**< (GMAC_IDR) PTP Sync Frame Received Position */
#define GMAC_IDR_SFR_Msk                      (0x1U << GMAC_IDR_SFR_Pos)                     /**< (GMAC_IDR) PTP Sync Frame Received Mask */
#define GMAC_IDR_DRQFT_Pos                    (20)                                           /**< (GMAC_IDR) PTP Delay Request Frame Transmitted Position */
#define GMAC_IDR_DRQFT_Msk                    (0x1U << GMAC_IDR_DRQFT_Pos)                   /**< (GMAC_IDR) PTP Delay Request Frame Transmitted Mask */
#define GMAC_IDR_SFT_Pos                      (21)                                           /**< (GMAC_IDR) PTP Sync Frame Transmitted Position */
#define GMAC_IDR_SFT_Msk                      (0x1U << GMAC_IDR_SFT_Pos)                     /**< (GMAC_IDR) PTP Sync Frame Transmitted Mask */
#define GMAC_IDR_PDRQFR_Pos                   (22)                                           /**< (GMAC_IDR) PDelay Request Frame Received Position */
#define GMAC_IDR_PDRQFR_Msk                   (0x1U << GMAC_IDR_PDRQFR_Pos)                  /**< (GMAC_IDR) PDelay Request Frame Received Mask */
#define GMAC_IDR_PDRSFR_Pos                   (23)                                           /**< (GMAC_IDR) PDelay Response Frame Received Position */
#define GMAC_IDR_PDRSFR_Msk                   (0x1U << GMAC_IDR_PDRSFR_Pos)                  /**< (GMAC_IDR) PDelay Response Frame Received Mask */
#define GMAC_IDR_PDRQFT_Pos                   (24)                                           /**< (GMAC_IDR) PDelay Request Frame Transmitted Position */
#define GMAC_IDR_PDRQFT_Msk                   (0x1U << GMAC_IDR_PDRQFT_Pos)                  /**< (GMAC_IDR) PDelay Request Frame Transmitted Mask */
#define GMAC_IDR_PDRSFT_Pos                   (25)                                           /**< (GMAC_IDR) PDelay Response Frame Transmitted Position */
#define GMAC_IDR_PDRSFT_Msk                   (0x1U << GMAC_IDR_PDRSFT_Pos)                  /**< (GMAC_IDR) PDelay Response Frame Transmitted Mask */
#define GMAC_IDR_SRI_Pos                      (26)                                           /**< (GMAC_IDR) TSU Seconds Register Increment Position */
#define GMAC_IDR_SRI_Msk                      (0x1U << GMAC_IDR_SRI_Pos)                     /**< (GMAC_IDR) TSU Seconds Register Increment Mask */
#define GMAC_IDR_RXLPISBC_Pos                 (27)                                           /**< (GMAC_IDR) Enable RX LPI Indication Position */
#define GMAC_IDR_RXLPISBC_Msk                 (0x1U << GMAC_IDR_RXLPISBC_Pos)                /**< (GMAC_IDR) Enable RX LPI Indication Mask */
#define GMAC_IDR_WOL_Pos                      (28)                                           /**< (GMAC_IDR) Wake On LAN Position */
#define GMAC_IDR_WOL_Msk                      (0x1U << GMAC_IDR_WOL_Pos)                     /**< (GMAC_IDR) Wake On LAN Mask */
#define GMAC_IDR_TSUTIMCOMP_Pos               (29)                                           /**< (GMAC_IDR) TSU Timer Comparison Position */
#define GMAC_IDR_TSUTIMCOMP_Msk               (0x1U << GMAC_IDR_TSUTIMCOMP_Pos)              /**< (GMAC_IDR) TSU Timer Comparison Mask */
#define GMAC_IDR_Msk                          (0x3FFCFCFFUL)                                 /**< (GMAC_IDR) Register Mask  */

/* -------- GMAC_IMR : (GMAC Offset: 0x30) (R/W 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t MFS:1;                     /**< bit:      0  Management Frame Sent                         */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                              */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                              */
    uint32_t TXUBR:1;                   /**< bit:      3  TX Used Bit Read                              */
    uint32_t TUR:1;                     /**< bit:      4  Transmit Underrun                             */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded                          */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error    */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                             */
    uint32_t :2;                        /**< bit:   8..9  Reserved                                      */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                               */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                                  */
    uint32_t PFNZ:1;                    /**< bit:     12  Pause Frame with Non-zero Pause Quantum Received */
    uint32_t PTZ:1;                     /**< bit:     13  Pause Time Zero                               */
    uint32_t PFTR:1;                    /**< bit:     14  Pause Frame Transmitted                       */
    uint32_t EXINT:1;                   /**< bit:     15  External Interrupt                            */
    uint32_t :2;                        /**< bit: 16..17  Reserved                                      */
    uint32_t DRQFR:1;                   /**< bit:     18  PTP Delay Request Frame Received              */
    uint32_t SFR:1;                     /**< bit:     19  PTP Sync Frame Received                       */
    uint32_t DRQFT:1;                   /**< bit:     20  PTP Delay Request Frame Transmitted           */
    uint32_t SFT:1;                     /**< bit:     21  PTP Sync Frame Transmitted                    */
    uint32_t PDRQFR:1;                  /**< bit:     22  PDelay Request Frame Received                 */
    uint32_t PDRSFR:1;                  /**< bit:     23  PDelay Response Frame Received                */
    uint32_t PDRQFT:1;                  /**< bit:     24  PDelay Request Frame Transmitted              */
    uint32_t PDRSFT:1;                  /**< bit:     25  PDelay Response Frame Transmitted             */
    uint32_t SRI:1;                     /**< bit:     26  TSU Seconds Register Increment                */
    uint32_t RXLPISBC:1;                /**< bit:     27  Enable RX LPI Indication                      */
    uint32_t WOL:1;                     /**< bit:     28  Wake On LAN                                   */
    uint32_t TSUTIMCOMP:1;              /**< bit:     29  TSU Timer Comparison                          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_IMR_bits_t;

#define GMAC_IMR_MFS_Pos                      (0)                                            /**< (GMAC_IMR) Management Frame Sent Position */
#define GMAC_IMR_MFS_Msk                      (0x1U << GMAC_IMR_MFS_Pos)                     /**< (GMAC_IMR) Management Frame Sent Mask */
#define GMAC_IMR_RCOMP_Pos                    (1)                                            /**< (GMAC_IMR) Receive Complete Position */
#define GMAC_IMR_RCOMP_Msk                    (0x1U << GMAC_IMR_RCOMP_Pos)                   /**< (GMAC_IMR) Receive Complete Mask */
#define GMAC_IMR_RXUBR_Pos                    (2)                                            /**< (GMAC_IMR) RX Used Bit Read Position */
#define GMAC_IMR_RXUBR_Msk                    (0x1U << GMAC_IMR_RXUBR_Pos)                   /**< (GMAC_IMR) RX Used Bit Read Mask */
#define GMAC_IMR_TXUBR_Pos                    (3)                                            /**< (GMAC_IMR) TX Used Bit Read Position */
#define GMAC_IMR_TXUBR_Msk                    (0x1U << GMAC_IMR_TXUBR_Pos)                   /**< (GMAC_IMR) TX Used Bit Read Mask */
#define GMAC_IMR_TUR_Pos                      (4)                                            /**< (GMAC_IMR) Transmit Underrun Position */
#define GMAC_IMR_TUR_Msk                      (0x1U << GMAC_IMR_TUR_Pos)                     /**< (GMAC_IMR) Transmit Underrun Mask */
#define GMAC_IMR_RLEX_Pos                     (5)                                            /**< (GMAC_IMR) Retry Limit Exceeded Position */
#define GMAC_IMR_RLEX_Msk                     (0x1U << GMAC_IMR_RLEX_Pos)                    /**< (GMAC_IMR) Retry Limit Exceeded Mask */
#define GMAC_IMR_TFC_Pos                      (6)                                            /**< (GMAC_IMR) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_IMR_TFC_Msk                      (0x1U << GMAC_IMR_TFC_Pos)                     /**< (GMAC_IMR) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_IMR_TCOMP_Pos                    (7)                                            /**< (GMAC_IMR) Transmit Complete Position */
#define GMAC_IMR_TCOMP_Msk                    (0x1U << GMAC_IMR_TCOMP_Pos)                   /**< (GMAC_IMR) Transmit Complete Mask */
#define GMAC_IMR_ROVR_Pos                     (10)                                           /**< (GMAC_IMR) Receive Overrun Position */
#define GMAC_IMR_ROVR_Msk                     (0x1U << GMAC_IMR_ROVR_Pos)                    /**< (GMAC_IMR) Receive Overrun Mask */
#define GMAC_IMR_HRESP_Pos                    (11)                                           /**< (GMAC_IMR) HRESP Not OK Position */
#define GMAC_IMR_HRESP_Msk                    (0x1U << GMAC_IMR_HRESP_Pos)                   /**< (GMAC_IMR) HRESP Not OK Mask */
#define GMAC_IMR_PFNZ_Pos                     (12)                                           /**< (GMAC_IMR) Pause Frame with Non-zero Pause Quantum Received Position */
#define GMAC_IMR_PFNZ_Msk                     (0x1U << GMAC_IMR_PFNZ_Pos)                    /**< (GMAC_IMR) Pause Frame with Non-zero Pause Quantum Received Mask */
#define GMAC_IMR_PTZ_Pos                      (13)                                           /**< (GMAC_IMR) Pause Time Zero Position */
#define GMAC_IMR_PTZ_Msk                      (0x1U << GMAC_IMR_PTZ_Pos)                     /**< (GMAC_IMR) Pause Time Zero Mask */
#define GMAC_IMR_PFTR_Pos                     (14)                                           /**< (GMAC_IMR) Pause Frame Transmitted Position */
#define GMAC_IMR_PFTR_Msk                     (0x1U << GMAC_IMR_PFTR_Pos)                    /**< (GMAC_IMR) Pause Frame Transmitted Mask */
#define GMAC_IMR_EXINT_Pos                    (15)                                           /**< (GMAC_IMR) External Interrupt Position */
#define GMAC_IMR_EXINT_Msk                    (0x1U << GMAC_IMR_EXINT_Pos)                   /**< (GMAC_IMR) External Interrupt Mask */
#define GMAC_IMR_DRQFR_Pos                    (18)                                           /**< (GMAC_IMR) PTP Delay Request Frame Received Position */
#define GMAC_IMR_DRQFR_Msk                    (0x1U << GMAC_IMR_DRQFR_Pos)                   /**< (GMAC_IMR) PTP Delay Request Frame Received Mask */
#define GMAC_IMR_SFR_Pos                      (19)                                           /**< (GMAC_IMR) PTP Sync Frame Received Position */
#define GMAC_IMR_SFR_Msk                      (0x1U << GMAC_IMR_SFR_Pos)                     /**< (GMAC_IMR) PTP Sync Frame Received Mask */
#define GMAC_IMR_DRQFT_Pos                    (20)                                           /**< (GMAC_IMR) PTP Delay Request Frame Transmitted Position */
#define GMAC_IMR_DRQFT_Msk                    (0x1U << GMAC_IMR_DRQFT_Pos)                   /**< (GMAC_IMR) PTP Delay Request Frame Transmitted Mask */
#define GMAC_IMR_SFT_Pos                      (21)                                           /**< (GMAC_IMR) PTP Sync Frame Transmitted Position */
#define GMAC_IMR_SFT_Msk                      (0x1U << GMAC_IMR_SFT_Pos)                     /**< (GMAC_IMR) PTP Sync Frame Transmitted Mask */
#define GMAC_IMR_PDRQFR_Pos                   (22)                                           /**< (GMAC_IMR) PDelay Request Frame Received Position */
#define GMAC_IMR_PDRQFR_Msk                   (0x1U << GMAC_IMR_PDRQFR_Pos)                  /**< (GMAC_IMR) PDelay Request Frame Received Mask */
#define GMAC_IMR_PDRSFR_Pos                   (23)                                           /**< (GMAC_IMR) PDelay Response Frame Received Position */
#define GMAC_IMR_PDRSFR_Msk                   (0x1U << GMAC_IMR_PDRSFR_Pos)                  /**< (GMAC_IMR) PDelay Response Frame Received Mask */
#define GMAC_IMR_PDRQFT_Pos                   (24)                                           /**< (GMAC_IMR) PDelay Request Frame Transmitted Position */
#define GMAC_IMR_PDRQFT_Msk                   (0x1U << GMAC_IMR_PDRQFT_Pos)                  /**< (GMAC_IMR) PDelay Request Frame Transmitted Mask */
#define GMAC_IMR_PDRSFT_Pos                   (25)                                           /**< (GMAC_IMR) PDelay Response Frame Transmitted Position */
#define GMAC_IMR_PDRSFT_Msk                   (0x1U << GMAC_IMR_PDRSFT_Pos)                  /**< (GMAC_IMR) PDelay Response Frame Transmitted Mask */
#define GMAC_IMR_SRI_Pos                      (26)                                           /**< (GMAC_IMR) TSU Seconds Register Increment Position */
#define GMAC_IMR_SRI_Msk                      (0x1U << GMAC_IMR_SRI_Pos)                     /**< (GMAC_IMR) TSU Seconds Register Increment Mask */
#define GMAC_IMR_RXLPISBC_Pos                 (27)                                           /**< (GMAC_IMR) Enable RX LPI Indication Position */
#define GMAC_IMR_RXLPISBC_Msk                 (0x1U << GMAC_IMR_RXLPISBC_Pos)                /**< (GMAC_IMR) Enable RX LPI Indication Mask */
#define GMAC_IMR_WOL_Pos                      (28)                                           /**< (GMAC_IMR) Wake On LAN Position */
#define GMAC_IMR_WOL_Msk                      (0x1U << GMAC_IMR_WOL_Pos)                     /**< (GMAC_IMR) Wake On LAN Mask */
#define GMAC_IMR_TSUTIMCOMP_Pos               (29)                                           /**< (GMAC_IMR) TSU Timer Comparison Position */
#define GMAC_IMR_TSUTIMCOMP_Msk               (0x1U << GMAC_IMR_TSUTIMCOMP_Pos)              /**< (GMAC_IMR) TSU Timer Comparison Mask */
#define GMAC_IMR_Msk                          (0x3FFCFCFFUL)                                 /**< (GMAC_IMR) Register Mask  */

