zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_MAN : (GMAC Offset: 0x34) (R/W 32) PHY Maintenance Register -------- */

typedef union
{
  struct
  {
    uint32_t DATA:16;                   /**< bit:  0..15  PHY Data                                      */
    uint32_t WTN:2;                     /**< bit: 16..17  Write Ten                                     */
    uint32_t REGA:5;                    /**< bit: 18..22  Register Address                              */
    uint32_t PHYA:5;                    /**< bit: 23..27  PHY Address                                   */
    uint32_t OP:2;                      /**< bit: 28..29  Operation                                     */
    uint32_t CLTTO:1;                   /**< bit:     30  Clause 22 Operation                           */
    uint32_t WZO:1;                     /**< bit:     31  Write ZERO                                    */
  };
  uint32_t w;
} __GMAC_MAN_bits_t;

#define GMAC_MAN_DATA_Pos                     (0)                                            /**< (GMAC_MAN) PHY Data Position */
#define GMAC_MAN_DATA_Msk                     (0xFFFFU << GMAC_MAN_DATA_Pos)                 /**< (GMAC_MAN) PHY Data Mask */
#define GMAC_MAN_DATA(value)                  (GMAC_MAN_DATA_Msk & ((value) << GMAC_MAN_DATA_Pos))
#define GMAC_MAN_WTN_Pos                      (16)                                           /**< (GMAC_MAN) Write Ten Position */
#define GMAC_MAN_WTN_Msk                      (0x3U << GMAC_MAN_WTN_Pos)                     /**< (GMAC_MAN) Write Ten Mask */
#define GMAC_MAN_WTN(value)                   (GMAC_MAN_WTN_Msk & ((value) << GMAC_MAN_WTN_Pos))
#define GMAC_MAN_REGA_Pos                     (18)                                           /**< (GMAC_MAN) Register Address Position */
#define GMAC_MAN_REGA_Msk                     (0x1FU << GMAC_MAN_REGA_Pos)                   /**< (GMAC_MAN) Register Address Mask */
#define GMAC_MAN_REGA(value)                  (GMAC_MAN_REGA_Msk & ((value) << GMAC_MAN_REGA_Pos))
#define GMAC_MAN_PHYA_Pos                     (23)                                           /**< (GMAC_MAN) PHY Address Position */
#define GMAC_MAN_PHYA_Msk                     (0x1FU << GMAC_MAN_PHYA_Pos)                   /**< (GMAC_MAN) PHY Address Mask */
#define GMAC_MAN_PHYA(value)                  (GMAC_MAN_PHYA_Msk & ((value) << GMAC_MAN_PHYA_Pos))
#define GMAC_MAN_OP_Pos                       (28)                                           /**< (GMAC_MAN) Operation Position */
#define GMAC_MAN_OP_Msk                       (0x3U << GMAC_MAN_OP_Pos)                      /**< (GMAC_MAN) Operation Mask */
#define GMAC_MAN_OP(value)                    (GMAC_MAN_OP_Msk & ((value) << GMAC_MAN_OP_Pos))
#define GMAC_MAN_CLTTO_Pos                    (30)                                           /**< (GMAC_MAN) Clause 22 Operation Position */
#define GMAC_MAN_CLTTO_Msk                    (0x1U << GMAC_MAN_CLTTO_Pos)                   /**< (GMAC_MAN) Clause 22 Operation Mask */
#define GMAC_MAN_WZO_Pos                      (31)                                           /**< (GMAC_MAN) Write ZERO Position */
#define GMAC_MAN_WZO_Msk                      (0x1U << GMAC_MAN_WZO_Pos)                     /**< (GMAC_MAN) Write ZERO Mask */
#define GMAC_MAN_Msk                          (0xFFFFFFFFUL)                                 /**< (GMAC_MAN) Register Mask  */

/* -------- GMAC_RPQ : (GMAC Offset: 0x38) (R/ 32) Received Pause Quantum Register -------- */

typedef union
{
  struct
  {
    uint32_t RPQ:16;                    /**< bit:  0..15  Received Pause Quantum                        */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_RPQ_bits_t;

#define GMAC_RPQ_RPQ_Pos                      (0)                                            /**< (GMAC_RPQ) Received Pause Quantum Position */
#define GMAC_RPQ_RPQ_Msk                      (0xFFFFU << GMAC_RPQ_RPQ_Pos)                  /**< (GMAC_RPQ) Received Pause Quantum Mask */
#define GMAC_RPQ_RPQ(value)                   (GMAC_RPQ_RPQ_Msk & ((value) << GMAC_RPQ_RPQ_Pos))
#define GMAC_RPQ_Msk                          (0x0000FFFFUL)                                 /**< (GMAC_RPQ) Register Mask  */

/* -------- GMAC_TPQ : (GMAC Offset: 0x3c) (R/W 32) Transmit Pause Quantum Register -------- */

typedef union
{
  struct
  {
    uint32_t TPQ:16;                    /**< bit:  0..15  Transmit Pause Quantum                        */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TPQ_bits_t;

#define GMAC_TPQ_TPQ_Pos                      (0)                                            /**< (GMAC_TPQ) Transmit Pause Quantum Position */
#define GMAC_TPQ_TPQ_Msk                      (0xFFFFU << GMAC_TPQ_TPQ_Pos)                  /**< (GMAC_TPQ) Transmit Pause Quantum Mask */
#define GMAC_TPQ_TPQ(value)                   (GMAC_TPQ_TPQ_Msk & ((value) << GMAC_TPQ_TPQ_Pos))
#define GMAC_TPQ_Msk                          (0x0000FFFFUL)                                 /**< (GMAC_TPQ) Register Mask  */

/* -------- GMAC_TPSF : (GMAC Offset: 0x40) (R/W 32) TX Partial Store and Forward Register -------- */

typedef union
{
  struct
  {
    uint32_t TPB1ADR:12;                /**< bit:  0..11  Transmit Partial Store and Forward Address    */
    uint32_t :19;                       /**< bit: 12..30  Reserved                                      */
    uint32_t ENTXP:1;                   /**< bit:     31  Enable TX Partial Store and Forward Operation */
  };
  uint32_t w;
} __GMAC_TPSF_bits_t;

#define GMAC_TPSF_TPB1ADR_Pos                 (0)                                            /**< (GMAC_TPSF) Transmit Partial Store and Forward Address Position */
#define GMAC_TPSF_TPB1ADR_Msk                 (0xFFFU << GMAC_TPSF_TPB1ADR_Pos)              /**< (GMAC_TPSF) Transmit Partial Store and Forward Address Mask */
#define GMAC_TPSF_TPB1ADR(value)              (GMAC_TPSF_TPB1ADR_Msk & ((value) << GMAC_TPSF_TPB1ADR_Pos))
#define GMAC_TPSF_ENTXP_Pos                   (31)                                           /**< (GMAC_TPSF) Enable TX Partial Store and Forward Operation Position */
#define GMAC_TPSF_ENTXP_Msk                   (0x1U << GMAC_TPSF_ENTXP_Pos)                  /**< (GMAC_TPSF) Enable TX Partial Store and Forward Operation Mask */
#define GMAC_TPSF_Msk                         (0x80000FFFUL)                                 /**< (GMAC_TPSF) Register Mask  */

/* -------- GMAC_RPSF : (GMAC Offset: 0x44) (R/W 32) RX Partial Store and Forward Register -------- */

typedef union
{
  struct
  {
    uint32_t RPB1ADR:12;                /**< bit:  0..11  Receive Partial Store and Forward Address     */
    uint32_t :19;                       /**< bit: 12..30  Reserved                                      */
    uint32_t ENRXP:1;                   /**< bit:     31  Enable RX Partial Store and Forward Operation */
  };
  uint32_t w;
} __GMAC_RPSF_bits_t;

