zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_RPSF_RPB1ADR_Pos                 (0)                                            /**< (GMAC_RPSF) Receive Partial Store and Forward Address Position */
#define GMAC_RPSF_RPB1ADR_Msk                 (0xFFFU << GMAC_RPSF_RPB1ADR_Pos)              /**< (GMAC_RPSF) Receive Partial Store and Forward Address Mask */
#define GMAC_RPSF_RPB1ADR(value)              (GMAC_RPSF_RPB1ADR_Msk & ((value) << GMAC_RPSF_RPB1ADR_Pos))
#define GMAC_RPSF_ENRXP_Pos                   (31)                                           /**< (GMAC_RPSF) Enable RX Partial Store and Forward Operation Position */
#define GMAC_RPSF_ENRXP_Msk                   (0x1U << GMAC_RPSF_ENRXP_Pos)                  /**< (GMAC_RPSF) Enable RX Partial Store and Forward Operation Mask */
#define GMAC_RPSF_Msk                         (0x80000FFFUL)                                 /**< (GMAC_RPSF) Register Mask  */

/* -------- GMAC_RJFML : (GMAC Offset: 0x48) (R/W 32) RX Jumbo Frame Max Length Register -------- */

typedef union
{
  struct
  {
    uint32_t FML:14;                    /**< bit:  0..13  Frame Max Length                              */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_RJFML_bits_t;

#define GMAC_RJFML_FML_Pos                    (0)                                            /**< (GMAC_RJFML) Frame Max Length Position */
#define GMAC_RJFML_FML_Msk                    (0x3FFFU << GMAC_RJFML_FML_Pos)                /**< (GMAC_RJFML) Frame Max Length Mask */
#define GMAC_RJFML_FML(value)                 (GMAC_RJFML_FML_Msk & ((value) << GMAC_RJFML_FML_Pos))
#define GMAC_RJFML_Msk                        (0x00003FFFUL)                                 /**< (GMAC_RJFML) Register Mask  */

/* -------- GMAC_HRB : (GMAC Offset: 0x80) (R/W 32) Hash Register Bottom -------- */

typedef union
{
  struct
  {
    uint32_t ADDR:32;                   /**< bit:  0..31  Hash Address                                  */
  };
  uint32_t w;
} __GMAC_HRB_bits_t;

#define GMAC_HRB_ADDR_Pos                     (0)                                            /**< (GMAC_HRB) Hash Address Position */
#define GMAC_HRB_ADDR_Msk                     (0xFFFFFFFFU << GMAC_HRB_ADDR_Pos)             /**< (GMAC_HRB) Hash Address Mask */
#define GMAC_HRB_ADDR(value)                  (GMAC_HRB_ADDR_Msk & ((value) << GMAC_HRB_ADDR_Pos))
#define GMAC_HRB_Msk                          (0xFFFFFFFFUL)                                 /**< (GMAC_HRB) Register Mask  */

/* -------- GMAC_HRT : (GMAC Offset: 0x84) (R/W 32) Hash Register Top -------- */

typedef union
{
  struct
  {
    uint32_t ADDR:32;                   /**< bit:  0..31  Hash Address                                  */
  };
  uint32_t w;
} __GMAC_HRT_bits_t;

#define GMAC_HRT_ADDR_Pos                     (0)                                            /**< (GMAC_HRT) Hash Address Position */
#define GMAC_HRT_ADDR_Msk                     (0xFFFFFFFFU << GMAC_HRT_ADDR_Pos)             /**< (GMAC_HRT) Hash Address Mask */
#define GMAC_HRT_ADDR(value)                  (GMAC_HRT_ADDR_Msk & ((value) << GMAC_HRT_ADDR_Pos))
#define GMAC_HRT_Msk                          (0xFFFFFFFFUL)                                 /**< (GMAC_HRT) Register Mask  */

/* -------- GMAC_TIDM1 : (GMAC Offset: 0xa8) (R/W 32) Type ID Match 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t TID:16;                    /**< bit:  0..15  Type ID Match 1                               */
    uint32_t :15;                       /**< bit: 16..30  Reserved                                      */
    uint32_t ENID1:1;                   /**< bit:     31  Enable Copying of TID Matched Frames          */
  };
  uint32_t w;
} __GMAC_TIDM1_bits_t;

#define GMAC_TIDM1_TID_Pos                    (0)                                            /**< (GMAC_TIDM1) Type ID Match 1 Position */
#define GMAC_TIDM1_TID_Msk                    (0xFFFFU << GMAC_TIDM1_TID_Pos)                /**< (GMAC_TIDM1) Type ID Match 1 Mask */
#define GMAC_TIDM1_TID(value)                 (GMAC_TIDM1_TID_Msk & ((value) << GMAC_TIDM1_TID_Pos))
#define GMAC_TIDM1_ENID1_Pos                  (31)                                           /**< (GMAC_TIDM1) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM1_ENID1_Msk                  (0x1U << GMAC_TIDM1_ENID1_Pos)                 /**< (GMAC_TIDM1) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM1_Msk                        (0x8000FFFFUL)                                 /**< (GMAC_TIDM1) Register Mask  */

/* -------- GMAC_TIDM2 : (GMAC Offset: 0xac) (R/W 32) Type ID Match 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t TID:16;                    /**< bit:  0..15  Type ID Match 2                               */
    uint32_t :15;                       /**< bit: 16..30  Reserved                                      */
    uint32_t ENID2:1;                   /**< bit:     31  Enable Copying of TID Matched Frames          */
  };
  uint32_t w;
} __GMAC_TIDM2_bits_t;

#define GMAC_TIDM2_TID_Pos                    (0)                                            /**< (GMAC_TIDM2) Type ID Match 2 Position */
#define GMAC_TIDM2_TID_Msk                    (0xFFFFU << GMAC_TIDM2_TID_Pos)                /**< (GMAC_TIDM2) Type ID Match 2 Mask */
#define GMAC_TIDM2_TID(value)                 (GMAC_TIDM2_TID_Msk & ((value) << GMAC_TIDM2_TID_Pos))
#define GMAC_TIDM2_ENID2_Pos                  (31)                                           /**< (GMAC_TIDM2) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM2_ENID2_Msk                  (0x1U << GMAC_TIDM2_ENID2_Pos)                 /**< (GMAC_TIDM2) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM2_Msk                        (0x8000FFFFUL)                                 /**< (GMAC_TIDM2) Register Mask  */

