zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_TIDM3 : (GMAC Offset: 0xb0) (R/W 32) Type ID Match 3 Register -------- */

typedef union
{
  struct
  {
    uint32_t TID:16;                    /**< bit:  0..15  Type ID Match 3                               */
    uint32_t :15;                       /**< bit: 16..30  Reserved                                      */
    uint32_t ENID3:1;                   /**< bit:     31  Enable Copying of TID Matched Frames          */
  };
  uint32_t w;
} __GMAC_TIDM3_bits_t;

#define GMAC_TIDM3_TID_Pos                    (0)                                            /**< (GMAC_TIDM3) Type ID Match 3 Position */
#define GMAC_TIDM3_TID_Msk                    (0xFFFFU << GMAC_TIDM3_TID_Pos)                /**< (GMAC_TIDM3) Type ID Match 3 Mask */
#define GMAC_TIDM3_TID(value)                 (GMAC_TIDM3_TID_Msk & ((value) << GMAC_TIDM3_TID_Pos))
#define GMAC_TIDM3_ENID3_Pos                  (31)                                           /**< (GMAC_TIDM3) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM3_ENID3_Msk                  (0x1U << GMAC_TIDM3_ENID3_Pos)                 /**< (GMAC_TIDM3) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM3_Msk                        (0x8000FFFFUL)                                 /**< (GMAC_TIDM3) Register Mask  */

/* -------- GMAC_TIDM4 : (GMAC Offset: 0xb4) (R/W 32) Type ID Match 4 Register -------- */

typedef union
{
  struct
  {
    uint32_t TID:16;                    /**< bit:  0..15  Type ID Match 4                               */
    uint32_t :15;                       /**< bit: 16..30  Reserved                                      */
    uint32_t ENID4:1;                   /**< bit:     31  Enable Copying of TID Matched Frames          */
  };
  uint32_t w;
} __GMAC_TIDM4_bits_t;

#define GMAC_TIDM4_TID_Pos                    (0)                                            /**< (GMAC_TIDM4) Type ID Match 4 Position */
#define GMAC_TIDM4_TID_Msk                    (0xFFFFU << GMAC_TIDM4_TID_Pos)                /**< (GMAC_TIDM4) Type ID Match 4 Mask */
#define GMAC_TIDM4_TID(value)                 (GMAC_TIDM4_TID_Msk & ((value) << GMAC_TIDM4_TID_Pos))
#define GMAC_TIDM4_ENID4_Pos                  (31)                                           /**< (GMAC_TIDM4) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM4_ENID4_Msk                  (0x1U << GMAC_TIDM4_ENID4_Pos)                 /**< (GMAC_TIDM4) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM4_Msk                        (0x8000FFFFUL)                                 /**< (GMAC_TIDM4) Register Mask  */

/* -------- GMAC_WOL : (GMAC Offset: 0xb8) (R/W 32) Wake on LAN Register -------- */

typedef union
{
  struct
  {
    uint32_t IP:16;                     /**< bit:  0..15  ARP Request IP Address                        */
    uint32_t MAG:1;                     /**< bit:     16  Magic Packet Event Enable                     */
    uint32_t ARP:1;                     /**< bit:     17  ARP Request IP Address                        */
    uint32_t SA1:1;                     /**< bit:     18  Specific Address Register 1 Event Enable      */
    uint32_t MTI:1;                     /**< bit:     19  Multicast Hash Event Enable                   */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_WOL_bits_t;

#define GMAC_WOL_IP_Pos                       (0)                                            /**< (GMAC_WOL) ARP Request IP Address Position */
#define GMAC_WOL_IP_Msk                       (0xFFFFU << GMAC_WOL_IP_Pos)                   /**< (GMAC_WOL) ARP Request IP Address Mask */
#define GMAC_WOL_IP(value)                    (GMAC_WOL_IP_Msk & ((value) << GMAC_WOL_IP_Pos))
#define GMAC_WOL_MAG_Pos                      (16)                                           /**< (GMAC_WOL) Magic Packet Event Enable Position */
#define GMAC_WOL_MAG_Msk                      (0x1U << GMAC_WOL_MAG_Pos)                     /**< (GMAC_WOL) Magic Packet Event Enable Mask */
#define GMAC_WOL_ARP_Pos                      (17)                                           /**< (GMAC_WOL) ARP Request IP Address Position */
#define GMAC_WOL_ARP_Msk                      (0x1U << GMAC_WOL_ARP_Pos)                     /**< (GMAC_WOL) ARP Request IP Address Mask */
#define GMAC_WOL_SA1_Pos                      (18)                                           /**< (GMAC_WOL) Specific Address Register 1 Event Enable Position */
#define GMAC_WOL_SA1_Msk                      (0x1U << GMAC_WOL_SA1_Pos)                     /**< (GMAC_WOL) Specific Address Register 1 Event Enable Mask */
#define GMAC_WOL_MTI_Pos                      (19)                                           /**< (GMAC_WOL) Multicast Hash Event Enable Position */
#define GMAC_WOL_MTI_Msk                      (0x1U << GMAC_WOL_MTI_Pos)                     /**< (GMAC_WOL) Multicast Hash Event Enable Mask */
#define GMAC_WOL_Msk                          (0x000FFFFFUL)                                 /**< (GMAC_WOL) Register Mask  */

/* -------- GMAC_IPGS : (GMAC Offset: 0xbc) (R/W 32) IPG Stretch Register -------- */

typedef union
{
  struct
  {
    uint32_t FL:16;                     /**< bit:  0..15  Frame Length                                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_IPGS_bits_t;

#define GMAC_IPGS_FL_Pos                      (0)                                            /**< (GMAC_IPGS) Frame Length Position */
#define GMAC_IPGS_FL_Msk                      (0xFFFFU << GMAC_IPGS_FL_Pos)                  /**< (GMAC_IPGS) Frame Length Mask */
#define GMAC_IPGS_FL(value)                   (GMAC_IPGS_FL_Msk & ((value) << GMAC_IPGS_FL_Pos))
#define GMAC_IPGS_Msk                         (0x0000FFFFUL)                                 /**< (GMAC_IPGS) Register Mask  */

/* -------- GMAC_SVLAN : (GMAC Offset: 0xc0) (R/W 32) Stacked VLAN Register -------- */

typedef union
{
  struct
  {
    uint32_t VLAN_TYPE:16;              /**< bit:  0..15  User Defined VLAN_TYPE Field                  */
    uint32_t :15;                       /**< bit: 16..30  Reserved                                      */
    uint32_t ESVLAN:1;                  /**< bit:     31  Enable Stacked VLAN Processing Mode           */
  };
  uint32_t w;
} __GMAC_SVLAN_bits_t;

