zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_SCH_SEC_Pos                      (0)                                            /**< (GMAC_SCH) 1588 Timer Second Comparison Value Position */
#define GMAC_SCH_SEC_Msk                      (0xFFFFU << GMAC_SCH_SEC_Pos)                  /**< (GMAC_SCH) 1588 Timer Second Comparison Value Mask */
#define GMAC_SCH_SEC(value)                   (GMAC_SCH_SEC_Msk & ((value) << GMAC_SCH_SEC_Pos))
#define GMAC_SCH_Msk                          (0x0000FFFFUL)                                 /**< (GMAC_SCH) Register Mask  */

/* -------- GMAC_EFTSH : (GMAC Offset: 0xe8) (R/ 32) PTP Event Frame Transmitted Seconds High Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:16;                    /**< bit:  0..15  Register Update                               */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_EFTSH_bits_t;

#define GMAC_EFTSH_RUD_Pos                    (0)                                            /**< (GMAC_EFTSH) Register Update Position */
#define GMAC_EFTSH_RUD_Msk                    (0xFFFFU << GMAC_EFTSH_RUD_Pos)                /**< (GMAC_EFTSH) Register Update Mask */
#define GMAC_EFTSH_RUD(value)                 (GMAC_EFTSH_RUD_Msk & ((value) << GMAC_EFTSH_RUD_Pos))
#define GMAC_EFTSH_Msk                        (0x0000FFFFUL)                                 /**< (GMAC_EFTSH) Register Mask  */

/* -------- GMAC_EFRSH : (GMAC Offset: 0xec) (R/ 32) PTP Event Frame Received Seconds High Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:16;                    /**< bit:  0..15  Register Update                               */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_EFRSH_bits_t;

#define GMAC_EFRSH_RUD_Pos                    (0)                                            /**< (GMAC_EFRSH) Register Update Position */
#define GMAC_EFRSH_RUD_Msk                    (0xFFFFU << GMAC_EFRSH_RUD_Pos)                /**< (GMAC_EFRSH) Register Update Mask */
#define GMAC_EFRSH_RUD(value)                 (GMAC_EFRSH_RUD_Msk & ((value) << GMAC_EFRSH_RUD_Pos))
#define GMAC_EFRSH_Msk                        (0x0000FFFFUL)                                 /**< (GMAC_EFRSH) Register Mask  */

/* -------- GMAC_PEFTSH : (GMAC Offset: 0xf0) (R/ 32) PTP Peer Event Frame Transmitted Seconds High Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:16;                    /**< bit:  0..15  Register Update                               */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_PEFTSH_bits_t;

#define GMAC_PEFTSH_RUD_Pos                   (0)                                            /**< (GMAC_PEFTSH) Register Update Position */
#define GMAC_PEFTSH_RUD_Msk                   (0xFFFFU << GMAC_PEFTSH_RUD_Pos)               /**< (GMAC_PEFTSH) Register Update Mask */
#define GMAC_PEFTSH_RUD(value)                (GMAC_PEFTSH_RUD_Msk & ((value) << GMAC_PEFTSH_RUD_Pos))
#define GMAC_PEFTSH_Msk                       (0x0000FFFFUL)                                 /**< (GMAC_PEFTSH) Register Mask  */

/* -------- GMAC_PEFRSH : (GMAC Offset: 0xf4) (R/ 32) PTP Peer Event Frame Received Seconds High Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:16;                    /**< bit:  0..15  Register Update                               */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_PEFRSH_bits_t;

#define GMAC_PEFRSH_RUD_Pos                   (0)                                            /**< (GMAC_PEFRSH) Register Update Position */
#define GMAC_PEFRSH_RUD_Msk                   (0xFFFFU << GMAC_PEFRSH_RUD_Pos)               /**< (GMAC_PEFRSH) Register Update Mask */
#define GMAC_PEFRSH_RUD(value)                (GMAC_PEFRSH_RUD_Msk & ((value) << GMAC_PEFRSH_RUD_Pos))
#define GMAC_PEFRSH_Msk                       (0x0000FFFFUL)                                 /**< (GMAC_PEFRSH) Register Mask  */

/* -------- GMAC_MID : (GMAC Offset: 0xfc) (R/ 32) Module ID Register -------- */

typedef union
{
  struct
  {
    uint32_t MREV:16;                   /**< bit:  0..15  Module Revision                               */
    uint32_t MID:16;                    /**< bit: 16..31  Module Identification Number                  */
  };
  uint32_t w;
} __GMAC_MID_bits_t;

#define GMAC_MID_MREV_Pos                     (0)                                            /**< (GMAC_MID) Module Revision Position */
#define GMAC_MID_MREV_Msk                     (0xFFFFU << GMAC_MID_MREV_Pos)                 /**< (GMAC_MID) Module Revision Mask */
#define GMAC_MID_MREV(value)                  (GMAC_MID_MREV_Msk & ((value) << GMAC_MID_MREV_Pos))
#define GMAC_MID_MID_Pos                      (16)                                           /**< (GMAC_MID) Module Identification Number Position */
#define GMAC_MID_MID_Msk                      (0xFFFFU << GMAC_MID_MID_Pos)                  /**< (GMAC_MID) Module Identification Number Mask */
#define GMAC_MID_MID(value)                   (GMAC_MID_MID_Msk & ((value) << GMAC_MID_MID_Pos))
#define GMAC_MID_Msk                          (0xFFFFFFFFUL)                                 /**< (GMAC_MID) Register Mask  */

/* -------- GMAC_OTLO : (GMAC Offset: 0x100) (R/ 32) Octets Transmitted Low Register -------- */

typedef union
{
  struct
  {
    uint32_t TXO:32;                    /**< bit:  0..31  Transmitted Octets                            */
  };
  uint32_t w;
} __GMAC_OTLO_bits_t;

#define GMAC_OTLO_TXO_Pos                     (0)                                            /**< (GMAC_OTLO) Transmitted Octets Position */
#define GMAC_OTLO_TXO_Msk                     (0xFFFFFFFFU << GMAC_OTLO_TXO_Pos)             /**< (GMAC_OTLO) Transmitted Octets Mask */
#define GMAC_OTLO_TXO(value)                  (GMAC_OTLO_TXO_Msk & ((value) << GMAC_OTLO_TXO_Pos))
#define GMAC_OTLO_Msk                         (0xFFFFFFFFUL)                                 /**< (GMAC_OTLO) Register Mask  */

/* -------- GMAC_OTHI : (GMAC Offset: 0x104) (R/ 32) Octets Transmitted High Register -------- */

typedef union
{
  struct
  {
    uint32_t TXO:16;                    /**< bit:  0..15  Transmitted Octets                            */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_OTHI_bits_t;

#define GMAC_OTHI_TXO_Pos                     (0)                                            /**< (GMAC_OTHI) Transmitted Octets Position */
#define GMAC_OTHI_TXO_Msk                     (0xFFFFU << GMAC_OTHI_TXO_Pos)                 /**< (GMAC_OTHI) Transmitted Octets Mask */
#define GMAC_OTHI_TXO(value)                  (GMAC_OTHI_TXO_Msk & ((value) << GMAC_OTHI_TXO_Pos))
#define GMAC_OTHI_Msk                         (0x0000FFFFUL)                                 /**< (GMAC_OTHI) Register Mask  */

/* -------- GMAC_FT : (GMAC Offset: 0x108) (R/ 32) Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t FTX:32;                    /**< bit:  0..31  Frames Transmitted without Error              */
  };
  uint32_t w;
} __GMAC_FT_bits_t;

#define GMAC_FT_FTX_Pos                       (0)                                            /**< (GMAC_FT) Frames Transmitted without Error Position */
#define GMAC_FT_FTX_Msk                       (0xFFFFFFFFU << GMAC_FT_FTX_Pos)               /**< (GMAC_FT) Frames Transmitted without Error Mask */
#define GMAC_FT_FTX(value)                    (GMAC_FT_FTX_Msk & ((value) << GMAC_FT_FTX_Pos))
#define GMAC_FT_Msk                           (0xFFFFFFFFUL)                                 /**< (GMAC_FT) Register Mask  */

