zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_BCFT : (GMAC Offset: 0x10c) (R/ 32) Broadcast Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t BFTX:32;                   /**< bit:  0..31  Broadcast Frames Transmitted without Error    */
  };
  uint32_t w;
} __GMAC_BCFT_bits_t;

#define GMAC_BCFT_BFTX_Pos                    (0)                                            /**< (GMAC_BCFT) Broadcast Frames Transmitted without Error Position */
#define GMAC_BCFT_BFTX_Msk                    (0xFFFFFFFFU << GMAC_BCFT_BFTX_Pos)            /**< (GMAC_BCFT) Broadcast Frames Transmitted without Error Mask */
#define GMAC_BCFT_BFTX(value)                 (GMAC_BCFT_BFTX_Msk & ((value) << GMAC_BCFT_BFTX_Pos))
#define GMAC_BCFT_Msk                         (0xFFFFFFFFUL)                                 /**< (GMAC_BCFT) Register Mask  */

/* -------- GMAC_MFT : (GMAC Offset: 0x110) (R/ 32) Multicast Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t MFTX:32;                   /**< bit:  0..31  Multicast Frames Transmitted without Error    */
  };
  uint32_t w;
} __GMAC_MFT_bits_t;

#define GMAC_MFT_MFTX_Pos                     (0)                                            /**< (GMAC_MFT) Multicast Frames Transmitted without Error Position */
#define GMAC_MFT_MFTX_Msk                     (0xFFFFFFFFU << GMAC_MFT_MFTX_Pos)             /**< (GMAC_MFT) Multicast Frames Transmitted without Error Mask */
#define GMAC_MFT_MFTX(value)                  (GMAC_MFT_MFTX_Msk & ((value) << GMAC_MFT_MFTX_Pos))
#define GMAC_MFT_Msk                          (0xFFFFFFFFUL)                                 /**< (GMAC_MFT) Register Mask  */

/* -------- GMAC_PFT : (GMAC Offset: 0x114) (R/ 32) Pause Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t PFTX:16;                   /**< bit:  0..15  Pause Frames Transmitted Register             */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_PFT_bits_t;

#define GMAC_PFT_PFTX_Pos                     (0)                                            /**< (GMAC_PFT) Pause Frames Transmitted Register Position */
#define GMAC_PFT_PFTX_Msk                     (0xFFFFU << GMAC_PFT_PFTX_Pos)                 /**< (GMAC_PFT) Pause Frames Transmitted Register Mask */
#define GMAC_PFT_PFTX(value)                  (GMAC_PFT_PFTX_Msk & ((value) << GMAC_PFT_PFTX_Pos))
#define GMAC_PFT_Msk                          (0x0000FFFFUL)                                 /**< (GMAC_PFT) Register Mask  */

/* -------- GMAC_BFT64 : (GMAC Offset: 0x118) (R/ 32) 64 Byte Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t NFTX:32;                   /**< bit:  0..31  64 Byte Frames Transmitted without Error      */
  };
  uint32_t w;
} __GMAC_BFT64_bits_t;

#define GMAC_BFT64_NFTX_Pos                   (0)                                            /**< (GMAC_BFT64) 64 Byte Frames Transmitted without Error Position */
#define GMAC_BFT64_NFTX_Msk                   (0xFFFFFFFFU << GMAC_BFT64_NFTX_Pos)           /**< (GMAC_BFT64) 64 Byte Frames Transmitted without Error Mask */
#define GMAC_BFT64_NFTX(value)                (GMAC_BFT64_NFTX_Msk & ((value) << GMAC_BFT64_NFTX_Pos))
#define GMAC_BFT64_Msk                        (0xFFFFFFFFUL)                                 /**< (GMAC_BFT64) Register Mask  */

/* -------- GMAC_TBFT127 : (GMAC Offset: 0x11c) (R/ 32) 65 to 127 Byte Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t NFTX:32;                   /**< bit:  0..31  65 to 127 Byte Frames Transmitted without Error */
  };
  uint32_t w;
} __GMAC_TBFT127_bits_t;

#define GMAC_TBFT127_NFTX_Pos                 (0)                                            /**< (GMAC_TBFT127) 65 to 127 Byte Frames Transmitted without Error Position */
#define GMAC_TBFT127_NFTX_Msk                 (0xFFFFFFFFU << GMAC_TBFT127_NFTX_Pos)         /**< (GMAC_TBFT127) 65 to 127 Byte Frames Transmitted without Error Mask */
#define GMAC_TBFT127_NFTX(value)              (GMAC_TBFT127_NFTX_Msk & ((value) << GMAC_TBFT127_NFTX_Pos))
#define GMAC_TBFT127_Msk                      (0xFFFFFFFFUL)                                 /**< (GMAC_TBFT127) Register Mask  */

/* -------- GMAC_TBFT255 : (GMAC Offset: 0x120) (R/ 32) 128 to 255 Byte Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t NFTX:32;                   /**< bit:  0..31  128 to 255 Byte Frames Transmitted without Error */
  };
  uint32_t w;
} __GMAC_TBFT255_bits_t;

#define GMAC_TBFT255_NFTX_Pos                 (0)                                            /**< (GMAC_TBFT255) 128 to 255 Byte Frames Transmitted without Error Position */
#define GMAC_TBFT255_NFTX_Msk                 (0xFFFFFFFFU << GMAC_TBFT255_NFTX_Pos)         /**< (GMAC_TBFT255) 128 to 255 Byte Frames Transmitted without Error Mask */
#define GMAC_TBFT255_NFTX(value)              (GMAC_TBFT255_NFTX_Msk & ((value) << GMAC_TBFT255_NFTX_Pos))
#define GMAC_TBFT255_Msk                      (0xFFFFFFFFUL)                                 /**< (GMAC_TBFT255) Register Mask  */

/* -------- GMAC_TBFT511 : (GMAC Offset: 0x124) (R/ 32) 256 to 511 Byte Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t NFTX:32;                   /**< bit:  0..31  256 to 511 Byte Frames Transmitted without Error */
  };
  uint32_t w;
} __GMAC_TBFT511_bits_t;

#define GMAC_TBFT511_NFTX_Pos                 (0)                                            /**< (GMAC_TBFT511) 256 to 511 Byte Frames Transmitted without Error Position */
#define GMAC_TBFT511_NFTX_Msk                 (0xFFFFFFFFU << GMAC_TBFT511_NFTX_Pos)         /**< (GMAC_TBFT511) 256 to 511 Byte Frames Transmitted without Error Mask */
#define GMAC_TBFT511_NFTX(value)              (GMAC_TBFT511_NFTX_Msk & ((value) << GMAC_TBFT511_NFTX_Pos))
#define GMAC_TBFT511_Msk                      (0xFFFFFFFFUL)                                 /**< (GMAC_TBFT511) Register Mask  */

/* -------- GMAC_TBFT1023 : (GMAC Offset: 0x128) (R/ 32) 512 to 1023 Byte Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t NFTX:32;                   /**< bit:  0..31  512 to 1023 Byte Frames Transmitted without Error */
  };
  uint32_t w;
} __GMAC_TBFT1023_bits_t;

