zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_TBFT1023_NFTX_Pos                (0)                                            /**< (GMAC_TBFT1023) 512 to 1023 Byte Frames Transmitted without Error Position */
#define GMAC_TBFT1023_NFTX_Msk                (0xFFFFFFFFU << GMAC_TBFT1023_NFTX_Pos)        /**< (GMAC_TBFT1023) 512 to 1023 Byte Frames Transmitted without Error Mask */
#define GMAC_TBFT1023_NFTX(value)             (GMAC_TBFT1023_NFTX_Msk & ((value) << GMAC_TBFT1023_NFTX_Pos))
#define GMAC_TBFT1023_Msk                     (0xFFFFFFFFUL)                                 /**< (GMAC_TBFT1023) Register Mask  */

/* -------- GMAC_TBFT1518 : (GMAC Offset: 0x12c) (R/ 32) 1024 to 1518 Byte Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t NFTX:32;                   /**< bit:  0..31  1024 to 1518 Byte Frames Transmitted without Error */
  };
  uint32_t w;
} __GMAC_TBFT1518_bits_t;

#define GMAC_TBFT1518_NFTX_Pos                (0)                                            /**< (GMAC_TBFT1518) 1024 to 1518 Byte Frames Transmitted without Error Position */
#define GMAC_TBFT1518_NFTX_Msk                (0xFFFFFFFFU << GMAC_TBFT1518_NFTX_Pos)        /**< (GMAC_TBFT1518) 1024 to 1518 Byte Frames Transmitted without Error Mask */
#define GMAC_TBFT1518_NFTX(value)             (GMAC_TBFT1518_NFTX_Msk & ((value) << GMAC_TBFT1518_NFTX_Pos))
#define GMAC_TBFT1518_Msk                     (0xFFFFFFFFUL)                                 /**< (GMAC_TBFT1518) Register Mask  */

/* -------- GMAC_GTBFT1518 : (GMAC Offset: 0x130) (R/ 32) Greater Than 1518 Byte Frames Transmitted Register -------- */

typedef union
{
  struct
  {
    uint32_t NFTX:32;                   /**< bit:  0..31  Greater than 1518 Byte Frames Transmitted without Error */
  };
  uint32_t w;
} __GMAC_GTBFT1518_bits_t;

#define GMAC_GTBFT1518_NFTX_Pos               (0)                                            /**< (GMAC_GTBFT1518) Greater than 1518 Byte Frames Transmitted without Error Position */
#define GMAC_GTBFT1518_NFTX_Msk               (0xFFFFFFFFU << GMAC_GTBFT1518_NFTX_Pos)       /**< (GMAC_GTBFT1518) Greater than 1518 Byte Frames Transmitted without Error Mask */
#define GMAC_GTBFT1518_NFTX(value)            (GMAC_GTBFT1518_NFTX_Msk & ((value) << GMAC_GTBFT1518_NFTX_Pos))
#define GMAC_GTBFT1518_Msk                    (0xFFFFFFFFUL)                                 /**< (GMAC_GTBFT1518) Register Mask  */

/* -------- GMAC_TUR : (GMAC Offset: 0x134) (R/ 32) Transmit Underruns Register -------- */

typedef union
{
  struct
  {
    uint32_t TXUNR:10;                  /**< bit:   0..9  Transmit Underruns                            */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TUR_bits_t;

#define GMAC_TUR_TXUNR_Pos                    (0)                                            /**< (GMAC_TUR) Transmit Underruns Position */
#define GMAC_TUR_TXUNR_Msk                    (0x3FFU << GMAC_TUR_TXUNR_Pos)                 /**< (GMAC_TUR) Transmit Underruns Mask */
#define GMAC_TUR_TXUNR(value)                 (GMAC_TUR_TXUNR_Msk & ((value) << GMAC_TUR_TXUNR_Pos))
#define GMAC_TUR_Msk                          (0x000003FFUL)                                 /**< (GMAC_TUR) Register Mask  */

/* -------- GMAC_SCF : (GMAC Offset: 0x138) (R/ 32) Single Collision Frames Register -------- */

typedef union
{
  struct
  {
    uint32_t SCOL:18;                   /**< bit:  0..17  Single Collision                              */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_SCF_bits_t;

#define GMAC_SCF_SCOL_Pos                     (0)                                            /**< (GMAC_SCF) Single Collision Position */
#define GMAC_SCF_SCOL_Msk                     (0x3FFFFU << GMAC_SCF_SCOL_Pos)                /**< (GMAC_SCF) Single Collision Mask */
#define GMAC_SCF_SCOL(value)                  (GMAC_SCF_SCOL_Msk & ((value) << GMAC_SCF_SCOL_Pos))
#define GMAC_SCF_Msk                          (0x0003FFFFUL)                                 /**< (GMAC_SCF) Register Mask  */

/* -------- GMAC_MCF : (GMAC Offset: 0x13c) (R/ 32) Multiple Collision Frames Register -------- */

typedef union
{
  struct
  {
    uint32_t MCOL:18;                   /**< bit:  0..17  Multiple Collision                            */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_MCF_bits_t;

#define GMAC_MCF_MCOL_Pos                     (0)                                            /**< (GMAC_MCF) Multiple Collision Position */
#define GMAC_MCF_MCOL_Msk                     (0x3FFFFU << GMAC_MCF_MCOL_Pos)                /**< (GMAC_MCF) Multiple Collision Mask */
#define GMAC_MCF_MCOL(value)                  (GMAC_MCF_MCOL_Msk & ((value) << GMAC_MCF_MCOL_Pos))
#define GMAC_MCF_Msk                          (0x0003FFFFUL)                                 /**< (GMAC_MCF) Register Mask  */

/* -------- GMAC_EC : (GMAC Offset: 0x140) (R/ 32) Excessive Collisions Register -------- */

typedef union
{
  struct
  {
    uint32_t XCOL:10;                   /**< bit:   0..9  Excessive Collisions                          */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_EC_bits_t;

#define GMAC_EC_XCOL_Pos                      (0)                                            /**< (GMAC_EC) Excessive Collisions Position */
#define GMAC_EC_XCOL_Msk                      (0x3FFU << GMAC_EC_XCOL_Pos)                   /**< (GMAC_EC) Excessive Collisions Mask */
#define GMAC_EC_XCOL(value)                   (GMAC_EC_XCOL_Msk & ((value) << GMAC_EC_XCOL_Pos))
#define GMAC_EC_Msk                           (0x000003FFUL)                                 /**< (GMAC_EC) Register Mask  */

