zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_LC : (GMAC Offset: 0x144) (R/ 32) Late Collisions Register -------- */

typedef union
{
  struct
  {
    uint32_t LCOL:10;                   /**< bit:   0..9  Late Collisions                               */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_LC_bits_t;

#define GMAC_LC_LCOL_Pos                      (0)                                            /**< (GMAC_LC) Late Collisions Position */
#define GMAC_LC_LCOL_Msk                      (0x3FFU << GMAC_LC_LCOL_Pos)                   /**< (GMAC_LC) Late Collisions Mask */
#define GMAC_LC_LCOL(value)                   (GMAC_LC_LCOL_Msk & ((value) << GMAC_LC_LCOL_Pos))
#define GMAC_LC_Msk                           (0x000003FFUL)                                 /**< (GMAC_LC) Register Mask  */

/* -------- GMAC_DTF : (GMAC Offset: 0x148) (R/ 32) Deferred Transmission Frames Register -------- */

typedef union
{
  struct
  {
    uint32_t DEFT:18;                   /**< bit:  0..17  Deferred Transmission                         */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_DTF_bits_t;

#define GMAC_DTF_DEFT_Pos                     (0)                                            /**< (GMAC_DTF) Deferred Transmission Position */
#define GMAC_DTF_DEFT_Msk                     (0x3FFFFU << GMAC_DTF_DEFT_Pos)                /**< (GMAC_DTF) Deferred Transmission Mask */
#define GMAC_DTF_DEFT(value)                  (GMAC_DTF_DEFT_Msk & ((value) << GMAC_DTF_DEFT_Pos))
#define GMAC_DTF_Msk                          (0x0003FFFFUL)                                 /**< (GMAC_DTF) Register Mask  */

/* -------- GMAC_CSE : (GMAC Offset: 0x14c) (R/ 32) Carrier Sense Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t CSR:10;                    /**< bit:   0..9  Carrier Sense Error                           */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_CSE_bits_t;

#define GMAC_CSE_CSR_Pos                      (0)                                            /**< (GMAC_CSE) Carrier Sense Error Position */
#define GMAC_CSE_CSR_Msk                      (0x3FFU << GMAC_CSE_CSR_Pos)                   /**< (GMAC_CSE) Carrier Sense Error Mask */
#define GMAC_CSE_CSR(value)                   (GMAC_CSE_CSR_Msk & ((value) << GMAC_CSE_CSR_Pos))
#define GMAC_CSE_Msk                          (0x000003FFUL)                                 /**< (GMAC_CSE) Register Mask  */

/* -------- GMAC_ORLO : (GMAC Offset: 0x150) (R/ 32) Octets Received Low Received Register -------- */

typedef union
{
  struct
  {
    uint32_t RXO:32;                    /**< bit:  0..31  Received Octets                               */
  };
  uint32_t w;
} __GMAC_ORLO_bits_t;

#define GMAC_ORLO_RXO_Pos                     (0)                                            /**< (GMAC_ORLO) Received Octets Position */
#define GMAC_ORLO_RXO_Msk                     (0xFFFFFFFFU << GMAC_ORLO_RXO_Pos)             /**< (GMAC_ORLO) Received Octets Mask */
#define GMAC_ORLO_RXO(value)                  (GMAC_ORLO_RXO_Msk & ((value) << GMAC_ORLO_RXO_Pos))
#define GMAC_ORLO_Msk                         (0xFFFFFFFFUL)                                 /**< (GMAC_ORLO) Register Mask  */

/* -------- GMAC_ORHI : (GMAC Offset: 0x154) (R/ 32) Octets Received High Received Register -------- */

typedef union
{
  struct
  {
    uint32_t RXO:16;                    /**< bit:  0..15  Received Octets                               */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_ORHI_bits_t;

#define GMAC_ORHI_RXO_Pos                     (0)                                            /**< (GMAC_ORHI) Received Octets Position */
#define GMAC_ORHI_RXO_Msk                     (0xFFFFU << GMAC_ORHI_RXO_Pos)                 /**< (GMAC_ORHI) Received Octets Mask */
#define GMAC_ORHI_RXO(value)                  (GMAC_ORHI_RXO_Msk & ((value) << GMAC_ORHI_RXO_Pos))
#define GMAC_ORHI_Msk                         (0x0000FFFFUL)                                 /**< (GMAC_ORHI) Register Mask  */

/* -------- GMAC_FR : (GMAC Offset: 0x158) (R/ 32) Frames Received Register -------- */

typedef union
{
  struct
  {
    uint32_t FRX:32;                    /**< bit:  0..31  Frames Received without Error                 */
  };
  uint32_t w;
} __GMAC_FR_bits_t;

#define GMAC_FR_FRX_Pos                       (0)                                            /**< (GMAC_FR) Frames Received without Error Position */
#define GMAC_FR_FRX_Msk                       (0xFFFFFFFFU << GMAC_FR_FRX_Pos)               /**< (GMAC_FR) Frames Received without Error Mask */
#define GMAC_FR_FRX(value)                    (GMAC_FR_FRX_Msk & ((value) << GMAC_FR_FRX_Pos))
#define GMAC_FR_Msk                           (0xFFFFFFFFUL)                                 /**< (GMAC_FR) Register Mask  */

/* -------- GMAC_BCFR : (GMAC Offset: 0x15c) (R/ 32) Broadcast Frames Received Register -------- */

typedef union
{
  struct
  {
    uint32_t BFRX:32;                   /**< bit:  0..31  Broadcast Frames Received without Error       */
  };
  uint32_t w;
} __GMAC_BCFR_bits_t;

#define GMAC_BCFR_BFRX_Pos                    (0)                                            /**< (GMAC_BCFR) Broadcast Frames Received without Error Position */
#define GMAC_BCFR_BFRX_Msk                    (0xFFFFFFFFU << GMAC_BCFR_BFRX_Pos)            /**< (GMAC_BCFR) Broadcast Frames Received without Error Mask */
#define GMAC_BCFR_BFRX(value)                 (GMAC_BCFR_BFRX_Msk & ((value) << GMAC_BCFR_BFRX_Pos))
#define GMAC_BCFR_Msk                         (0xFFFFFFFFUL)                                 /**< (GMAC_BCFR) Register Mask  */

/* -------- GMAC_MFR : (GMAC Offset: 0x160) (R/ 32) Multicast Frames Received Register -------- */

typedef union
{
  struct
  {
    uint32_t MFRX:32;                   /**< bit:  0..31  Multicast Frames Received without Error       */
  };
  uint32_t w;
} __GMAC_MFR_bits_t;

