zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_TMXBFR : (GMAC Offset: 0x180) (R/ 32) 1519 to Maximum Byte Frames Received Register -------- */

typedef union
{
  struct
  {
    uint32_t NFRX:32;                   /**< bit:  0..31  1519 to Maximum Byte Frames Received without Error */
  };
  uint32_t w;
} __GMAC_TMXBFR_bits_t;

#define GMAC_TMXBFR_NFRX_Pos                  (0)                                            /**< (GMAC_TMXBFR) 1519 to Maximum Byte Frames Received without Error Position */
#define GMAC_TMXBFR_NFRX_Msk                  (0xFFFFFFFFU << GMAC_TMXBFR_NFRX_Pos)          /**< (GMAC_TMXBFR) 1519 to Maximum Byte Frames Received without Error Mask */
#define GMAC_TMXBFR_NFRX(value)               (GMAC_TMXBFR_NFRX_Msk & ((value) << GMAC_TMXBFR_NFRX_Pos))
#define GMAC_TMXBFR_Msk                       (0xFFFFFFFFUL)                                 /**< (GMAC_TMXBFR) Register Mask  */

/* -------- GMAC_UFR : (GMAC Offset: 0x184) (R/ 32) Undersize Frames Received Register -------- */

typedef union
{
  struct
  {
    uint32_t UFRX:10;                   /**< bit:   0..9  Undersize Frames Received                     */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_UFR_bits_t;

#define GMAC_UFR_UFRX_Pos                     (0)                                            /**< (GMAC_UFR) Undersize Frames Received Position */
#define GMAC_UFR_UFRX_Msk                     (0x3FFU << GMAC_UFR_UFRX_Pos)                  /**< (GMAC_UFR) Undersize Frames Received Mask */
#define GMAC_UFR_UFRX(value)                  (GMAC_UFR_UFRX_Msk & ((value) << GMAC_UFR_UFRX_Pos))
#define GMAC_UFR_Msk                          (0x000003FFUL)                                 /**< (GMAC_UFR) Register Mask  */

/* -------- GMAC_OFR : (GMAC Offset: 0x188) (R/ 32) Oversize Frames Received Register -------- */

typedef union
{
  struct
  {
    uint32_t OFRX:10;                   /**< bit:   0..9  Oversized Frames Received                     */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_OFR_bits_t;

#define GMAC_OFR_OFRX_Pos                     (0)                                            /**< (GMAC_OFR) Oversized Frames Received Position */
#define GMAC_OFR_OFRX_Msk                     (0x3FFU << GMAC_OFR_OFRX_Pos)                  /**< (GMAC_OFR) Oversized Frames Received Mask */
#define GMAC_OFR_OFRX(value)                  (GMAC_OFR_OFRX_Msk & ((value) << GMAC_OFR_OFRX_Pos))
#define GMAC_OFR_Msk                          (0x000003FFUL)                                 /**< (GMAC_OFR) Register Mask  */

/* -------- GMAC_JR : (GMAC Offset: 0x18c) (R/ 32) Jabbers Received Register -------- */

typedef union
{
  struct
  {
    uint32_t JRX:10;                    /**< bit:   0..9  Jabbers Received                              */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_JR_bits_t;

#define GMAC_JR_JRX_Pos                       (0)                                            /**< (GMAC_JR) Jabbers Received Position */
#define GMAC_JR_JRX_Msk                       (0x3FFU << GMAC_JR_JRX_Pos)                    /**< (GMAC_JR) Jabbers Received Mask */
#define GMAC_JR_JRX(value)                    (GMAC_JR_JRX_Msk & ((value) << GMAC_JR_JRX_Pos))
#define GMAC_JR_Msk                           (0x000003FFUL)                                 /**< (GMAC_JR) Register Mask  */

/* -------- GMAC_FCSE : (GMAC Offset: 0x190) (R/ 32) Frame Check Sequence Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t FCKR:10;                   /**< bit:   0..9  Frame Check Sequence Errors                   */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_FCSE_bits_t;

#define GMAC_FCSE_FCKR_Pos                    (0)                                            /**< (GMAC_FCSE) Frame Check Sequence Errors Position */
#define GMAC_FCSE_FCKR_Msk                    (0x3FFU << GMAC_FCSE_FCKR_Pos)                 /**< (GMAC_FCSE) Frame Check Sequence Errors Mask */
#define GMAC_FCSE_FCKR(value)                 (GMAC_FCSE_FCKR_Msk & ((value) << GMAC_FCSE_FCKR_Pos))
#define GMAC_FCSE_Msk                         (0x000003FFUL)                                 /**< (GMAC_FCSE) Register Mask  */

/* -------- GMAC_LFFE : (GMAC Offset: 0x194) (R/ 32) Length Field Frame Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t LFER:10;                   /**< bit:   0..9  Length Field Frame Errors                     */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_LFFE_bits_t;

#define GMAC_LFFE_LFER_Pos                    (0)                                            /**< (GMAC_LFFE) Length Field Frame Errors Position */
#define GMAC_LFFE_LFER_Msk                    (0x3FFU << GMAC_LFFE_LFER_Pos)                 /**< (GMAC_LFFE) Length Field Frame Errors Mask */
#define GMAC_LFFE_LFER(value)                 (GMAC_LFFE_LFER_Msk & ((value) << GMAC_LFFE_LFER_Pos))
#define GMAC_LFFE_Msk                         (0x000003FFUL)                                 /**< (GMAC_LFFE) Register Mask  */

/* -------- GMAC_RSE : (GMAC Offset: 0x198) (R/ 32) Receive Symbol Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t RXSE:10;                   /**< bit:   0..9  Receive Symbol Errors                         */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_RSE_bits_t;

#define GMAC_RSE_RXSE_Pos                     (0)                                            /**< (GMAC_RSE) Receive Symbol Errors Position */
#define GMAC_RSE_RXSE_Msk                     (0x3FFU << GMAC_RSE_RXSE_Pos)                  /**< (GMAC_RSE) Receive Symbol Errors Mask */
#define GMAC_RSE_RXSE(value)                  (GMAC_RSE_RXSE_Msk & ((value) << GMAC_RSE_RXSE_Pos))
#define GMAC_RSE_Msk                          (0x000003FFUL)                                 /**< (GMAC_RSE) Register Mask  */

/* -------- GMAC_AE : (GMAC Offset: 0x19c) (R/ 32) Alignment Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t AER:10;                    /**< bit:   0..9  Alignment Errors                              */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_AE_bits_t;

#define GMAC_AE_AER_Pos                       (0)                                            /**< (GMAC_AE) Alignment Errors Position */
#define GMAC_AE_AER_Msk                       (0x3FFU << GMAC_AE_AER_Pos)                    /**< (GMAC_AE) Alignment Errors Mask */
#define GMAC_AE_AER(value)                    (GMAC_AE_AER_Msk & ((value) << GMAC_AE_AER_Pos))
#define GMAC_AE_Msk                           (0x000003FFUL)                                 /**< (GMAC_AE) Register Mask  */

/* -------- GMAC_RRE : (GMAC Offset: 0x1a0) (R/ 32) Receive Resource Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRER:18;                  /**< bit:  0..17  Receive Resource Errors                       */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_RRE_bits_t;

#define GMAC_RRE_RXRER_Pos                    (0)                                            /**< (GMAC_RRE) Receive Resource Errors Position */
#define GMAC_RRE_RXRER_Msk                    (0x3FFFFU << GMAC_RRE_RXRER_Pos)               /**< (GMAC_RRE) Receive Resource Errors Mask */
#define GMAC_RRE_RXRER(value)                 (GMAC_RRE_RXRER_Msk & ((value) << GMAC_RRE_RXRER_Pos))
#define GMAC_RRE_Msk                          (0x0003FFFFUL)                                 /**< (GMAC_RRE) Register Mask  */

/* -------- GMAC_ROE : (GMAC Offset: 0x1a4) (R/ 32) Receive Overrun Register -------- */

typedef union
{
  struct
  {
    uint32_t RXOVR:10;                  /**< bit:   0..9  Receive Overruns                              */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_ROE_bits_t;

