zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_ROE_RXOVR_Pos                    (0)                                            /**< (GMAC_ROE) Receive Overruns Position */
#define GMAC_ROE_RXOVR_Msk                    (0x3FFU << GMAC_ROE_RXOVR_Pos)                 /**< (GMAC_ROE) Receive Overruns Mask */
#define GMAC_ROE_RXOVR(value)                 (GMAC_ROE_RXOVR_Msk & ((value) << GMAC_ROE_RXOVR_Pos))
#define GMAC_ROE_Msk                          (0x000003FFUL)                                 /**< (GMAC_ROE) Register Mask  */

/* -------- GMAC_IHCE : (GMAC Offset: 0x1a8) (R/ 32) IP Header Checksum Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t HCKER:8;                   /**< bit:   0..7  IP Header Checksum Errors                     */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_IHCE_bits_t;

#define GMAC_IHCE_HCKER_Pos                   (0)                                            /**< (GMAC_IHCE) IP Header Checksum Errors Position */
#define GMAC_IHCE_HCKER_Msk                   (0xFFU << GMAC_IHCE_HCKER_Pos)                 /**< (GMAC_IHCE) IP Header Checksum Errors Mask */
#define GMAC_IHCE_HCKER(value)                (GMAC_IHCE_HCKER_Msk & ((value) << GMAC_IHCE_HCKER_Pos))
#define GMAC_IHCE_Msk                         (0x000000FFUL)                                 /**< (GMAC_IHCE) Register Mask  */

/* -------- GMAC_TCE : (GMAC Offset: 0x1ac) (R/ 32) TCP Checksum Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t TCKER:8;                   /**< bit:   0..7  TCP Checksum Errors                           */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TCE_bits_t;

#define GMAC_TCE_TCKER_Pos                    (0)                                            /**< (GMAC_TCE) TCP Checksum Errors Position */
#define GMAC_TCE_TCKER_Msk                    (0xFFU << GMAC_TCE_TCKER_Pos)                  /**< (GMAC_TCE) TCP Checksum Errors Mask */
#define GMAC_TCE_TCKER(value)                 (GMAC_TCE_TCKER_Msk & ((value) << GMAC_TCE_TCKER_Pos))
#define GMAC_TCE_Msk                          (0x000000FFUL)                                 /**< (GMAC_TCE) Register Mask  */

/* -------- GMAC_UCE : (GMAC Offset: 0x1b0) (R/ 32) UDP Checksum Errors Register -------- */

typedef union
{
  struct
  {
    uint32_t UCKER:8;                   /**< bit:   0..7  UDP Checksum Errors                           */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_UCE_bits_t;

#define GMAC_UCE_UCKER_Pos                    (0)                                            /**< (GMAC_UCE) UDP Checksum Errors Position */
#define GMAC_UCE_UCKER_Msk                    (0xFFU << GMAC_UCE_UCKER_Pos)                  /**< (GMAC_UCE) UDP Checksum Errors Mask */
#define GMAC_UCE_UCKER(value)                 (GMAC_UCE_UCKER_Msk & ((value) << GMAC_UCE_UCKER_Pos))
#define GMAC_UCE_Msk                          (0x000000FFUL)                                 /**< (GMAC_UCE) Register Mask  */

/* -------- GMAC_TISUBN : (GMAC Offset: 0x1bc) (R/W 32) 1588 Timer Increment Sub-nanoseconds Register -------- */

typedef union
{
  struct
  {
    uint32_t LSBTIR:16;                 /**< bit:  0..15  Lower Significant Bits of Timer Increment Register */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TISUBN_bits_t;

#define GMAC_TISUBN_LSBTIR_Pos                (0)                                            /**< (GMAC_TISUBN) Lower Significant Bits of Timer Increment Register Position */
#define GMAC_TISUBN_LSBTIR_Msk                (0xFFFFU << GMAC_TISUBN_LSBTIR_Pos)            /**< (GMAC_TISUBN) Lower Significant Bits of Timer Increment Register Mask */
#define GMAC_TISUBN_LSBTIR(value)             (GMAC_TISUBN_LSBTIR_Msk & ((value) << GMAC_TISUBN_LSBTIR_Pos))
#define GMAC_TISUBN_Msk                       (0x0000FFFFUL)                                 /**< (GMAC_TISUBN) Register Mask  */

/* -------- GMAC_TSH : (GMAC Offset: 0x1c0) (R/W 32) 1588 Timer Seconds High Register -------- */

typedef union
{
  struct
  {
    uint32_t TCS:16;                    /**< bit:  0..15  Timer Count in Seconds                        */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TSH_bits_t;

#define GMAC_TSH_TCS_Pos                      (0)                                            /**< (GMAC_TSH) Timer Count in Seconds Position */
#define GMAC_TSH_TCS_Msk                      (0xFFFFU << GMAC_TSH_TCS_Pos)                  /**< (GMAC_TSH) Timer Count in Seconds Mask */
#define GMAC_TSH_TCS(value)                   (GMAC_TSH_TCS_Msk & ((value) << GMAC_TSH_TCS_Pos))
#define GMAC_TSH_Msk                          (0x0000FFFFUL)                                 /**< (GMAC_TSH) Register Mask  */

/* -------- GMAC_TSL : (GMAC Offset: 0x1d0) (R/W 32) 1588 Timer Seconds Low Register -------- */

typedef union
{
  struct
  {
    uint32_t TCS:32;                    /**< bit:  0..31  Timer Count in Seconds                        */
  };
  uint32_t w;
} __GMAC_TSL_bits_t;

#define GMAC_TSL_TCS_Pos                      (0)                                            /**< (GMAC_TSL) Timer Count in Seconds Position */
#define GMAC_TSL_TCS_Msk                      (0xFFFFFFFFU << GMAC_TSL_TCS_Pos)              /**< (GMAC_TSL) Timer Count in Seconds Mask */
#define GMAC_TSL_TCS(value)                   (GMAC_TSL_TCS_Msk & ((value) << GMAC_TSL_TCS_Pos))
#define GMAC_TSL_Msk                          (0xFFFFFFFFUL)                                 /**< (GMAC_TSL) Register Mask  */

/* -------- GMAC_TN : (GMAC Offset: 0x1d4) (R/W 32) 1588 Timer Nanoseconds Register -------- */

typedef union
{
  struct
  {
    uint32_t TNS:30;                    /**< bit:  0..29  Timer Count in Nanoseconds                    */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TN_bits_t;

#define GMAC_TN_TNS_Pos                       (0)                                            /**< (GMAC_TN) Timer Count in Nanoseconds Position */
#define GMAC_TN_TNS_Msk                       (0x3FFFFFFFU << GMAC_TN_TNS_Pos)               /**< (GMAC_TN) Timer Count in Nanoseconds Mask */
#define GMAC_TN_TNS(value)                    (GMAC_TN_TNS_Msk & ((value) << GMAC_TN_TNS_Pos))
#define GMAC_TN_Msk                           (0x3FFFFFFFUL)                                 /**< (GMAC_TN) Register Mask  */

/* -------- GMAC_TA : (GMAC Offset: 0x1d8) (/W 32) 1588 Timer Adjust Register -------- */

typedef union
{
  struct
  {
    uint32_t ITDT:30;                   /**< bit:  0..29  Increment/Decrement                           */
    uint32_t :1;                        /**< bit:     30  Reserved                                      */
    uint32_t ADJ:1;                     /**< bit:     31  Adjust 1588 Timer                             */
  };
  uint32_t w;
} __GMAC_TA_bits_t;

#define GMAC_TA_ITDT_Pos                      (0)                                            /**< (GMAC_TA) Increment/Decrement Position */
#define GMAC_TA_ITDT_Msk                      (0x3FFFFFFFU << GMAC_TA_ITDT_Pos)              /**< (GMAC_TA) Increment/Decrement Mask */
#define GMAC_TA_ITDT(value)                   (GMAC_TA_ITDT_Msk & ((value) << GMAC_TA_ITDT_Pos))
#define GMAC_TA_ADJ_Pos                       (31)                                           /**< (GMAC_TA) Adjust 1588 Timer Position */
#define GMAC_TA_ADJ_Msk                       (0x1U << GMAC_TA_ADJ_Pos)                      /**< (GMAC_TA) Adjust 1588 Timer Mask */
#define GMAC_TA_Msk                           (0xBFFFFFFFUL)                                 /**< (GMAC_TA) Register Mask  */

