zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_TI : (GMAC Offset: 0x1dc) (R/W 32) 1588 Timer Increment Register -------- */

typedef union
{
  struct
  {
    uint32_t CNS:8;                     /**< bit:   0..7  Count Nanoseconds                             */
    uint32_t ACNS:8;                    /**< bit:  8..15  Alternative Count Nanoseconds                 */
    uint32_t NIT:8;                     /**< bit: 16..23  Number of Increments                          */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_TI_bits_t;

#define GMAC_TI_CNS_Pos                       (0)                                            /**< (GMAC_TI) Count Nanoseconds Position */
#define GMAC_TI_CNS_Msk                       (0xFFU << GMAC_TI_CNS_Pos)                     /**< (GMAC_TI) Count Nanoseconds Mask */
#define GMAC_TI_CNS(value)                    (GMAC_TI_CNS_Msk & ((value) << GMAC_TI_CNS_Pos))
#define GMAC_TI_ACNS_Pos                      (8)                                            /**< (GMAC_TI) Alternative Count Nanoseconds Position */
#define GMAC_TI_ACNS_Msk                      (0xFFU << GMAC_TI_ACNS_Pos)                    /**< (GMAC_TI) Alternative Count Nanoseconds Mask */
#define GMAC_TI_ACNS(value)                   (GMAC_TI_ACNS_Msk & ((value) << GMAC_TI_ACNS_Pos))
#define GMAC_TI_NIT_Pos                       (16)                                           /**< (GMAC_TI) Number of Increments Position */
#define GMAC_TI_NIT_Msk                       (0xFFU << GMAC_TI_NIT_Pos)                     /**< (GMAC_TI) Number of Increments Mask */
#define GMAC_TI_NIT(value)                    (GMAC_TI_NIT_Msk & ((value) << GMAC_TI_NIT_Pos))
#define GMAC_TI_Msk                           (0x00FFFFFFUL)                                 /**< (GMAC_TI) Register Mask  */

/* -------- GMAC_EFTSL : (GMAC Offset: 0x1e0) (R/ 32) PTP Event Frame Transmitted Seconds Low Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:32;                    /**< bit:  0..31  Register Update                               */
  };
  uint32_t w;
} __GMAC_EFTSL_bits_t;

#define GMAC_EFTSL_RUD_Pos                    (0)                                            /**< (GMAC_EFTSL) Register Update Position */
#define GMAC_EFTSL_RUD_Msk                    (0xFFFFFFFFU << GMAC_EFTSL_RUD_Pos)            /**< (GMAC_EFTSL) Register Update Mask */
#define GMAC_EFTSL_RUD(value)                 (GMAC_EFTSL_RUD_Msk & ((value) << GMAC_EFTSL_RUD_Pos))
#define GMAC_EFTSL_Msk                        (0xFFFFFFFFUL)                                 /**< (GMAC_EFTSL) Register Mask  */

/* -------- GMAC_EFTN : (GMAC Offset: 0x1e4) (R/ 32) PTP Event Frame Transmitted Nanoseconds Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:30;                    /**< bit:  0..29  Register Update                               */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_EFTN_bits_t;

#define GMAC_EFTN_RUD_Pos                     (0)                                            /**< (GMAC_EFTN) Register Update Position */
#define GMAC_EFTN_RUD_Msk                     (0x3FFFFFFFU << GMAC_EFTN_RUD_Pos)             /**< (GMAC_EFTN) Register Update Mask */
#define GMAC_EFTN_RUD(value)                  (GMAC_EFTN_RUD_Msk & ((value) << GMAC_EFTN_RUD_Pos))
#define GMAC_EFTN_Msk                         (0x3FFFFFFFUL)                                 /**< (GMAC_EFTN) Register Mask  */

/* -------- GMAC_EFRSL : (GMAC Offset: 0x1e8) (R/ 32) PTP Event Frame Received Seconds Low Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:32;                    /**< bit:  0..31  Register Update                               */
  };
  uint32_t w;
} __GMAC_EFRSL_bits_t;

#define GMAC_EFRSL_RUD_Pos                    (0)                                            /**< (GMAC_EFRSL) Register Update Position */
#define GMAC_EFRSL_RUD_Msk                    (0xFFFFFFFFU << GMAC_EFRSL_RUD_Pos)            /**< (GMAC_EFRSL) Register Update Mask */
#define GMAC_EFRSL_RUD(value)                 (GMAC_EFRSL_RUD_Msk & ((value) << GMAC_EFRSL_RUD_Pos))
#define GMAC_EFRSL_Msk                        (0xFFFFFFFFUL)                                 /**< (GMAC_EFRSL) Register Mask  */

/* -------- GMAC_EFRN : (GMAC Offset: 0x1ec) (R/ 32) PTP Event Frame Received Nanoseconds Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:30;                    /**< bit:  0..29  Register Update                               */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_EFRN_bits_t;

#define GMAC_EFRN_RUD_Pos                     (0)                                            /**< (GMAC_EFRN) Register Update Position */
#define GMAC_EFRN_RUD_Msk                     (0x3FFFFFFFU << GMAC_EFRN_RUD_Pos)             /**< (GMAC_EFRN) Register Update Mask */
#define GMAC_EFRN_RUD(value)                  (GMAC_EFRN_RUD_Msk & ((value) << GMAC_EFRN_RUD_Pos))
#define GMAC_EFRN_Msk                         (0x3FFFFFFFUL)                                 /**< (GMAC_EFRN) Register Mask  */

/* -------- GMAC_PEFTSL : (GMAC Offset: 0x1f0) (R/ 32) PTP Peer Event Frame Transmitted Seconds Low Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:32;                    /**< bit:  0..31  Register Update                               */
  };
  uint32_t w;
} __GMAC_PEFTSL_bits_t;

#define GMAC_PEFTSL_RUD_Pos                   (0)                                            /**< (GMAC_PEFTSL) Register Update Position */
#define GMAC_PEFTSL_RUD_Msk                   (0xFFFFFFFFU << GMAC_PEFTSL_RUD_Pos)           /**< (GMAC_PEFTSL) Register Update Mask */
#define GMAC_PEFTSL_RUD(value)                (GMAC_PEFTSL_RUD_Msk & ((value) << GMAC_PEFTSL_RUD_Pos))
#define GMAC_PEFTSL_Msk                       (0xFFFFFFFFUL)                                 /**< (GMAC_PEFTSL) Register Mask  */

/* -------- GMAC_PEFTN : (GMAC Offset: 0x1f4) (R/ 32) PTP Peer Event Frame Transmitted Nanoseconds Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:30;                    /**< bit:  0..29  Register Update                               */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_PEFTN_bits_t;

#define GMAC_PEFTN_RUD_Pos                    (0)                                            /**< (GMAC_PEFTN) Register Update Position */
#define GMAC_PEFTN_RUD_Msk                    (0x3FFFFFFFU << GMAC_PEFTN_RUD_Pos)            /**< (GMAC_PEFTN) Register Update Mask */
#define GMAC_PEFTN_RUD(value)                 (GMAC_PEFTN_RUD_Msk & ((value) << GMAC_PEFTN_RUD_Pos))
#define GMAC_PEFTN_Msk                        (0x3FFFFFFFUL)                                 /**< (GMAC_PEFTN) Register Mask  */

/* -------- GMAC_PEFRSL : (GMAC Offset: 0x1f8) (R/ 32) PTP Peer Event Frame Received Seconds Low Register -------- */

typedef union
{
  struct
  {
    uint32_t RUD:32;                    /**< bit:  0..31  Register Update                               */
  };
  uint32_t w;
} __GMAC_PEFRSL_bits_t;

#define GMAC_PEFRSL_RUD_Pos                   (0)                                            /**< (GMAC_PEFRSL) Register Update Position */
#define GMAC_PEFRSL_RUD_Msk                   (0xFFFFFFFFU << GMAC_PEFRSL_RUD_Pos)           /**< (GMAC_PEFRSL) Register Update Mask */
#define GMAC_PEFRSL_RUD(value)                (GMAC_PEFRSL_RUD_Msk & ((value) << GMAC_PEFRSL_RUD_Pos))
#define GMAC_PEFRSL_Msk                       (0xFFFFFFFFUL)                                 /**< (GMAC_PEFRSL) Register Mask  */

