zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_TBQBAPQ_TXBQBA_Pos               (2)                                            /**< (GMAC_TBQBAPQ) Transmit Buffer Queue Base Address Position */
#define GMAC_TBQBAPQ_TXBQBA_Msk               (0x3FFFFFFFU << GMAC_TBQBAPQ_TXBQBA_Pos)       /**< (GMAC_TBQBAPQ) Transmit Buffer Queue Base Address Mask */
#define GMAC_TBQBAPQ_TXBQBA(value)            (GMAC_TBQBAPQ_TXBQBA_Msk & ((value) << GMAC_TBQBAPQ_TXBQBA_Pos))
#define GMAC_TBQBAPQ_Msk                      (0xFFFFFFFCUL)                                 /**< (GMAC_TBQBAPQ) Register Mask  */

/* -------- GMAC_RBQBAPQ : (GMAC Offset: 0x480) (R/W 32) Receive Buffer Queue Base Address Register Priority Queue (index = 1) 0 -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RXBQBA:30;                 /**< bit:  2..31  Receive Buffer Queue Base Address             */
  };
  uint32_t w;
} __GMAC_RBQBAPQ_bits_t;

#define GMAC_RBQBAPQ_RXBQBA_Pos               (2)                                            /**< (GMAC_RBQBAPQ) Receive Buffer Queue Base Address Position */
#define GMAC_RBQBAPQ_RXBQBA_Msk               (0x3FFFFFFFU << GMAC_RBQBAPQ_RXBQBA_Pos)       /**< (GMAC_RBQBAPQ) Receive Buffer Queue Base Address Mask */
#define GMAC_RBQBAPQ_RXBQBA(value)            (GMAC_RBQBAPQ_RXBQBA_Msk & ((value) << GMAC_RBQBAPQ_RXBQBA_Pos))
#define GMAC_RBQBAPQ_Msk                      (0xFFFFFFFCUL)                                 /**< (GMAC_RBQBAPQ) Register Mask  */

/* -------- GMAC_RBSRPQ : (GMAC Offset: 0x4a0) (R/W 32) Receive Buffer Size Register Priority Queue (index = 1) 0 -------- */

typedef union
{
  struct
  {
    uint32_t RBS:16;                    /**< bit:  0..15  Receive Buffer Size                           */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_RBSRPQ_bits_t;

#define GMAC_RBSRPQ_RBS_Pos                   (0)                                            /**< (GMAC_RBSRPQ) Receive Buffer Size Position */
#define GMAC_RBSRPQ_RBS_Msk                   (0xFFFFU << GMAC_RBSRPQ_RBS_Pos)               /**< (GMAC_RBSRPQ) Receive Buffer Size Mask */
#define GMAC_RBSRPQ_RBS(value)                (GMAC_RBSRPQ_RBS_Msk & ((value) << GMAC_RBSRPQ_RBS_Pos))
#define GMAC_RBSRPQ_Msk                       (0x0000FFFFUL)                                 /**< (GMAC_RBSRPQ) Register Mask  */

/* -------- GMAC_CBSCR : (GMAC Offset: 0x4bc) (R/W 32) Credit-Based Shaping Control Register -------- */

typedef union
{
  struct
  {
    uint32_t QBE:1;                     /**< bit:      0  Queue B CBS Enable                            */
    uint32_t QAE:1;                     /**< bit:      1  Queue A CBS Enable                            */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_CBSCR_bits_t;

#define GMAC_CBSCR_QBE_Pos                    (0)                                            /**< (GMAC_CBSCR) Queue B CBS Enable Position */
#define GMAC_CBSCR_QBE_Msk                    (0x1U << GMAC_CBSCR_QBE_Pos)                   /**< (GMAC_CBSCR) Queue B CBS Enable Mask */
#define GMAC_CBSCR_QAE_Pos                    (1)                                            /**< (GMAC_CBSCR) Queue A CBS Enable Position */
#define GMAC_CBSCR_QAE_Msk                    (0x1U << GMAC_CBSCR_QAE_Pos)                   /**< (GMAC_CBSCR) Queue A CBS Enable Mask */
#define GMAC_CBSCR_Msk                        (0x00000003UL)                                 /**< (GMAC_CBSCR) Register Mask  */

/* -------- GMAC_CBSISQA : (GMAC Offset: 0x4c0) (R/W 32) Credit-Based Shaping IdleSlope Register for Queue A -------- */

typedef union
{
  struct
  {
    uint32_t IS:32;                     /**< bit:  0..31  IdleSlope                                     */
  };
  uint32_t w;
} __GMAC_CBSISQA_bits_t;

#define GMAC_CBSISQA_IS_Pos                   (0)                                            /**< (GMAC_CBSISQA) IdleSlope Position */
#define GMAC_CBSISQA_IS_Msk                   (0xFFFFFFFFU << GMAC_CBSISQA_IS_Pos)           /**< (GMAC_CBSISQA) IdleSlope Mask */
#define GMAC_CBSISQA_IS(value)                (GMAC_CBSISQA_IS_Msk & ((value) << GMAC_CBSISQA_IS_Pos))
#define GMAC_CBSISQA_Msk                      (0xFFFFFFFFUL)                                 /**< (GMAC_CBSISQA) Register Mask  */

/* -------- GMAC_CBSISQB : (GMAC Offset: 0x4c4) (R/W 32) Credit-Based Shaping IdleSlope Register for Queue B -------- */

typedef union
{
  struct
  {
    uint32_t IS:32;                     /**< bit:  0..31  IdleSlope                                     */
  };
  uint32_t w;
} __GMAC_CBSISQB_bits_t;

#define GMAC_CBSISQB_IS_Pos                   (0)                                            /**< (GMAC_CBSISQB) IdleSlope Position */
#define GMAC_CBSISQB_IS_Msk                   (0xFFFFFFFFU << GMAC_CBSISQB_IS_Pos)           /**< (GMAC_CBSISQB) IdleSlope Mask */
#define GMAC_CBSISQB_IS(value)                (GMAC_CBSISQB_IS_Msk & ((value) << GMAC_CBSISQB_IS_Pos))
#define GMAC_CBSISQB_Msk                      (0xFFFFFFFFUL)                                 /**< (GMAC_CBSISQB) Register Mask  */

/* -------- GMAC_ST1RPQ : (GMAC Offset: 0x500) (R/W 32) Screening Type 1 Register Priority Queue (index = 0) 0 -------- */

typedef union
{
  struct
  {
    uint32_t QNB:3;                     /**< bit:   0..2  Queue Number (0-5)                            */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t DSTCM:8;                   /**< bit:  4..11  Differentiated Services or Traffic Class Match */
    uint32_t UDPM:16;                   /**< bit: 12..27  UDP Port Match                                */
    uint32_t DSTCE:1;                   /**< bit:     28  Differentiated Services or Traffic Class Match Enable */
    uint32_t UDPE:1;                    /**< bit:     29  UDP Port Match Enable                         */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_ST1RPQ_bits_t;

