zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_IERPQ : (GMAC Offset: 0x600) (/W 32) Interrupt Enable Register Priority Queue (index = 1) 0 -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                              */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                              */
    uint32_t :2;                        /**< bit:   3..4  Reserved                                      */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded or Late Collision        */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error    */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                             */
    uint32_t :2;                        /**< bit:   8..9  Reserved                                      */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                               */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                                  */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_IERPQ_bits_t;

#define GMAC_IERPQ_RCOMP_Pos                  (1)                                            /**< (GMAC_IERPQ) Receive Complete Position */
#define GMAC_IERPQ_RCOMP_Msk                  (0x1U << GMAC_IERPQ_RCOMP_Pos)                 /**< (GMAC_IERPQ) Receive Complete Mask */
#define GMAC_IERPQ_RXUBR_Pos                  (2)                                            /**< (GMAC_IERPQ) RX Used Bit Read Position */
#define GMAC_IERPQ_RXUBR_Msk                  (0x1U << GMAC_IERPQ_RXUBR_Pos)                 /**< (GMAC_IERPQ) RX Used Bit Read Mask */
#define GMAC_IERPQ_RLEX_Pos                   (5)                                            /**< (GMAC_IERPQ) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IERPQ_RLEX_Msk                   (0x1U << GMAC_IERPQ_RLEX_Pos)                  /**< (GMAC_IERPQ) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IERPQ_TFC_Pos                    (6)                                            /**< (GMAC_IERPQ) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_IERPQ_TFC_Msk                    (0x1U << GMAC_IERPQ_TFC_Pos)                   /**< (GMAC_IERPQ) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_IERPQ_TCOMP_Pos                  (7)                                            /**< (GMAC_IERPQ) Transmit Complete Position */
#define GMAC_IERPQ_TCOMP_Msk                  (0x1U << GMAC_IERPQ_TCOMP_Pos)                 /**< (GMAC_IERPQ) Transmit Complete Mask */
#define GMAC_IERPQ_ROVR_Pos                   (10)                                           /**< (GMAC_IERPQ) Receive Overrun Position */
#define GMAC_IERPQ_ROVR_Msk                   (0x1U << GMAC_IERPQ_ROVR_Pos)                  /**< (GMAC_IERPQ) Receive Overrun Mask */
#define GMAC_IERPQ_HRESP_Pos                  (11)                                           /**< (GMAC_IERPQ) HRESP Not OK Position */
#define GMAC_IERPQ_HRESP_Msk                  (0x1U << GMAC_IERPQ_HRESP_Pos)                 /**< (GMAC_IERPQ) HRESP Not OK Mask */
#define GMAC_IERPQ_Msk                        (0x00000CE6UL)                                 /**< (GMAC_IERPQ) Register Mask  */

/* -------- GMAC_IDRPQ : (GMAC Offset: 0x620) (/W 32) Interrupt Disable Register Priority Queue (index = 1) 0 -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                              */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                              */
    uint32_t :2;                        /**< bit:   3..4  Reserved                                      */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded or Late Collision        */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error    */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                             */
    uint32_t :2;                        /**< bit:   8..9  Reserved                                      */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                               */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                                  */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_IDRPQ_bits_t;

#define GMAC_IDRPQ_RCOMP_Pos                  (1)                                            /**< (GMAC_IDRPQ) Receive Complete Position */
#define GMAC_IDRPQ_RCOMP_Msk                  (0x1U << GMAC_IDRPQ_RCOMP_Pos)                 /**< (GMAC_IDRPQ) Receive Complete Mask */
#define GMAC_IDRPQ_RXUBR_Pos                  (2)                                            /**< (GMAC_IDRPQ) RX Used Bit Read Position */
#define GMAC_IDRPQ_RXUBR_Msk                  (0x1U << GMAC_IDRPQ_RXUBR_Pos)                 /**< (GMAC_IDRPQ) RX Used Bit Read Mask */
#define GMAC_IDRPQ_RLEX_Pos                   (5)                                            /**< (GMAC_IDRPQ) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IDRPQ_RLEX_Msk                   (0x1U << GMAC_IDRPQ_RLEX_Pos)                  /**< (GMAC_IDRPQ) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IDRPQ_TFC_Pos                    (6)                                            /**< (GMAC_IDRPQ) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_IDRPQ_TFC_Msk                    (0x1U << GMAC_IDRPQ_TFC_Pos)                   /**< (GMAC_IDRPQ) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_IDRPQ_TCOMP_Pos                  (7)                                            /**< (GMAC_IDRPQ) Transmit Complete Position */
#define GMAC_IDRPQ_TCOMP_Msk                  (0x1U << GMAC_IDRPQ_TCOMP_Pos)                 /**< (GMAC_IDRPQ) Transmit Complete Mask */
#define GMAC_IDRPQ_ROVR_Pos                   (10)                                           /**< (GMAC_IDRPQ) Receive Overrun Position */
#define GMAC_IDRPQ_ROVR_Msk                   (0x1U << GMAC_IDRPQ_ROVR_Pos)                  /**< (GMAC_IDRPQ) Receive Overrun Mask */
#define GMAC_IDRPQ_HRESP_Pos                  (11)                                           /**< (GMAC_IDRPQ) HRESP Not OK Position */
#define GMAC_IDRPQ_HRESP_Msk                  (0x1U << GMAC_IDRPQ_HRESP_Pos)                 /**< (GMAC_IDRPQ) HRESP Not OK Mask */
#define GMAC_IDRPQ_Msk                        (0x00000CE6UL)                                 /**< (GMAC_IDRPQ) Register Mask  */

