zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
/* -------- GMAC_ST2CW01 : (GMAC Offset: 0x708) (R/W 32) Screening Type 2 Compare Word 0 Register (index = 1) -------- */

typedef union
{
  struct
  {
    uint32_t MASKVAL:16;                /**< bit:  0..15  Mask Value                                    */
    uint32_t COMPVAL:16;                /**< bit: 16..31  Compare Value                                 */
  };
  uint32_t w;
} __GMAC_ST2CW01_bits_t;

#define GMAC_ST2CW01_MASKVAL_Pos              (0)                                            /**< (GMAC_ST2CW01) Mask Value Position */
#define GMAC_ST2CW01_MASKVAL_Msk              (0xFFFFU << GMAC_ST2CW01_MASKVAL_Pos)          /**< (GMAC_ST2CW01) Mask Value Mask */
#define GMAC_ST2CW01_MASKVAL(value)           (GMAC_ST2CW01_MASKVAL_Msk & ((value) << GMAC_ST2CW01_MASKVAL_Pos))
#define GMAC_ST2CW01_COMPVAL_Pos              (16)                                           /**< (GMAC_ST2CW01) Compare Value Position */
#define GMAC_ST2CW01_COMPVAL_Msk              (0xFFFFU << GMAC_ST2CW01_COMPVAL_Pos)          /**< (GMAC_ST2CW01) Compare Value Mask */
#define GMAC_ST2CW01_COMPVAL(value)           (GMAC_ST2CW01_COMPVAL_Msk & ((value) << GMAC_ST2CW01_COMPVAL_Pos))
#define GMAC_ST2CW01_Msk                      (0xFFFFFFFFUL)                                 /**< (GMAC_ST2CW01) Register Mask  */

/* -------- GMAC_ST2CW11 : (GMAC Offset: 0x70c) (R/W 32) Screening Type 2 Compare Word 1 Register (index = 1) -------- */

typedef union
{
  struct
  {
    uint32_t OFFSVAL:7;                 /**< bit:   0..6  Offset Value in Bytes                         */
    uint32_t OFFSSTRT:2;                /**< bit:   7..8  Ethernet Frame Offset Start                   */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_ST2CW11_bits_t;

#define GMAC_ST2CW11_OFFSVAL_Pos              (0)                                            /**< (GMAC_ST2CW11) Offset Value in Bytes Position */
#define GMAC_ST2CW11_OFFSVAL_Msk              (0x7FU << GMAC_ST2CW11_OFFSVAL_Pos)            /**< (GMAC_ST2CW11) Offset Value in Bytes Mask */
#define GMAC_ST2CW11_OFFSVAL(value)           (GMAC_ST2CW11_OFFSVAL_Msk & ((value) << GMAC_ST2CW11_OFFSVAL_Pos))
#define GMAC_ST2CW11_OFFSSTRT_Pos             (7)                                            /**< (GMAC_ST2CW11) Ethernet Frame Offset Start Position */
#define GMAC_ST2CW11_OFFSSTRT_Msk             (0x3U << GMAC_ST2CW11_OFFSSTRT_Pos)            /**< (GMAC_ST2CW11) Ethernet Frame Offset Start Mask */
#define GMAC_ST2CW11_OFFSSTRT(value)          (GMAC_ST2CW11_OFFSSTRT_Msk & ((value) << GMAC_ST2CW11_OFFSSTRT_Pos))
#define   GMAC_ST2CW11_OFFSSTRT_FRAMESTART_Val (0x0U)                                         /**< (GMAC_ST2CW11) Offset from the start of the frame  */
#define   GMAC_ST2CW11_OFFSSTRT_ETHERTYPE_Val (0x1U)                                         /**< (GMAC_ST2CW11) Offset from the byte after the EtherType field  */
#define   GMAC_ST2CW11_OFFSSTRT_IP_Val        (0x2U)                                         /**< (GMAC_ST2CW11) Offset from the byte after the IP header field  */
#define   GMAC_ST2CW11_OFFSSTRT_TCP_UDP_Val   (0x3U)                                         /**< (GMAC_ST2CW11) Offset from the byte after the TCP/UDP header field  */
#define GMAC_ST2CW11_OFFSSTRT_FRAMESTART      (GMAC_ST2CW11_OFFSSTRT_FRAMESTART_Val << GMAC_ST2CW11_OFFSSTRT_Pos)  /**< (GMAC_ST2CW11) Offset from the start of the frame Position  */
#define GMAC_ST2CW11_OFFSSTRT_ETHERTYPE       (GMAC_ST2CW11_OFFSSTRT_ETHERTYPE_Val << GMAC_ST2CW11_OFFSSTRT_Pos)  /**< (GMAC_ST2CW11) Offset from the byte after the EtherType field Position  */
#define GMAC_ST2CW11_OFFSSTRT_IP              (GMAC_ST2CW11_OFFSSTRT_IP_Val << GMAC_ST2CW11_OFFSSTRT_Pos)  /**< (GMAC_ST2CW11) Offset from the byte after the IP header field Position  */
#define GMAC_ST2CW11_OFFSSTRT_TCP_UDP         (GMAC_ST2CW11_OFFSSTRT_TCP_UDP_Val << GMAC_ST2CW11_OFFSSTRT_Pos)  /**< (GMAC_ST2CW11) Offset from the byte after the TCP/UDP header field Position  */
#define GMAC_ST2CW11_Msk                      (0x000001FFUL)                                 /**< (GMAC_ST2CW11) Register Mask  */

/* -------- GMAC_ST2CW02 : (GMAC Offset: 0x710) (R/W 32) Screening Type 2 Compare Word 0 Register (index = 2) -------- */

typedef union
{
  struct
  {
    uint32_t MASKVAL:16;                /**< bit:  0..15  Mask Value                                    */
    uint32_t COMPVAL:16;                /**< bit: 16..31  Compare Value                                 */
  };
  uint32_t w;
} __GMAC_ST2CW02_bits_t;

#define GMAC_ST2CW02_MASKVAL_Pos              (0)                                            /**< (GMAC_ST2CW02) Mask Value Position */
#define GMAC_ST2CW02_MASKVAL_Msk              (0xFFFFU << GMAC_ST2CW02_MASKVAL_Pos)          /**< (GMAC_ST2CW02) Mask Value Mask */
#define GMAC_ST2CW02_MASKVAL(value)           (GMAC_ST2CW02_MASKVAL_Msk & ((value) << GMAC_ST2CW02_MASKVAL_Pos))
#define GMAC_ST2CW02_COMPVAL_Pos              (16)                                           /**< (GMAC_ST2CW02) Compare Value Position */
#define GMAC_ST2CW02_COMPVAL_Msk              (0xFFFFU << GMAC_ST2CW02_COMPVAL_Pos)          /**< (GMAC_ST2CW02) Compare Value Mask */
#define GMAC_ST2CW02_COMPVAL(value)           (GMAC_ST2CW02_COMPVAL_Msk & ((value) << GMAC_ST2CW02_COMPVAL_Pos))
#define GMAC_ST2CW02_Msk                      (0xFFFFFFFFUL)                                 /**< (GMAC_ST2CW02) Register Mask  */

/* -------- GMAC_ST2CW12 : (GMAC Offset: 0x714) (R/W 32) Screening Type 2 Compare Word 1 Register (index = 2) -------- */

typedef union
{
  struct
  {
    uint32_t OFFSVAL:7;                 /**< bit:   0..6  Offset Value in Bytes                         */
    uint32_t OFFSSTRT:2;                /**< bit:   7..8  Ethernet Frame Offset Start                   */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_ST2CW12_bits_t;

#define GMAC_ST2CW12_OFFSVAL_Pos              (0)                                            /**< (GMAC_ST2CW12) Offset Value in Bytes Position */
#define GMAC_ST2CW12_OFFSVAL_Msk              (0x7FU << GMAC_ST2CW12_OFFSVAL_Pos)            /**< (GMAC_ST2CW12) Offset Value in Bytes Mask */
#define GMAC_ST2CW12_OFFSVAL(value)           (GMAC_ST2CW12_OFFSVAL_Msk & ((value) << GMAC_ST2CW12_OFFSVAL_Pos))
#define GMAC_ST2CW12_OFFSSTRT_Pos             (7)                                            /**< (GMAC_ST2CW12) Ethernet Frame Offset Start Position */
#define GMAC_ST2CW12_OFFSSTRT_Msk             (0x3U << GMAC_ST2CW12_OFFSSTRT_Pos)            /**< (GMAC_ST2CW12) Ethernet Frame Offset Start Mask */
#define GMAC_ST2CW12_OFFSSTRT(value)          (GMAC_ST2CW12_OFFSSTRT_Msk & ((value) << GMAC_ST2CW12_OFFSSTRT_Pos))
#define   GMAC_ST2CW12_OFFSSTRT_FRAMESTART_Val (0x0U)                                         /**< (GMAC_ST2CW12) Offset from the start of the frame  */
#define   GMAC_ST2CW12_OFFSSTRT_ETHERTYPE_Val (0x1U)                                         /**< (GMAC_ST2CW12) Offset from the byte after the EtherType field  */
#define   GMAC_ST2CW12_OFFSSTRT_IP_Val        (0x2U)                                         /**< (GMAC_ST2CW12) Offset from the byte after the IP header field  */
#define   GMAC_ST2CW12_OFFSSTRT_TCP_UDP_Val   (0x3U)                                         /**< (GMAC_ST2CW12) Offset from the byte after the TCP/UDP header field  */
#define GMAC_ST2CW12_OFFSSTRT_FRAMESTART      (GMAC_ST2CW12_OFFSSTRT_FRAMESTART_Val << GMAC_ST2CW12_OFFSSTRT_Pos)  /**< (GMAC_ST2CW12) Offset from the start of the frame Position  */
#define GMAC_ST2CW12_OFFSSTRT_ETHERTYPE       (GMAC_ST2CW12_OFFSSTRT_ETHERTYPE_Val << GMAC_ST2CW12_OFFSSTRT_Pos)  /**< (GMAC_ST2CW12) Offset from the byte after the EtherType field Position  */
#define GMAC_ST2CW12_OFFSSTRT_IP              (GMAC_ST2CW12_OFFSSTRT_IP_Val << GMAC_ST2CW12_OFFSSTRT_Pos)  /**< (GMAC_ST2CW12) Offset from the byte after the IP header field Position  */
#define GMAC_ST2CW12_OFFSSTRT_TCP_UDP         (GMAC_ST2CW12_OFFSSTRT_TCP_UDP_Val << GMAC_ST2CW12_OFFSSTRT_Pos)  /**< (GMAC_ST2CW12) Offset from the byte after the TCP/UDP header field Position  */
#define GMAC_ST2CW12_Msk                      (0x000001FFUL)                                 /**< (GMAC_ST2CW12) Register Mask  */

/* -------- GMAC_ST2CW03 : (GMAC Offset: 0x718) (R/W 32) Screening Type 2 Compare Word 0 Register (index = 3) -------- */

typedef union
{
  struct
  {
    uint32_t MASKVAL:16;                /**< bit:  0..15  Mask Value                                    */
    uint32_t COMPVAL:16;                /**< bit: 16..31  Compare Value                                 */
  };
  uint32_t w;
} __GMAC_ST2CW03_bits_t;

