zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_ST2CW023_MASKVAL_Pos             (0)                                            /**< (GMAC_ST2CW023) Mask Value Position */
#define GMAC_ST2CW023_MASKVAL_Msk             (0xFFFFU << GMAC_ST2CW023_MASKVAL_Pos)         /**< (GMAC_ST2CW023) Mask Value Mask */
#define GMAC_ST2CW023_MASKVAL(value)          (GMAC_ST2CW023_MASKVAL_Msk & ((value) << GMAC_ST2CW023_MASKVAL_Pos))
#define GMAC_ST2CW023_COMPVAL_Pos             (16)                                           /**< (GMAC_ST2CW023) Compare Value Position */
#define GMAC_ST2CW023_COMPVAL_Msk             (0xFFFFU << GMAC_ST2CW023_COMPVAL_Pos)         /**< (GMAC_ST2CW023) Compare Value Mask */
#define GMAC_ST2CW023_COMPVAL(value)          (GMAC_ST2CW023_COMPVAL_Msk & ((value) << GMAC_ST2CW023_COMPVAL_Pos))
#define GMAC_ST2CW023_Msk                     (0xFFFFFFFFUL)                                 /**< (GMAC_ST2CW023) Register Mask  */

/* -------- GMAC_ST2CW123 : (GMAC Offset: 0x7bc) (R/W 32) Screening Type 2 Compare Word 1 Register (index = 23) -------- */

typedef union
{
  struct
  {
    uint32_t OFFSVAL:7;                 /**< bit:   0..6  Offset Value in Bytes                         */
    uint32_t OFFSSTRT:2;                /**< bit:   7..8  Ethernet Frame Offset Start                   */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __GMAC_ST2CW123_bits_t;

#define GMAC_ST2CW123_OFFSVAL_Pos             (0)                                            /**< (GMAC_ST2CW123) Offset Value in Bytes Position */
#define GMAC_ST2CW123_OFFSVAL_Msk             (0x7FU << GMAC_ST2CW123_OFFSVAL_Pos)           /**< (GMAC_ST2CW123) Offset Value in Bytes Mask */
#define GMAC_ST2CW123_OFFSVAL(value)          (GMAC_ST2CW123_OFFSVAL_Msk & ((value) << GMAC_ST2CW123_OFFSVAL_Pos))
#define GMAC_ST2CW123_OFFSSTRT_Pos            (7)                                            /**< (GMAC_ST2CW123) Ethernet Frame Offset Start Position */
#define GMAC_ST2CW123_OFFSSTRT_Msk            (0x3U << GMAC_ST2CW123_OFFSSTRT_Pos)           /**< (GMAC_ST2CW123) Ethernet Frame Offset Start Mask */
#define GMAC_ST2CW123_OFFSSTRT(value)         (GMAC_ST2CW123_OFFSSTRT_Msk & ((value) << GMAC_ST2CW123_OFFSSTRT_Pos))
#define   GMAC_ST2CW123_OFFSSTRT_FRAMESTART_Val (0x0U)                                         /**< (GMAC_ST2CW123) Offset from the start of the frame  */
#define   GMAC_ST2CW123_OFFSSTRT_ETHERTYPE_Val (0x1U)                                         /**< (GMAC_ST2CW123) Offset from the byte after the EtherType field  */
#define   GMAC_ST2CW123_OFFSSTRT_IP_Val       (0x2U)                                         /**< (GMAC_ST2CW123) Offset from the byte after the IP header field  */
#define   GMAC_ST2CW123_OFFSSTRT_TCP_UDP_Val  (0x3U)                                         /**< (GMAC_ST2CW123) Offset from the byte after the TCP/UDP header field  */
#define GMAC_ST2CW123_OFFSSTRT_FRAMESTART     (GMAC_ST2CW123_OFFSSTRT_FRAMESTART_Val << GMAC_ST2CW123_OFFSSTRT_Pos)  /**< (GMAC_ST2CW123) Offset from the start of the frame Position  */
#define GMAC_ST2CW123_OFFSSTRT_ETHERTYPE      (GMAC_ST2CW123_OFFSSTRT_ETHERTYPE_Val << GMAC_ST2CW123_OFFSSTRT_Pos)  /**< (GMAC_ST2CW123) Offset from the byte after the EtherType field Position  */
#define GMAC_ST2CW123_OFFSSTRT_IP             (GMAC_ST2CW123_OFFSSTRT_IP_Val << GMAC_ST2CW123_OFFSSTRT_Pos)  /**< (GMAC_ST2CW123) Offset from the byte after the IP header field Position  */
#define GMAC_ST2CW123_OFFSSTRT_TCP_UDP        (GMAC_ST2CW123_OFFSSTRT_TCP_UDP_Val << GMAC_ST2CW123_OFFSSTRT_Pos)  /**< (GMAC_ST2CW123) Offset from the byte after the TCP/UDP header field Position  */
#define GMAC_ST2CW123_Msk                     (0x000001FFUL)                                 /**< (GMAC_ST2CW123) Register Mask  */

/** \brief GMAC_SA register offsets definitions */
#define GMAC_SAB_OFFSET              (0x00)         /**< (GMAC_SAB) Specific Address 1 Bottom Register Offset */
#define GMAC_SAT_OFFSET              (0x04)         /**< (GMAC_SAT) Specific Address 1 Top Register Offset */
/** \brief GMAC register offsets definitions */
#define GMAC_NCR_OFFSET              (0x00)         /**< (GMAC_NCR) Network Control Register Offset */
#define GMAC_NCFGR_OFFSET            (0x04)         /**< (GMAC_NCFGR) Network Configuration Register Offset */
#define GMAC_NSR_OFFSET              (0x08)         /**< (GMAC_NSR) Network Status Register Offset */
#define GMAC_UR_OFFSET               (0x0C)         /**< (GMAC_UR) User Register Offset */
#define GMAC_DCFGR_OFFSET            (0x10)         /**< (GMAC_DCFGR) DMA Configuration Register Offset */
#define GMAC_TSR_OFFSET              (0x14)         /**< (GMAC_TSR) Transmit Status Register Offset */
#define GMAC_RBQB_OFFSET             (0x18)         /**< (GMAC_RBQB) Receive Buffer Queue Base Address Register Offset */
#define GMAC_TBQB_OFFSET             (0x1C)         /**< (GMAC_TBQB) Transmit Buffer Queue Base Address Register Offset */
#define GMAC_RSR_OFFSET              (0x20)         /**< (GMAC_RSR) Receive Status Register Offset */
#define GMAC_ISR_OFFSET              (0x24)         /**< (GMAC_ISR) Interrupt Status Register Offset */
#define GMAC_IER_OFFSET              (0x28)         /**< (GMAC_IER) Interrupt Enable Register Offset */
#define GMAC_IDR_OFFSET              (0x2C)         /**< (GMAC_IDR) Interrupt Disable Register Offset */
#define GMAC_IMR_OFFSET              (0x30)         /**< (GMAC_IMR) Interrupt Mask Register Offset */
#define GMAC_MAN_OFFSET              (0x34)         /**< (GMAC_MAN) PHY Maintenance Register Offset */
#define GMAC_RPQ_OFFSET              (0x38)         /**< (GMAC_RPQ) Received Pause Quantum Register Offset */
#define GMAC_TPQ_OFFSET              (0x3C)         /**< (GMAC_TPQ) Transmit Pause Quantum Register Offset */
#define GMAC_TPSF_OFFSET             (0x40)         /**< (GMAC_TPSF) TX Partial Store and Forward Register Offset */
#define GMAC_RPSF_OFFSET             (0x44)         /**< (GMAC_RPSF) RX Partial Store and Forward Register Offset */
#define GMAC_RJFML_OFFSET            (0x48)         /**< (GMAC_RJFML) RX Jumbo Frame Max Length Register Offset */
#define GMAC_HRB_OFFSET              (0x80)         /**< (GMAC_HRB) Hash Register Bottom Offset */
#define GMAC_HRT_OFFSET              (0x84)         /**< (GMAC_HRT) Hash Register Top Offset */
#define GMAC_TIDM1_OFFSET            (0xA8)         /**< (GMAC_TIDM1) Type ID Match 1 Register Offset */
#define GMAC_TIDM2_OFFSET            (0xAC)         /**< (GMAC_TIDM2) Type ID Match 2 Register Offset */
#define GMAC_TIDM3_OFFSET            (0xB0)         /**< (GMAC_TIDM3) Type ID Match 3 Register Offset */
#define GMAC_TIDM4_OFFSET            (0xB4)         /**< (GMAC_TIDM4) Type ID Match 4 Register Offset */
#define GMAC_WOL_OFFSET              (0xB8)         /**< (GMAC_WOL) Wake on LAN Register Offset */
#define GMAC_IPGS_OFFSET             (0xBC)         /**< (GMAC_IPGS) IPG Stretch Register Offset */
#define GMAC_SVLAN_OFFSET            (0xC0)         /**< (GMAC_SVLAN) Stacked VLAN Register Offset */
#define GMAC_TPFCP_OFFSET            (0xC4)         /**< (GMAC_TPFCP) Transmit PFC Pause Register Offset */
#define GMAC_SAMB1_OFFSET            (0xC8)         /**< (GMAC_SAMB1) Specific Address 1 Mask Bottom Register Offset */
#define GMAC_SAMT1_OFFSET            (0xCC)         /**< (GMAC_SAMT1) Specific Address 1 Mask Top Register Offset */
#define GMAC_NSC_OFFSET              (0xDC)         /**< (GMAC_NSC) 1588 Timer Nanosecond Comparison Register Offset */
#define GMAC_SCL_OFFSET              (0xE0)         /**< (GMAC_SCL) 1588 Timer Second Comparison Low Register Offset */
#define GMAC_SCH_OFFSET              (0xE4)         /**< (GMAC_SCH) 1588 Timer Second Comparison High Register Offset */
#define GMAC_EFTSH_OFFSET            (0xE8)         /**< (GMAC_EFTSH) PTP Event Frame Transmitted Seconds High Register Offset */
#define GMAC_EFRSH_OFFSET            (0xEC)         /**< (GMAC_EFRSH) PTP Event Frame Received Seconds High Register Offset */
#define GMAC_PEFTSH_OFFSET           (0xF0)         /**< (GMAC_PEFTSH) PTP Peer Event Frame Transmitted Seconds High Register Offset */
#define GMAC_PEFRSH_OFFSET           (0xF4)         /**< (GMAC_PEFRSH) PTP Peer Event Frame Received Seconds High Register Offset */
#define GMAC_MID_OFFSET              (0xFC)         /**< (GMAC_MID) Module ID Register Offset */
#define GMAC_OTLO_OFFSET             (0x100)        /**< (GMAC_OTLO) Octets Transmitted Low Register Offset */
#define GMAC_OTHI_OFFSET             (0x104)        /**< (GMAC_OTHI) Octets Transmitted High Register Offset */
#define GMAC_FT_OFFSET               (0x108)        /**< (GMAC_FT) Frames Transmitted Register Offset */
#define GMAC_BCFT_OFFSET             (0x10C)        /**< (GMAC_BCFT) Broadcast Frames Transmitted Register Offset */
#define GMAC_MFT_OFFSET              (0x110)        /**< (GMAC_MFT) Multicast Frames Transmitted Register Offset */
#define GMAC_PFT_OFFSET              (0x114)        /**< (GMAC_PFT) Pause Frames Transmitted Register Offset */
#define GMAC_BFT64_OFFSET            (0x118)        /**< (GMAC_BFT64) 64 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT127_OFFSET          (0x11C)        /**< (GMAC_TBFT127) 65 to 127 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT255_OFFSET          (0x120)        /**< (GMAC_TBFT255) 128 to 255 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT511_OFFSET          (0x124)        /**< (GMAC_TBFT511) 256 to 511 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT1023_OFFSET         (0x128)        /**< (GMAC_TBFT1023) 512 to 1023 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT1518_OFFSET         (0x12C)        /**< (GMAC_TBFT1518) 1024 to 1518 Byte Frames Transmitted Register Offset */
#define GMAC_GTBFT1518_OFFSET        (0x130)        /**< (GMAC_GTBFT1518) Greater Than 1518 Byte Frames Transmitted Register Offset */
#define GMAC_TUR_OFFSET              (0x134)        /**< (GMAC_TUR) Transmit Underruns Register Offset */
#define GMAC_SCF_OFFSET              (0x138)        /**< (GMAC_SCF) Single Collision Frames Register Offset */
#define GMAC_MCF_OFFSET              (0x13C)        /**< (GMAC_MCF) Multiple Collision Frames Register Offset */
#define GMAC_EC_OFFSET               (0x140)        /**< (GMAC_EC) Excessive Collisions Register Offset */
#define GMAC_LC_OFFSET               (0x144)        /**< (GMAC_LC) Late Collisions Register Offset */
#define GMAC_DTF_OFFSET              (0x148)        /**< (GMAC_DTF) Deferred Transmission Frames Register Offset */
#define GMAC_CSE_OFFSET              (0x14C)        /**< (GMAC_CSE) Carrier Sense Errors Register Offset */
#define GMAC_ORLO_OFFSET             (0x150)        /**< (GMAC_ORLO) Octets Received Low Received Register Offset */
#define GMAC_ORHI_OFFSET             (0x154)        /**< (GMAC_ORHI) Octets Received High Received Register Offset */
#define GMAC_FR_OFFSET               (0x158)        /**< (GMAC_FR) Frames Received Register Offset */
#define GMAC_BCFR_OFFSET             (0x15C)        /**< (GMAC_BCFR) Broadcast Frames Received Register Offset */
#define GMAC_MFR_OFFSET              (0x160)        /**< (GMAC_MFR) Multicast Frames Received Register Offset */
#define GMAC_PFR_OFFSET              (0x164)        /**< (GMAC_PFR) Pause Frames Received Register Offset */
#define GMAC_BFR64_OFFSET            (0x168)        /**< (GMAC_BFR64) 64 Byte Frames Received Register Offset */
#define GMAC_TBFR127_OFFSET          (0x16C)        /**< (GMAC_TBFR127) 65 to 127 Byte Frames Received Register Offset */
#define GMAC_TBFR255_OFFSET          (0x170)        /**< (GMAC_TBFR255) 128 to 255 Byte Frames Received Register Offset */
#define GMAC_TBFR511_OFFSET          (0x174)        /**< (GMAC_TBFR511) 256 to 511 Byte Frames Received Register Offset */
#define GMAC_TBFR1023_OFFSET         (0x178)        /**< (GMAC_TBFR1023) 512 to 1023 Byte Frames Received Register Offset */
#define GMAC_TBFR1518_OFFSET         (0x17C)        /**< (GMAC_TBFR1518) 1024 to 1518 Byte Frames Received Register Offset */
#define GMAC_TMXBFR_OFFSET           (0x180)        /**< (GMAC_TMXBFR) 1519 to Maximum Byte Frames Received Register Offset */
#define GMAC_UFR_OFFSET              (0x184)        /**< (GMAC_UFR) Undersize Frames Received Register Offset */
#define GMAC_OFR_OFFSET              (0x188)        /**< (GMAC_OFR) Oversize Frames Received Register Offset */
#define GMAC_JR_OFFSET               (0x18C)        /**< (GMAC_JR) Jabbers Received Register Offset */
#define GMAC_FCSE_OFFSET             (0x190)        /**< (GMAC_FCSE) Frame Check Sequence Errors Register Offset */
#define GMAC_LFFE_OFFSET             (0x194)        /**< (GMAC_LFFE) Length Field Frame Errors Register Offset */
#define GMAC_RSE_OFFSET              (0x198)        /**< (GMAC_RSE) Receive Symbol Errors Register Offset */
#define GMAC_AE_OFFSET               (0x19C)        /**< (GMAC_AE) Alignment Errors Register Offset */
#define GMAC_RRE_OFFSET              (0x1A0)        /**< (GMAC_RRE) Receive Resource Errors Register Offset */
#define GMAC_ROE_OFFSET              (0x1A4)        /**< (GMAC_ROE) Receive Overrun Register Offset */
#define GMAC_IHCE_OFFSET             (0x1A8)        /**< (GMAC_IHCE) IP Header Checksum Errors Register Offset */
#define GMAC_TCE_OFFSET              (0x1AC)        /**< (GMAC_TCE) TCP Checksum Errors Register Offset */
#define GMAC_UCE_OFFSET              (0x1B0)        /**< (GMAC_UCE) UDP Checksum Errors Register Offset */
#define GMAC_TISUBN_OFFSET           (0x1BC)        /**< (GMAC_TISUBN) 1588 Timer Increment Sub-nanoseconds Register Offset */
#define GMAC_TSH_OFFSET              (0x1C0)        /**< (GMAC_TSH) 1588 Timer Seconds High Register Offset */
#define GMAC_TSL_OFFSET              (0x1D0)        /**< (GMAC_TSL) 1588 Timer Seconds Low Register Offset */
#define GMAC_TN_OFFSET               (0x1D4)        /**< (GMAC_TN) 1588 Timer Nanoseconds Register Offset */
#define GMAC_TA_OFFSET               (0x1D8)        /**< (GMAC_TA) 1588 Timer Adjust Register Offset */
#define GMAC_TI_OFFSET               (0x1DC)        /**< (GMAC_TI) 1588 Timer Increment Register Offset */
#define GMAC_EFTSL_OFFSET            (0x1E0)        /**< (GMAC_EFTSL) PTP Event Frame Transmitted Seconds Low Register Offset */
#define GMAC_EFTN_OFFSET             (0x1E4)        /**< (GMAC_EFTN) PTP Event Frame Transmitted Nanoseconds Register Offset */
#define GMAC_EFRSL_OFFSET            (0x1E8)        /**< (GMAC_EFRSL) PTP Event Frame Received Seconds Low Register Offset */
#define GMAC_EFRN_OFFSET             (0x1EC)        /**< (GMAC_EFRN) PTP Event Frame Received Nanoseconds Register Offset */
#define GMAC_PEFTSL_OFFSET           (0x1F0)        /**< (GMAC_PEFTSL) PTP Peer Event Frame Transmitted Seconds Low Register Offset */
#define GMAC_PEFTN_OFFSET            (0x1F4)        /**< (GMAC_PEFTN) PTP Peer Event Frame Transmitted Nanoseconds Register Offset */
#define GMAC_PEFRSL_OFFSET           (0x1F8)        /**< (GMAC_PEFRSL) PTP Peer Event Frame Received Seconds Low Register Offset */
#define GMAC_PEFRN_OFFSET            (0x1FC)        /**< (GMAC_PEFRN) PTP Peer Event Frame Received Nanoseconds Register Offset */
#define GMAC_RXLPI_OFFSET            (0x270)        /**< (GMAC_RXLPI) Received LPI Transitions Offset */
#define GMAC_RXLPITIME_OFFSET        (0x274)        /**< (GMAC_RXLPITIME) Received LPI Time Offset */
#define GMAC_TXLPI_OFFSET            (0x278)        /**< (GMAC_TXLPI) Transmit LPI Transitions Offset */
#define GMAC_TXLPITIME_OFFSET        (0x27C)        /**< (GMAC_TXLPITIME) Transmit LPI Time Offset */
#define GMAC_ISRPQ_OFFSET            (0x400)        /**< (GMAC_ISRPQ) Interrupt Status Register Priority Queue (index = 1) 0 Offset */
#define GMAC_TBQBAPQ_OFFSET          (0x440)        /**< (GMAC_TBQBAPQ) Transmit Buffer Queue Base Address Register Priority Queue (index = 1) 0 Offset */
#define GMAC_RBQBAPQ_OFFSET          (0x480)        /**< (GMAC_RBQBAPQ) Receive Buffer Queue Base Address Register Priority Queue (index = 1) 0 Offset */
#define GMAC_RBSRPQ_OFFSET           (0x4A0)        /**< (GMAC_RBSRPQ) Receive Buffer Size Register Priority Queue (index = 1) 0 Offset */
#define GMAC_CBSCR_OFFSET            (0x4BC)        /**< (GMAC_CBSCR) Credit-Based Shaping Control Register Offset */
#define GMAC_CBSISQA_OFFSET          (0x4C0)        /**< (GMAC_CBSISQA) Credit-Based Shaping IdleSlope Register for Queue A Offset */
#define GMAC_CBSISQB_OFFSET          (0x4C4)        /**< (GMAC_CBSISQB) Credit-Based Shaping IdleSlope Register for Queue B Offset */
#define GMAC_ST1RPQ_OFFSET           (0x500)        /**< (GMAC_ST1RPQ) Screening Type 1 Register Priority Queue (index = 0) 0 Offset */
#define GMAC_ST2RPQ_OFFSET           (0x540)        /**< (GMAC_ST2RPQ) Screening Type 2 Register Priority Queue (index = 0) 0 Offset */
#define GMAC_IERPQ_OFFSET            (0x600)        /**< (GMAC_IERPQ) Interrupt Enable Register Priority Queue (index = 1) 0 Offset */
#define GMAC_IDRPQ_OFFSET            (0x620)        /**< (GMAC_IDRPQ) Interrupt Disable Register Priority Queue (index = 1) 0 Offset */
#define GMAC_IMRPQ_OFFSET            (0x640)        /**< (GMAC_IMRPQ) Interrupt Mask Register Priority Queue (index = 1) 0 Offset */
#define GMAC_ST2ER_OFFSET            (0x6E0)        /**< (GMAC_ST2ER) Screening Type 2 Ethertype Register (index = 0) 0 Offset */
#define GMAC_ST2CW00_OFFSET          (0x700)        /**< (GMAC_ST2CW00) Screening Type 2 Compare Word 0 Register (index = 0) Offset */
#define GMAC_ST2CW10_OFFSET          (0x704)        /**< (GMAC_ST2CW10) Screening Type 2 Compare Word 1 Register (index = 0) Offset */
#define GMAC_ST2CW01_OFFSET          (0x708)        /**< (GMAC_ST2CW01) Screening Type 2 Compare Word 0 Register (index = 1) Offset */
#define GMAC_ST2CW11_OFFSET          (0x70C)        /**< (GMAC_ST2CW11) Screening Type 2 Compare Word 1 Register (index = 1) Offset */
#define GMAC_ST2CW02_OFFSET          (0x710)        /**< (GMAC_ST2CW02) Screening Type 2 Compare Word 0 Register (index = 2) Offset */
#define GMAC_ST2CW12_OFFSET          (0x714)        /**< (GMAC_ST2CW12) Screening Type 2 Compare Word 1 Register (index = 2) Offset */
#define GMAC_ST2CW03_OFFSET          (0x718)        /**< (GMAC_ST2CW03) Screening Type 2 Compare Word 0 Register (index = 3) Offset */
#define GMAC_ST2CW13_OFFSET          (0x71C)        /**< (GMAC_ST2CW13) Screening Type 2 Compare Word 1 Register (index = 3) Offset */
#define GMAC_ST2CW04_OFFSET          (0x720)        /**< (GMAC_ST2CW04) Screening Type 2 Compare Word 0 Register (index = 4) Offset */
#define GMAC_ST2CW14_OFFSET          (0x724)        /**< (GMAC_ST2CW14) Screening Type 2 Compare Word 1 Register (index = 4) Offset */
#define GMAC_ST2CW05_OFFSET          (0x728)        /**< (GMAC_ST2CW05) Screening Type 2 Compare Word 0 Register (index = 5) Offset */
#define GMAC_ST2CW15_OFFSET          (0x72C)        /**< (GMAC_ST2CW15) Screening Type 2 Compare Word 1 Register (index = 5) Offset */
#define GMAC_ST2CW06_OFFSET          (0x730)        /**< (GMAC_ST2CW06) Screening Type 2 Compare Word 0 Register (index = 6) Offset */
#define GMAC_ST2CW16_OFFSET          (0x734)        /**< (GMAC_ST2CW16) Screening Type 2 Compare Word 1 Register (index = 6) Offset */
#define GMAC_ST2CW07_OFFSET          (0x738)        /**< (GMAC_ST2CW07) Screening Type 2 Compare Word 0 Register (index = 7) Offset */
#define GMAC_ST2CW17_OFFSET          (0x73C)        /**< (GMAC_ST2CW17) Screening Type 2 Compare Word 1 Register (index = 7) Offset */
#define GMAC_ST2CW08_OFFSET          (0x740)        /**< (GMAC_ST2CW08) Screening Type 2 Compare Word 0 Register (index = 8) Offset */
#define GMAC_ST2CW18_OFFSET          (0x744)        /**< (GMAC_ST2CW18) Screening Type 2 Compare Word 1 Register (index = 8) Offset */
#define GMAC_ST2CW09_OFFSET          (0x748)        /**< (GMAC_ST2CW09) Screening Type 2 Compare Word 0 Register (index = 9) Offset */
#define GMAC_ST2CW19_OFFSET          (0x74C)        /**< (GMAC_ST2CW19) Screening Type 2 Compare Word 1 Register (index = 9) Offset */
#define GMAC_ST2CW010_OFFSET         (0x750)        /**< (GMAC_ST2CW010) Screening Type 2 Compare Word 0 Register (index = 10) Offset */
#define GMAC_ST2CW110_OFFSET         (0x754)        /**< (GMAC_ST2CW110) Screening Type 2 Compare Word 1 Register (index = 10) Offset */
#define GMAC_ST2CW011_OFFSET         (0x758)        /**< (GMAC_ST2CW011) Screening Type 2 Compare Word 0 Register (index = 11) Offset */
#define GMAC_ST2CW111_OFFSET         (0x75C)        /**< (GMAC_ST2CW111) Screening Type 2 Compare Word 1 Register (index = 11) Offset */
#define GMAC_ST2CW012_OFFSET         (0x760)        /**< (GMAC_ST2CW012) Screening Type 2 Compare Word 0 Register (index = 12) Offset */
#define GMAC_ST2CW112_OFFSET         (0x764)        /**< (GMAC_ST2CW112) Screening Type 2 Compare Word 1 Register (index = 12) Offset */
#define GMAC_ST2CW013_OFFSET         (0x768)        /**< (GMAC_ST2CW013) Screening Type 2 Compare Word 0 Register (index = 13) Offset */
#define GMAC_ST2CW113_OFFSET         (0x76C)        /**< (GMAC_ST2CW113) Screening Type 2 Compare Word 1 Register (index = 13) Offset */
#define GMAC_ST2CW014_OFFSET         (0x770)        /**< (GMAC_ST2CW014) Screening Type 2 Compare Word 0 Register (index = 14) Offset */
#define GMAC_ST2CW114_OFFSET         (0x774)        /**< (GMAC_ST2CW114) Screening Type 2 Compare Word 1 Register (index = 14) Offset */
#define GMAC_ST2CW015_OFFSET         (0x778)        /**< (GMAC_ST2CW015) Screening Type 2 Compare Word 0 Register (index = 15) Offset */
#define GMAC_ST2CW115_OFFSET         (0x77C)        /**< (GMAC_ST2CW115) Screening Type 2 Compare Word 1 Register (index = 15) Offset */
#define GMAC_ST2CW016_OFFSET         (0x780)        /**< (GMAC_ST2CW016) Screening Type 2 Compare Word 0 Register (index = 16) Offset */
#define GMAC_ST2CW116_OFFSET         (0x784)        /**< (GMAC_ST2CW116) Screening Type 2 Compare Word 1 Register (index = 16) Offset */
#define GMAC_ST2CW017_OFFSET         (0x788)        /**< (GMAC_ST2CW017) Screening Type 2 Compare Word 0 Register (index = 17) Offset */
#define GMAC_ST2CW117_OFFSET         (0x78C)        /**< (GMAC_ST2CW117) Screening Type 2 Compare Word 1 Register (index = 17) Offset */
#define GMAC_ST2CW018_OFFSET         (0x790)        /**< (GMAC_ST2CW018) Screening Type 2 Compare Word 0 Register (index = 18) Offset */
#define GMAC_ST2CW118_OFFSET         (0x794)        /**< (GMAC_ST2CW118) Screening Type 2 Compare Word 1 Register (index = 18) Offset */
#define GMAC_ST2CW019_OFFSET         (0x798)        /**< (GMAC_ST2CW019) Screening Type 2 Compare Word 0 Register (index = 19) Offset */
#define GMAC_ST2CW119_OFFSET         (0x79C)        /**< (GMAC_ST2CW119) Screening Type 2 Compare Word 1 Register (index = 19) Offset */
#define GMAC_ST2CW020_OFFSET         (0x7A0)        /**< (GMAC_ST2CW020) Screening Type 2 Compare Word 0 Register (index = 20) Offset */
#define GMAC_ST2CW120_OFFSET         (0x7A4)        /**< (GMAC_ST2CW120) Screening Type 2 Compare Word 1 Register (index = 20) Offset */
#define GMAC_ST2CW021_OFFSET         (0x7A8)        /**< (GMAC_ST2CW021) Screening Type 2 Compare Word 0 Register (index = 21) Offset */
#define GMAC_ST2CW121_OFFSET         (0x7AC)        /**< (GMAC_ST2CW121) Screening Type 2 Compare Word 1 Register (index = 21) Offset */
#define GMAC_ST2CW022_OFFSET         (0x7B0)        /**< (GMAC_ST2CW022) Screening Type 2 Compare Word 0 Register (index = 22) Offset */
#define GMAC_ST2CW122_OFFSET         (0x7B4)        /**< (GMAC_ST2CW122) Screening Type 2 Compare Word 1 Register (index = 22) Offset */
