zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/gmac.h
#define GMAC_ST2CW023_OFFSET         (0x7B8)        /**< (GMAC_ST2CW023) Screening Type 2 Compare Word 0 Register (index = 23) Offset */
#define GMAC_ST2CW123_OFFSET         (0x7BC)        /**< (GMAC_ST2CW123) Screening Type 2 Compare Word 1 Register (index = 23) Offset */

/** \brief GMAC_SA register API structure */
typedef struct
{
  __IO  __GMAC_SAB_bits_t              GMAC_SAB;      /**< Offset: 0x00 (R/W  32) Specific Address 1 Bottom Register */
  __IO  __GMAC_SAT_bits_t              GMAC_SAT;      /**< Offset: 0x04 (R/W  32) Specific Address 1 Top Register */
} gmacsa_registers_t;

#define GMACSA_NUMBER 4
/** \brief GMAC register API structure */
typedef struct
{
  __IO  __GMAC_NCR_bits_t              GMAC_NCR;      /**< Offset: 0x00 (R/W  32) Network Control Register */
  __IO  __GMAC_NCFGR_bits_t            GMAC_NCFGR;    /**< Offset: 0x04 (R/W  32) Network Configuration Register */
  __I   __GMAC_NSR_bits_t              GMAC_NSR;      /**< Offset: 0x08 (R/   32) Network Status Register */
  __IO  __GMAC_UR_bits_t               GMAC_UR;       /**< Offset: 0x0C (R/W  32) User Register */
  __IO  __GMAC_DCFGR_bits_t            GMAC_DCFGR;    /**< Offset: 0x10 (R/W  32) DMA Configuration Register */
  __IO  __GMAC_TSR_bits_t              GMAC_TSR;      /**< Offset: 0x14 (R/W  32) Transmit Status Register */
  __IO  __GMAC_RBQB_bits_t             GMAC_RBQB;     /**< Offset: 0x18 (R/W  32) Receive Buffer Queue Base Address Register */
  __IO  __GMAC_TBQB_bits_t             GMAC_TBQB;     /**< Offset: 0x1C (R/W  32) Transmit Buffer Queue Base Address Register */
  __IO  __GMAC_RSR_bits_t              GMAC_RSR;      /**< Offset: 0x20 (R/W  32) Receive Status Register */
  __I   __GMAC_ISR_bits_t              GMAC_ISR;      /**< Offset: 0x24 (R/   32) Interrupt Status Register */
  __O   __GMAC_IER_bits_t              GMAC_IER;      /**< Offset: 0x28 ( /W  32) Interrupt Enable Register */
  __O   __GMAC_IDR_bits_t              GMAC_IDR;      /**< Offset: 0x2C ( /W  32) Interrupt Disable Register */
  __IO  __GMAC_IMR_bits_t              GMAC_IMR;      /**< Offset: 0x30 (R/W  32) Interrupt Mask Register */
  __IO  __GMAC_MAN_bits_t              GMAC_MAN;      /**< Offset: 0x34 (R/W  32) PHY Maintenance Register */
  __I   __GMAC_RPQ_bits_t              GMAC_RPQ;      /**< Offset: 0x38 (R/   32) Received Pause Quantum Register */
  __IO  __GMAC_TPQ_bits_t              GMAC_TPQ;      /**< Offset: 0x3C (R/W  32) Transmit Pause Quantum Register */
  __IO  __GMAC_TPSF_bits_t             GMAC_TPSF;     /**< Offset: 0x40 (R/W  32) TX Partial Store and Forward Register */
  __IO  __GMAC_RPSF_bits_t             GMAC_RPSF;     /**< Offset: 0x44 (R/W  32) RX Partial Store and Forward Register */
  __IO  __GMAC_RJFML_bits_t            GMAC_RJFML;    /**< Offset: 0x48 (R/W  32) RX Jumbo Frame Max Length Register */
  __I   uint8_t                        Reserved1[0x34];
  __IO  __GMAC_HRB_bits_t              GMAC_HRB;      /**< Offset: 0x80 (R/W  32) Hash Register Bottom */
  __IO  __GMAC_HRT_bits_t              GMAC_HRT;      /**< Offset: 0x84 (R/W  32) Hash Register Top */
        gmacsa_registers_t             GMAC_SA[GMACSA_NUMBER]; /**< Offset: 0x88 Specific Address 1 Bottom Register */
  __IO  __GMAC_TIDM1_bits_t            GMAC_TIDM1;    /**< Offset: 0xA8 (R/W  32) Type ID Match 1 Register */
  __IO  __GMAC_TIDM2_bits_t            GMAC_TIDM2;    /**< Offset: 0xAC (R/W  32) Type ID Match 2 Register */
  __IO  __GMAC_TIDM3_bits_t            GMAC_TIDM3;    /**< Offset: 0xB0 (R/W  32) Type ID Match 3 Register */
  __IO  __GMAC_TIDM4_bits_t            GMAC_TIDM4;    /**< Offset: 0xB4 (R/W  32) Type ID Match 4 Register */
  __IO  __GMAC_WOL_bits_t              GMAC_WOL;      /**< Offset: 0xB8 (R/W  32) Wake on LAN Register */
  __IO  __GMAC_IPGS_bits_t             GMAC_IPGS;     /**< Offset: 0xBC (R/W  32) IPG Stretch Register */
  __IO  __GMAC_SVLAN_bits_t            GMAC_SVLAN;    /**< Offset: 0xC0 (R/W  32) Stacked VLAN Register */
  __IO  __GMAC_TPFCP_bits_t            GMAC_TPFCP;    /**< Offset: 0xC4 (R/W  32) Transmit PFC Pause Register */
  __IO  __GMAC_SAMB1_bits_t            GMAC_SAMB1;    /**< Offset: 0xC8 (R/W  32) Specific Address 1 Mask Bottom Register */
  __IO  __GMAC_SAMT1_bits_t            GMAC_SAMT1;    /**< Offset: 0xCC (R/W  32) Specific Address 1 Mask Top Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  __GMAC_NSC_bits_t              GMAC_NSC;      /**< Offset: 0xDC (R/W  32) 1588 Timer Nanosecond Comparison Register */
  __IO  __GMAC_SCL_bits_t              GMAC_SCL;      /**< Offset: 0xE0 (R/W  32) 1588 Timer Second Comparison Low Register */
  __IO  __GMAC_SCH_bits_t              GMAC_SCH;      /**< Offset: 0xE4 (R/W  32) 1588 Timer Second Comparison High Register */
  __I   __GMAC_EFTSH_bits_t            GMAC_EFTSH;    /**< Offset: 0xE8 (R/   32) PTP Event Frame Transmitted Seconds High Register */
  __I   __GMAC_EFRSH_bits_t            GMAC_EFRSH;    /**< Offset: 0xEC (R/   32) PTP Event Frame Received Seconds High Register */
  __I   __GMAC_PEFTSH_bits_t           GMAC_PEFTSH;   /**< Offset: 0xF0 (R/   32) PTP Peer Event Frame Transmitted Seconds High Register */
  __I   __GMAC_PEFRSH_bits_t           GMAC_PEFRSH;   /**< Offset: 0xF4 (R/   32) PTP Peer Event Frame Received Seconds High Register */
  __I   uint8_t                        Reserved3[0x04];
  __I   __GMAC_MID_bits_t              GMAC_MID;      /**< Offset: 0xFC (R/   32) Module ID Register */
  __I   __GMAC_OTLO_bits_t             GMAC_OTLO;     /**< Offset: 0x100 (R/   32) Octets Transmitted Low Register */
  __I   __GMAC_OTHI_bits_t             GMAC_OTHI;     /**< Offset: 0x104 (R/   32) Octets Transmitted High Register */
  __I   __GMAC_FT_bits_t               GMAC_FT;       /**< Offset: 0x108 (R/   32) Frames Transmitted Register */
  __I   __GMAC_BCFT_bits_t             GMAC_BCFT;     /**< Offset: 0x10C (R/   32) Broadcast Frames Transmitted Register */
  __I   __GMAC_MFT_bits_t              GMAC_MFT;      /**< Offset: 0x110 (R/   32) Multicast Frames Transmitted Register */
  __I   __GMAC_PFT_bits_t              GMAC_PFT;      /**< Offset: 0x114 (R/   32) Pause Frames Transmitted Register */
  __I   __GMAC_BFT64_bits_t            GMAC_BFT64;    /**< Offset: 0x118 (R/   32) 64 Byte Frames Transmitted Register */
  __I   __GMAC_TBFT127_bits_t          GMAC_TBFT127;  /**< Offset: 0x11C (R/   32) 65 to 127 Byte Frames Transmitted Register */
  __I   __GMAC_TBFT255_bits_t          GMAC_TBFT255;  /**< Offset: 0x120 (R/   32) 128 to 255 Byte Frames Transmitted Register */
  __I   __GMAC_TBFT511_bits_t          GMAC_TBFT511;  /**< Offset: 0x124 (R/   32) 256 to 511 Byte Frames Transmitted Register */
  __I   __GMAC_TBFT1023_bits_t         GMAC_TBFT1023; /**< Offset: 0x128 (R/   32) 512 to 1023 Byte Frames Transmitted Register */
  __I   __GMAC_TBFT1518_bits_t         GMAC_TBFT1518; /**< Offset: 0x12C (R/   32) 1024 to 1518 Byte Frames Transmitted Register */
  __I   __GMAC_GTBFT1518_bits_t        GMAC_GTBFT1518; /**< Offset: 0x130 (R/   32) Greater Than 1518 Byte Frames Transmitted Register */
  __I   __GMAC_TUR_bits_t              GMAC_TUR;      /**< Offset: 0x134 (R/   32) Transmit Underruns Register */
  __I   __GMAC_SCF_bits_t              GMAC_SCF;      /**< Offset: 0x138 (R/   32) Single Collision Frames Register */
  __I   __GMAC_MCF_bits_t              GMAC_MCF;      /**< Offset: 0x13C (R/   32) Multiple Collision Frames Register */
  __I   __GMAC_EC_bits_t               GMAC_EC;       /**< Offset: 0x140 (R/   32) Excessive Collisions Register */
  __I   __GMAC_LC_bits_t               GMAC_LC;       /**< Offset: 0x144 (R/   32) Late Collisions Register */
  __I   __GMAC_DTF_bits_t              GMAC_DTF;      /**< Offset: 0x148 (R/   32) Deferred Transmission Frames Register */
  __I   __GMAC_CSE_bits_t              GMAC_CSE;      /**< Offset: 0x14C (R/   32) Carrier Sense Errors Register */
  __I   __GMAC_ORLO_bits_t             GMAC_ORLO;     /**< Offset: 0x150 (R/   32) Octets Received Low Received Register */
  __I   __GMAC_ORHI_bits_t             GMAC_ORHI;     /**< Offset: 0x154 (R/   32) Octets Received High Received Register */
  __I   __GMAC_FR_bits_t               GMAC_FR;       /**< Offset: 0x158 (R/   32) Frames Received Register */
  __I   __GMAC_BCFR_bits_t             GMAC_BCFR;     /**< Offset: 0x15C (R/   32) Broadcast Frames Received Register */
  __I   __GMAC_MFR_bits_t              GMAC_MFR;      /**< Offset: 0x160 (R/   32) Multicast Frames Received Register */
  __I   __GMAC_PFR_bits_t              GMAC_PFR;      /**< Offset: 0x164 (R/   32) Pause Frames Received Register */
  __I   __GMAC_BFR64_bits_t            GMAC_BFR64;    /**< Offset: 0x168 (R/   32) 64 Byte Frames Received Register */
  __I   __GMAC_TBFR127_bits_t          GMAC_TBFR127;  /**< Offset: 0x16C (R/   32) 65 to 127 Byte Frames Received Register */
  __I   __GMAC_TBFR255_bits_t          GMAC_TBFR255;  /**< Offset: 0x170 (R/   32) 128 to 255 Byte Frames Received Register */
  __I   __GMAC_TBFR511_bits_t          GMAC_TBFR511;  /**< Offset: 0x174 (R/   32) 256 to 511 Byte Frames Received Register */
  __I   __GMAC_TBFR1023_bits_t         GMAC_TBFR1023; /**< Offset: 0x178 (R/   32) 512 to 1023 Byte Frames Received Register */
  __I   __GMAC_TBFR1518_bits_t         GMAC_TBFR1518; /**< Offset: 0x17C (R/   32) 1024 to 1518 Byte Frames Received Register */
  __I   __GMAC_TMXBFR_bits_t           GMAC_TMXBFR;   /**< Offset: 0x180 (R/   32) 1519 to Maximum Byte Frames Received Register */
  __I   __GMAC_UFR_bits_t              GMAC_UFR;      /**< Offset: 0x184 (R/   32) Undersize Frames Received Register */
  __I   __GMAC_OFR_bits_t              GMAC_OFR;      /**< Offset: 0x188 (R/   32) Oversize Frames Received Register */
  __I   __GMAC_JR_bits_t               GMAC_JR;       /**< Offset: 0x18C (R/   32) Jabbers Received Register */
  __I   __GMAC_FCSE_bits_t             GMAC_FCSE;     /**< Offset: 0x190 (R/   32) Frame Check Sequence Errors Register */
  __I   __GMAC_LFFE_bits_t             GMAC_LFFE;     /**< Offset: 0x194 (R/   32) Length Field Frame Errors Register */
  __I   __GMAC_RSE_bits_t              GMAC_RSE;      /**< Offset: 0x198 (R/   32) Receive Symbol Errors Register */
  __I   __GMAC_AE_bits_t               GMAC_AE;       /**< Offset: 0x19C (R/   32) Alignment Errors Register */
  __I   __GMAC_RRE_bits_t              GMAC_RRE;      /**< Offset: 0x1A0 (R/   32) Receive Resource Errors Register */
  __I   __GMAC_ROE_bits_t              GMAC_ROE;      /**< Offset: 0x1A4 (R/   32) Receive Overrun Register */
  __I   __GMAC_IHCE_bits_t             GMAC_IHCE;     /**< Offset: 0x1A8 (R/   32) IP Header Checksum Errors Register */
  __I   __GMAC_TCE_bits_t              GMAC_TCE;      /**< Offset: 0x1AC (R/   32) TCP Checksum Errors Register */
  __I   __GMAC_UCE_bits_t              GMAC_UCE;      /**< Offset: 0x1B0 (R/   32) UDP Checksum Errors Register */
  __I   uint8_t                        Reserved4[0x08];
  __IO  __GMAC_TISUBN_bits_t           GMAC_TISUBN;   /**< Offset: 0x1BC (R/W  32) 1588 Timer Increment Sub-nanoseconds Register */
  __IO  __GMAC_TSH_bits_t              GMAC_TSH;      /**< Offset: 0x1C0 (R/W  32) 1588 Timer Seconds High Register */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  __GMAC_TSL_bits_t              GMAC_TSL;      /**< Offset: 0x1D0 (R/W  32) 1588 Timer Seconds Low Register */
  __IO  __GMAC_TN_bits_t               GMAC_TN;       /**< Offset: 0x1D4 (R/W  32) 1588 Timer Nanoseconds Register */
  __O   __GMAC_TA_bits_t               GMAC_TA;       /**< Offset: 0x1D8 ( /W  32) 1588 Timer Adjust Register */
  __IO  __GMAC_TI_bits_t               GMAC_TI;       /**< Offset: 0x1DC (R/W  32) 1588 Timer Increment Register */
  __I   __GMAC_EFTSL_bits_t            GMAC_EFTSL;    /**< Offset: 0x1E0 (R/   32) PTP Event Frame Transmitted Seconds Low Register */
  __I   __GMAC_EFTN_bits_t             GMAC_EFTN;     /**< Offset: 0x1E4 (R/   32) PTP Event Frame Transmitted Nanoseconds Register */
  __I   __GMAC_EFRSL_bits_t            GMAC_EFRSL;    /**< Offset: 0x1E8 (R/   32) PTP Event Frame Received Seconds Low Register */
  __I   __GMAC_EFRN_bits_t             GMAC_EFRN;     /**< Offset: 0x1EC (R/   32) PTP Event Frame Received Nanoseconds Register */
  __I   __GMAC_PEFTSL_bits_t           GMAC_PEFTSL;   /**< Offset: 0x1F0 (R/   32) PTP Peer Event Frame Transmitted Seconds Low Register */
  __I   __GMAC_PEFTN_bits_t            GMAC_PEFTN;    /**< Offset: 0x1F4 (R/   32) PTP Peer Event Frame Transmitted Nanoseconds Register */
  __I   __GMAC_PEFRSL_bits_t           GMAC_PEFRSL;   /**< Offset: 0x1F8 (R/   32) PTP Peer Event Frame Received Seconds Low Register */
  __I   __GMAC_PEFRN_bits_t            GMAC_PEFRN;    /**< Offset: 0x1FC (R/   32) PTP Peer Event Frame Received Nanoseconds Register */
  __I   uint8_t                        Reserved6[0x70];
  __I   __GMAC_RXLPI_bits_t            GMAC_RXLPI;    /**< Offset: 0x270 (R/   32) Received LPI Transitions */
  __I   __GMAC_RXLPITIME_bits_t        GMAC_RXLPITIME; /**< Offset: 0x274 (R/   32) Received LPI Time */
  __I   __GMAC_TXLPI_bits_t            GMAC_TXLPI;    /**< Offset: 0x278 (R/   32) Transmit LPI Transitions */
  __I   __GMAC_TXLPITIME_bits_t        GMAC_TXLPITIME; /**< Offset: 0x27C (R/   32) Transmit LPI Time */
  __I   uint8_t                        Reserved7[0x180];
  __I   __GMAC_ISRPQ_bits_t            GMAC_ISRPQ[5]; /**< Offset: 0x400 (R/   32) Interrupt Status Register Priority Queue (index = 1) 0 */
  __I   uint8_t                        Reserved8[0x2C];
  __IO  __GMAC_TBQBAPQ_bits_t          GMAC_TBQBAPQ[5]; /**< Offset: 0x440 (R/W  32) Transmit Buffer Queue Base Address Register Priority Queue (index = 1) 0 */
  __I   uint8_t                        Reserved9[0x2C];
  __IO  __GMAC_RBQBAPQ_bits_t          GMAC_RBQBAPQ[5]; /**< Offset: 0x480 (R/W  32) Receive Buffer Queue Base Address Register Priority Queue (index = 1) 0 */
  __I   uint8_t                        Reserved10[0x0C];
  __IO  __GMAC_RBSRPQ_bits_t           GMAC_RBSRPQ[5]; /**< Offset: 0x4A0 (R/W  32) Receive Buffer Size Register Priority Queue (index = 1) 0 */
  __I   uint8_t                        Reserved11[0x08];
  __IO  __GMAC_CBSCR_bits_t            GMAC_CBSCR;    /**< Offset: 0x4BC (R/W  32) Credit-Based Shaping Control Register */
  __IO  __GMAC_CBSISQA_bits_t          GMAC_CBSISQA;  /**< Offset: 0x4C0 (R/W  32) Credit-Based Shaping IdleSlope Register for Queue A */
  __IO  __GMAC_CBSISQB_bits_t          GMAC_CBSISQB;  /**< Offset: 0x4C4 (R/W  32) Credit-Based Shaping IdleSlope Register for Queue B */
  __I   uint8_t                        Reserved12[0x38];
  __IO  __GMAC_ST1RPQ_bits_t           GMAC_ST1RPQ[4]; /**< Offset: 0x500 (R/W  32) Screening Type 1 Register Priority Queue (index = 0) 0 */
  __I   uint8_t                        Reserved13[0x30];
  __IO  __GMAC_ST2RPQ_bits_t           GMAC_ST2RPQ[8]; /**< Offset: 0x540 (R/W  32) Screening Type 2 Register Priority Queue (index = 0) 0 */
  __I   uint8_t                        Reserved14[0xA0];
  __O   __GMAC_IERPQ_bits_t            GMAC_IERPQ[5]; /**< Offset: 0x600 ( /W  32) Interrupt Enable Register Priority Queue (index = 1) 0 */
  __I   uint8_t                        Reserved15[0x0C];
  __O   __GMAC_IDRPQ_bits_t            GMAC_IDRPQ[5]; /**< Offset: 0x620 ( /W  32) Interrupt Disable Register Priority Queue (index = 1) 0 */
  __I   uint8_t                        Reserved16[0x0C];
  __IO  __GMAC_IMRPQ_bits_t            GMAC_IMRPQ[5]; /**< Offset: 0x640 (R/W  32) Interrupt Mask Register Priority Queue (index = 1) 0 */
  __I   uint8_t                        Reserved17[0x8C];
  __IO  __GMAC_ST2ER_bits_t            GMAC_ST2ER[4]; /**< Offset: 0x6E0 (R/W  32) Screening Type 2 Ethertype Register (index = 0) 0 */
  __I   uint8_t                        Reserved18[0x10];
  __IO  __GMAC_ST2CW00_bits_t          GMAC_ST2CW00;  /**< Offset: 0x700 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 0) */
  __IO  __GMAC_ST2CW10_bits_t          GMAC_ST2CW10;  /**< Offset: 0x704 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 0) */
  __IO  __GMAC_ST2CW01_bits_t          GMAC_ST2CW01;  /**< Offset: 0x708 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 1) */
  __IO  __GMAC_ST2CW11_bits_t          GMAC_ST2CW11;  /**< Offset: 0x70C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 1) */
  __IO  __GMAC_ST2CW02_bits_t          GMAC_ST2CW02;  /**< Offset: 0x710 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 2) */
  __IO  __GMAC_ST2CW12_bits_t          GMAC_ST2CW12;  /**< Offset: 0x714 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 2) */
  __IO  __GMAC_ST2CW03_bits_t          GMAC_ST2CW03;  /**< Offset: 0x718 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 3) */
  __IO  __GMAC_ST2CW13_bits_t          GMAC_ST2CW13;  /**< Offset: 0x71C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 3) */
  __IO  __GMAC_ST2CW04_bits_t          GMAC_ST2CW04;  /**< Offset: 0x720 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 4) */
  __IO  __GMAC_ST2CW14_bits_t          GMAC_ST2CW14;  /**< Offset: 0x724 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 4) */
  __IO  __GMAC_ST2CW05_bits_t          GMAC_ST2CW05;  /**< Offset: 0x728 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 5) */
  __IO  __GMAC_ST2CW15_bits_t          GMAC_ST2CW15;  /**< Offset: 0x72C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 5) */
  __IO  __GMAC_ST2CW06_bits_t          GMAC_ST2CW06;  /**< Offset: 0x730 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 6) */
  __IO  __GMAC_ST2CW16_bits_t          GMAC_ST2CW16;  /**< Offset: 0x734 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 6) */
  __IO  __GMAC_ST2CW07_bits_t          GMAC_ST2CW07;  /**< Offset: 0x738 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 7) */
  __IO  __GMAC_ST2CW17_bits_t          GMAC_ST2CW17;  /**< Offset: 0x73C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 7) */
  __IO  __GMAC_ST2CW08_bits_t          GMAC_ST2CW08;  /**< Offset: 0x740 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 8) */
  __IO  __GMAC_ST2CW18_bits_t          GMAC_ST2CW18;  /**< Offset: 0x744 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 8) */
  __IO  __GMAC_ST2CW09_bits_t          GMAC_ST2CW09;  /**< Offset: 0x748 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 9) */
  __IO  __GMAC_ST2CW19_bits_t          GMAC_ST2CW19;  /**< Offset: 0x74C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 9) */
  __IO  __GMAC_ST2CW010_bits_t         GMAC_ST2CW010; /**< Offset: 0x750 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 10) */
  __IO  __GMAC_ST2CW110_bits_t         GMAC_ST2CW110; /**< Offset: 0x754 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 10) */
  __IO  __GMAC_ST2CW011_bits_t         GMAC_ST2CW011; /**< Offset: 0x758 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 11) */
  __IO  __GMAC_ST2CW111_bits_t         GMAC_ST2CW111; /**< Offset: 0x75C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 11) */
  __IO  __GMAC_ST2CW012_bits_t         GMAC_ST2CW012; /**< Offset: 0x760 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 12) */
  __IO  __GMAC_ST2CW112_bits_t         GMAC_ST2CW112; /**< Offset: 0x764 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 12) */
  __IO  __GMAC_ST2CW013_bits_t         GMAC_ST2CW013; /**< Offset: 0x768 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 13) */
  __IO  __GMAC_ST2CW113_bits_t         GMAC_ST2CW113; /**< Offset: 0x76C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 13) */
  __IO  __GMAC_ST2CW014_bits_t         GMAC_ST2CW014; /**< Offset: 0x770 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 14) */
  __IO  __GMAC_ST2CW114_bits_t         GMAC_ST2CW114; /**< Offset: 0x774 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 14) */
  __IO  __GMAC_ST2CW015_bits_t         GMAC_ST2CW015; /**< Offset: 0x778 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 15) */
  __IO  __GMAC_ST2CW115_bits_t         GMAC_ST2CW115; /**< Offset: 0x77C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 15) */
  __IO  __GMAC_ST2CW016_bits_t         GMAC_ST2CW016; /**< Offset: 0x780 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 16) */
  __IO  __GMAC_ST2CW116_bits_t         GMAC_ST2CW116; /**< Offset: 0x784 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 16) */
  __IO  __GMAC_ST2CW017_bits_t         GMAC_ST2CW017; /**< Offset: 0x788 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 17) */
  __IO  __GMAC_ST2CW117_bits_t         GMAC_ST2CW117; /**< Offset: 0x78C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 17) */
  __IO  __GMAC_ST2CW018_bits_t         GMAC_ST2CW018; /**< Offset: 0x790 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 18) */
  __IO  __GMAC_ST2CW118_bits_t         GMAC_ST2CW118; /**< Offset: 0x794 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 18) */
  __IO  __GMAC_ST2CW019_bits_t         GMAC_ST2CW019; /**< Offset: 0x798 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 19) */
  __IO  __GMAC_ST2CW119_bits_t         GMAC_ST2CW119; /**< Offset: 0x79C (R/W  32) Screening Type 2 Compare Word 1 Register (index = 19) */
  __IO  __GMAC_ST2CW020_bits_t         GMAC_ST2CW020; /**< Offset: 0x7A0 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 20) */
  __IO  __GMAC_ST2CW120_bits_t         GMAC_ST2CW120; /**< Offset: 0x7A4 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 20) */
  __IO  __GMAC_ST2CW021_bits_t         GMAC_ST2CW021; /**< Offset: 0x7A8 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 21) */
  __IO  __GMAC_ST2CW121_bits_t         GMAC_ST2CW121; /**< Offset: 0x7AC (R/W  32) Screening Type 2 Compare Word 1 Register (index = 21) */
  __IO  __GMAC_ST2CW022_bits_t         GMAC_ST2CW022; /**< Offset: 0x7B0 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 22) */
  __IO  __GMAC_ST2CW122_bits_t         GMAC_ST2CW122; /**< Offset: 0x7B4 (R/W  32) Screening Type 2 Compare Word 1 Register (index = 22) */
  __IO  __GMAC_ST2CW023_bits_t         GMAC_ST2CW023; /**< Offset: 0x7B8 (R/W  32) Screening Type 2 Compare Word 0 Register (index = 23) */
  __IO  __GMAC_ST2CW123_bits_t         GMAC_ST2CW123; /**< Offset: 0x7BC (R/W  32) Screening Type 2 Compare Word 1 Register (index = 23) */
} gmac_registers_t;
/** @}  end of Gigabit Ethernet MAC */

#endif /* _PIC32CZ_CA70_GMAC_COMPONENT_H_ */
